
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |    Change |    Destroy |
|:---------:|--------:|----------:|-----------:|
|     ✅     |      37 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                                                           |
|:--------:|:----------------------------------------------------------------------------------------------------|
|    🟢     | `module.jumphost.aws_autoscaling_group.jumphost`                                                    |
|    🟢     | `module.jumphost.aws_autoscaling_lifecycle_hook.launching`                                          |
|    🟢     | `module.jumphost.aws_autoscaling_lifecycle_hook.terminating`                                        |
|    🟢     | `module.jumphost.aws_iam_policy.required`                                                           |
|    🟢     | `module.jumphost.aws_launch_template.jumphost`                                                      |
|    🟢     | `module.jumphost.aws_security_group.jumphost`                                                       |
|    🟢     | `module.jumphost.aws_vpc_security_group_egress_rule.default`                                        |
|    🟢     | `module.jumphost.aws_vpc_security_group_ingress_rule.icmp`                                          |
|    🟢     | `module.jumphost.aws_vpc_security_group_ingress_rule.ssh`                                           |
|    🟢     | `module.jumphost.random_string.asg_name`                                                            |
|    🟢     | `module.jumphost.random_string.profile-suffix`                                                      |
|    🟢     | `module.jumphost.module.jumphost_profile.aws_iam_instance_profile.profile`                          |
|    🟢     | `module.jumphost.module.jumphost_profile.aws_iam_policy.profile`                                    |
|    🟢     | `module.jumphost.module.jumphost_profile.aws_iam_role.profile`                                      |
|    🟢     | `module.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.extra["package-publisher"]` |
|    🟢     | `module.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.extra["required"]`          |
|    🟢     | `module.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.profile`                    |
|    🟢     | `module.jumphost.module.update_dns.aws_cloudwatch_event_rule.instance_change`                       |
|    🟢     | `module.jumphost.module.update_dns.aws_cloudwatch_event_rule.scale`                                 |
|    🟢     | `module.jumphost.module.update_dns.aws_cloudwatch_event_target.instance-running`                    |
|    🟢     | `module.jumphost.module.update_dns.aws_cloudwatch_event_target.scale-out`                           |
|    🟢     | `module.jumphost.module.update_dns.aws_cloudwatch_log_group.update_dns`                             |
|    🟢     | `module.jumphost.module.update_dns.aws_iam_policy.lambda_logging`                                   |
|    🟢     | `module.jumphost.module.update_dns.aws_iam_policy.lambda_permissions`                               |
|    🟢     | `module.jumphost.module.update_dns.aws_iam_role.iam_for_lambda`                                     |
|    🟢     | `module.jumphost.module.update_dns.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole`      |
|    🟢     | `module.jumphost.module.update_dns.aws_iam_role_policy_attachment.lambda_logs`                      |
|    🟢     | `module.jumphost.module.update_dns.aws_iam_role_policy_attachment.lambda_permissions`               |
|    🟢     | `module.jumphost.module.update_dns.aws_lambda_function.update_dns`                                  |
|    🟢     | `module.jumphost.module.update_dns.aws_lambda_function_event_invoke_config.update_dns`              |
|    🟢     | `module.jumphost.module.update_dns.aws_lambda_permission.allow_cloudwatch_asg_lifecycle_hook`       |
|    🟢     | `module.jumphost.module.update_dns.aws_lambda_permission.allow_cloudwatch_instance_running`         |
|    🟢     | `module.jumphost.module.update_dns.aws_s3_bucket.lambda_tmp`                                        |
|    🟢     | `module.jumphost.module.update_dns.aws_s3_bucket_public_access_block.public_access`                 |
|    🟢     | `module.jumphost.module.update_dns.aws_s3_object.lambda_package`                                    |
|    🟢     | `module.jumphost.module.update_dns.null_resource.install_python_dependencies`                       |
|    🟢     | `module.jumphost.module.update_dns.random_uuid.lamda_src_hash`                                      |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.jumphost.data.aws_iam_policy_document.required_permissions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "required_permissions" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingInstances",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.jumphost.aws_autoscaling_group.jumphost will be created
  + resource "aws_autoscaling_group" "jumphost" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = (known after apply)
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = (known after apply)
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_instance_lifetime            = 7776000
      + max_size                         = 3
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = (known after apply)
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = [
          + "subnet-0df885dcc99418799",
        ]
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + instance_refresh {
          + strategy = "Rolling"

          + preferences {
              + max_healthy_percentage       = 100
              + min_healthy_percentage       = 100
              + scale_in_protected_instances = "Ignore"
              + skip_matching                = false
              + standby_instances            = "Ignore"
            }
        }

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "jumphost"
        }
    }

  # module.jumphost.aws_autoscaling_lifecycle_hook.launching will be created
  + resource "aws_autoscaling_lifecycle_hook" "launching" {
      + autoscaling_group_name = (known after apply)
      + default_result         = "ABANDON"
      + heartbeat_timeout      = 300
      + id                     = (known after apply)
      + lifecycle_transition   = "autoscaling:EC2_INSTANCE_LAUNCHING"
      + name                   = "launching"
    }

  # module.jumphost.aws_autoscaling_lifecycle_hook.terminating will be created
  + resource "aws_autoscaling_lifecycle_hook" "terminating" {
      + autoscaling_group_name = (known after apply)
      + default_result         = "ABANDON"
      + heartbeat_timeout      = 300
      + id                     = (known after apply)
      + lifecycle_transition   = "autoscaling:EC2_INSTANCE_TERMINATING"
      + name                   = "terminating"
    }

  # module.jumphost.aws_iam_policy.required will be created
  + resource "aws_iam_policy" "required" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
    }

  # module.jumphost.aws_launch_template.jumphost will be created
  + resource "aws_launch_template" "jumphost" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-07919a622dbba7dd9"
      + instance_type          = "t3a.micro"
      + key_name               = "aleks"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "jumphost-"
      + tags_all               = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + user_data              = "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJhcHQiOgogICJzb3VyY2VzIjoKICAgICJpbmZyYWhvdXNlIjoKICAgICAgImtleSI6IHwKICAgICAgICAtLS0tLUJFR0lOIFBHUCBQVUJMSUMgS0VZIEJMT0NLLS0tLS0KCiAgICAgICAgbVFJTkJHUzdGdGtCRUFERitZbURnNlF2c3Y1VjZaUXcrUWh4ZFR2ak1YZUxDOVQ2UkZSVkQ5NDdxS3p0Tk5RbgogICAgICAgICtBL3l4cHJMQW1XMjVVdS8xMW9Dc3pOVklJYVIzT1k4TXR5aWxiQ3R6VWtCenZXZGxYM0h2VHc5MUxwOGJ4VUwKICAgICAgICBFWE9NOW5zY3FPck92ZkJqYW5wbEtERUtQTVk2dklaM2twMXJVc0NOR0xCTDB4MktaZ1U4MHVsUnNNTThxbkJOCiAgICAgICAga3BUaUFlWEtPRVZ0UnpsV2x2T0ZMSjdwWUR2YVowVWdIU1Z1RStaa2xkcU9kTExScEtrZEl2SlBja1hxTDV4VAogICAgICAgIFV2V1RXMWVuRkFIZDUrTlF4TW5DYTNpa2pRVjNEVGxFanNnTExRYmJ5c1hqWFByNlBJUHMyOWNUY2ZvcTQzMU8KICAgICAgICB0UjREclpCNHZNRU9BODhUbUtCa0VpTUcraUI5Y2p6NXdCSXVNdTk1Wm1vSnhkdmpQUjcyRllLZ3JDWE50TmhkCiAgICAgICAgVmVyRVJ2cExUaGRhUm1aZ2k3bHkrRHZrWTdMcXlKUHZkSGNxeGVkZ0ZuUEtSNFQrZ1NRbWJVUGQ5cXFkSlIwUQogICAgICAgIEtsL1BtdHVTL3c5Z3kyWjRheTBRSUtyTkJ6UXhoQThMRFpwcDFydWZDSjUrWk1lZjkwdkhwd3hNK09hUHJ5TmwKICAgICAgICBFZERXN1lROGZ1QjVuUHFqd1VBcG1sWVlMSllsZDd2Sjc5RUl4L3NqZ2g2RytJRmltN3hSN1dpUUYvbkpldmZxCiAgICAgICAgdnpZTzdvci9HSUNiNmVad3ZQZHR5NzlIbVZlUHFFVGxEVTAwb3lvcFd5VHNZeVNZRFNIbi80ZG9UdXg4ditGLwogICAgICAgIFlleWJ2Z3FicmlIN2lTRjhIeHdFRmVEanJNdFVUSHNYQzM1REhGZU1DaEpveHN5S3Y0OEorYklHRndBUkFRQUIKICAgICAgICB0QzFKYm1aeVlVaHZkWE5sSUZCaFkydGhaMlZ5SUR4d1lXTnJZV2RsY2tCcGJtWnlZV2h2ZFhObExtTnZiVDZKCiAgICAgICAgQWxRRUV3RUtBRDRXSVFTaU5oNWtZM3c4VzBnQUY4WGd1SmFveGZjRDd3VUNaTHNXMlFJYkF3VUpBOEpuQUFVTAogICAgICAgIENRZ0hBZ1lWQ2drSUN3SUVGZ0lEQVFJZUFRSVhnQUFLQ1JEZ3VKYW94ZmNEN3diN0QvOWVuYnRPMURFUW4xUHQKICAgICAgICBoZ2t0SCtJcmJCZFlSSGs3MWlsMmhibm1BYm9Ma2sxYWsvYWFRWS9YUURKRmhyQTdqTWtQTE9DUmVvdEhpUW12CiAgICAgICAgMVVmcURjTTJlUTQveDBOOUYyRExVU2t1d3cxMTd2dHRVb0J4aXJCNzJwTzBUL2xkOW8zOVNITUMvRGZrNnk2aAogICAgICAgIHRUR3F4TGdoOGozRFN5TzVFRXJKTGEvM0J2TXFyNGlxYjNQVHdOZURSRWphdlFKaFhTdkVGanlBQ29vOWQ3cnMKICAgICAgICA3bGhDYmJTUGpnVGNHL1BDZnpMcjM3UXl6WGlUUi9Ud2ppd1ZkVGhkQ1MvQ0tuc29NOG5nSHhqWFlwSzdNNndnCiAgICAgICAgdHpBOEprSFpyNU1wa3JQR3JnUWV2aEpCTGtIUi9qY3NhYUJaTjdudzhhZUhjd3dNNC9DaEhJeVpkUTkxMDU5cAogICAgICAgIE9NYVltV21qUFFmcTFyT25BQXZBMXhXdytUWk56SGdXSXE0dnVzeDdPQnZyRnNWZVpOc3FkN09hNHBydFZXZzAKICAgICAgICA5MWNLWkpvL092Nm9wTS93RFdOMnlCbmttQkN3YVhwb0g1TkRRMjJiaG5HVEplSVdkZWk4VVNHcHZCa1R4QkkyCiAgICAgICAgWDMycHlPbVpEbjgxTDJ6TTJpb052Z1hJYjV1NXRqYjlOT2lBdDZvVzBHMHgwMGRncjNyNnB1OHFtTXdrQlZCQwogICAgICAgIHZXd0VtYXhRbmtUaG5iQWQ1N1ZiYXQ0Ly91RGNIRnBEYUJQcEZXZUNMMmRmRFNyUzlpaUs2SzFWa3ZHTG9YaDgKICAgICAgICBNcEpxam9kZHBmTmg0dXlmekt5TkUxZHJRMjltY3dmSWx6WG9QcmIwOVc2WkhwbSt0cWQ4TWs3MDd6d3NkRkdSCiAgICAgICAgcVJzeG10UG45SjFyZVlaaVZ1RTVHMjZmMWFLVFI3a0NEUVJrdXhiWkFSQUE0KzlrbjRzbUJYWmNNMHZGcTlSOAogICAgICAgIDI0WEtadFRhVm1Wb1ZKTVJRTTQ0cVdSK3MvUzBNenZiTzV1MGNTVlRoWTY1WXpNTHM5MjBVWTZ1R3BvUzJaWXcKICAgICAgICBJTWlwa2FCKzJGNkI4UjdWN25sL1NnYVhHYTJNZXhrQzd3dDZibEZiYXc3cGJ2SStpSTl3UzhCS0hnTUR6ZDBGCiAgICAgICAgVGpTcTl2ZGtWa2Y3eUkzaEV3bGxYN3pUNklMT3Zrbk5HYm9zMGRGSTkyY0JXUXMraVhQNTB4RFZpdDMrOW1DRAogICAgICAgIHJ1V1ZZazczbXZTRXpGY3VYQ3liS0o1VS9uelNRNzBKb1FtU1BjNTBSUWp1SEdkemwvWXpHRmFGbjV6SVo1cFAKICAgICAgICBrNVMrS1RZZWt6Y2lSa0h6YmVhNVBqK0E2S1ppbEtqNXlrQVJGencrQ1B4cXN1ZWpEa2k3QSthM20zV0dxK21tCiAgICAgICAgQWtsUTRZQmNvbHpOT3BnV2NsSVN1RTNkNWtndGFKQUNJZ3RlODdGNlFCQnNrOG9EQkZRQ25abW9PaXJsU2xiZgogICAgICAgIEp1RDZmVkNKdTJ6WTdUaE4xTzBvV1R3QWFOQXZNNTVDTFR2NnMzRm10UjkybG5sUURGdUorZmo4NjNjNnF4MTQKICAgICAgICBGdU80bU03ZXVTMDh3R2dWR205MXdBN2JZbDRhaHhDNlMyQkdCNUZ2a1pmekJCd2pzZm1VV0hBdTdWUlpKeGtYCiAgICAgICAgSnA2OTZPVGRSM1JmSTdJWjZPVzZ0R0VMaWpzd1diYlpYYjVYUldFVzk5dldPN05JSzZzT3ZoTUROcDliU011YgogICAgICAgIFhQM1BiUHhneVQwYm1zczB5d05Zd3VjbmZjbURYcVBWdTNHZHQ1M2F0MStoSzdtbG5RM3VVczVlVkVPSUhuSm0KICAgICAgICBmMXRyRGdnU1RFN2Zua3g2Q3psK2lNa0FFUUVBQVlrQ1BBUVlBUW9BSmhZaEJLSTJIbVJqZkR4YlNBQVh4ZUM0CiAgICAgICAgbHFqRjl3UHZCUUprdXhiWkFoc01CUWtEd21jQUFBb0pFT0M0bHFqRjl3UHY4U1FQL2pzUWZKQ1VIcmpwWDRmUAogICAgICAgIDBOdFZ5cWxDcnExT21MUDdCTHJYckN4b0FGUmI2NFlKVWRXazVQMzVrOXdqMkJRanBqY05qMmlrODBGb28wMkUKICAgICAgICB5YytQelcvNHR6VnZkeFJyRXpzT0ZtK21NUitsbFVIQUt6QmE2UUJ4SFQwb2ZMN3A1WFlUdU1ObllvK1BqVk1tCiAgICAgICAgalAzVEVKR1lYWW11aEdmYWFKWnBqTG1KRnFwNTl4Ly9kc01IZUxxVUNod2I2Q2c2RHVrQWloZUFzM1ArclhvMwogICAgICAgIHRCbkE0SkNDaVhSNy8vMFdlelJvU1BkYWxOZW00dnM4UFQ4N3NuSGJEbGlGTVZmOHcrZmtzSW5xdm90aVJESTQKICAgICAgICBRQnJCZnMzTmRlWlcvdG11cE9hWkpSekhEdnZLYmcvL082aXAxYVB2SUxXdlRETThLY1FDUUVTYVdrQ2JJMXVjCiAgICAgICAgcml6QU1ibFRCMmd5dzl5b2pDcFZDTUJYZGl6QXFxeWw1WlZydzQrWC9pMDlJc050OGhBOS81Ulk3djNjN1oyQwogICAgICAgIFh5MnhLV210TEk5bmxPU1N3VXhCNTY2STI5bFZLQkxVbVhtUWZuUklJSENpSkRYWUZEUC82TGZ2OSttaEVXVTgKICAgICAgICBxZWQzeGhwZU5TQUl6QStNVGxqdGlSbW9yeHBkZGlYYnRDYWZjUGwvSjNYMEIwN2ZjY0pad1pzQ1lDcHRMeTFjCiAgICAgICAgeXZWYU4rRUJtam9DcDNqdDZ3TGU0eGNscVUzQUN3ei84VEREbXRKN1VVZGw3TWRraXBRWjI3OEwya3BsNm82MQogICAgICAgIE1GMmZYRDdmWk1lWmZFdzZsdTBCRjVtWjAvY2gzSHhYZVpvWGlmNzlnMjV2Wm1TZFc5N3BjZWV3UGx2bEVURlEKICAgICAgICA1NXBNb3JReVVURVFDUTNFQ3pIWVNuTC9UbVc3CiAgICAgICAgPSswUmMKICAgICAgICAtLS0tLUVORCBQR1AgUFVCTElDIEtFWSBCTE9DSy0tLS0tCiAgICAgICJzb3VyY2UiOiAiZGViIFtzaWduZWQtYnk9JEtFWV9GSUxFXSBodHRwczovL3JlbGVhc2UtamFtbXkuaW5mcmFob3VzZS5jb20vICRSRUxFQVNFCiAgICAgICAgbWFpbiIKInBhY2thZ2VfdXBkYXRlIjogdHJ1ZQoicGFja2FnZXMiOgotICJwdXBwZXQtY29kZSIKLSAiaW5mcmFob3VzZS10b29sa2l0IgotICJpbmZyYWhvdXNlLXB1cHBldC1kYXRhIgoicHVwcGV0IjoKICAiY29sbGVjdGlvbiI6ICJwdXBwZXQ4IgogICJpbnN0YWxsIjogdHJ1ZQogICJpbnN0YWxsX3R5cGUiOiAiYWlvIgogICJwYWNrYWdlX25hbWUiOiAicHVwcGV0LWFnZW50IgogICJzdGFydF9zZXJ2aWNlIjogZmFsc2UKInJ1bmNtZCI6Ci0gLSAiaWgtcHVwcGV0IgogIC0gIi0tZW52aXJvbm1lbnQiCiAgLSAicHJvZHVjdGlvbiIKICAtICItLWVudmlyb25tZW50cGF0aCIKICAtICJ7cm9vdF9kaXJlY3Rvcnl9L2Vudmlyb25tZW50cyIKICAtICItLXJvb3QtZGlyZWN0b3J5IgogIC0gIi9vcHQvcHVwcGV0LWNvZGUiCiAgLSAiLS1oaWVyYS1jb25maWciCiAgLSAiL29wdC9pbmZyYWhvdXNlLXB1cHBldC1kYXRhL2Vudmlyb25tZW50cy9wcm9kdWN0aW9uL2hpZXJhLnlhbWwiCiAgLSAiLS1tb2R1bGUtcGF0aCIKICAtICJ7cm9vdF9kaXJlY3Rvcnl9L21vZHVsZXMiCiAgLSAiYXBwbHkiCiJ3cml0ZV9maWxlcyI6Ci0gImNvbnRlbnQiOiAiZXhwb3J0IEFXU19ERUZBVUxUX1JFR0lPTj11cy13ZXN0LTEiCiAgInBhdGgiOiAiL2V0Yy9wcm9maWxlLmQvYXdzLnNoIgogICJwZXJtaXNzaW9ucyI6ICIwNjQ0IgotICJjb250ZW50IjogfC0KICAgIFtkZWZhdWx0XQogICAgcmVnaW9uPXVzLXdlc3QtMQogICJwYXRoIjogIi9yb290Ly5hd3MvY29uZmlnIgogICJwZXJtaXNzaW9ucyI6ICIwNjAwIgotICJjb250ZW50IjogfAogICAgInB1cHBldF9lbnZpcm9ubWVudCI6ICJwcm9kdWN0aW9uIgogICAgInB1cHBldF9yb2xlIjogImp1bXBob3N0IgogICJwYXRoIjogIi9ldGMvcHVwcGV0bGFicy9mYWN0ZXIvZmFjdHMuZC9wdXBwZXQueWFtbCIKICAicGVybWlzc2lvbnMiOiAiMDY0NCIKLSAiY29udGVudCI6ICJ7XCJpaC1wdXBwZXRcIjp7XCJkZWJ1Z1wiOmZhbHNlLFwiZW52aXJvbm1lbnRwYXRoXCI6XCJ7cm9vdF9kaXJlY3Rvcnl9L2Vudmlyb25tZW50c1wiLFwiaGllcmEtY29uZmlnXCI6XCIvb3B0L2luZnJhaG91c2UtcHVwcGV0LWRhdGEvZW52aXJvbm1lbnRzL3Byb2R1Y3Rpb24vaGllcmEueWFtbFwiLFwibW9kdWxlLXBhdGhcIjpcIntyb290X2RpcmVjdG9yeX0vbW9kdWxlc1wiLFwicm9vdC1kaXJlY3RvcnlcIjpcIi9vcHQvcHVwcGV0LWNvZGVcIn19IgogICJwYXRoIjogIi9ldGMvcHVwcGV0bGFicy9mYWN0ZXIvZmFjdHMuZC9paC1wdXBwZXQuanNvbiIKICAicGVybWlzc2lvbnMiOiAiMDY0NCIKLSAiY29udGVudCI6ICJ7fSIKICAicGF0aCI6ICIvZXRjL3B1cHBldGxhYnMvZmFjdGVyL2ZhY3RzLmQvY3VzdG9tLmpzb24iCiAgInBlcm1pc3Npb25zIjogIjA2NDQiCg0KLS1NSU1FQk9VTkRBUlktLQ0K"
      + vpc_security_group_ids = (known after apply)

      + iam_instance_profile {
          + arn = (known after apply)
        }
    }

  # module.jumphost.aws_security_group.jumphost will be created
  + resource "aws_security_group" "jumphost" {
      + arn                    = (known after apply)
      + description            = "Manage traffic to jumphost"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "jumphost"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "jumphost"
        }
      + tags_all               = {
          + "Name"        = "jumphost"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + vpc_id                 = "vpc-08e19d859c26d18b2"
    }

  # module.jumphost.aws_vpc_security_group_egress_rule.default will be created
  + resource "aws_vpc_security_group_egress_rule" "default" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all traffic"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "outgoing traffic"
        }
      + tags_all               = {
          + "Name"        = "outgoing traffic"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
    }

  # module.jumphost.aws_vpc_security_group_ingress_rule.icmp will be created
  + resource "aws_vpc_security_group_ingress_rule" "icmp" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all ICMP traffic"
      + from_port              = -1
      + id                     = (known after apply)
      + ip_protocol            = "icmp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "ICMP traffic"
        }
      + tags_all               = {
          + "Name"        = "ICMP traffic"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + to_port                = -1
    }

  # module.jumphost.aws_vpc_security_group_ingress_rule.ssh will be created
  + resource "aws_vpc_security_group_ingress_rule" "ssh" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow SSH traffic"
      + from_port              = 22
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "SSH access"
        }
      + tags_all               = {
          + "Name"        = "SSH access"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + to_port                = 22
    }

  # module.jumphost.random_string.asg_name will be created
  + resource "random_string" "asg_name" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.jumphost.random_string.profile-suffix will be created
  + resource "random_string" "profile-suffix" {
      + id          = (known after apply)
      + length      = 12
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.jumphost.module.jumphost_profile.aws_iam_instance_profile.profile will be created
  + resource "aws_iam_instance_profile" "profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = (known after apply)
      + tags_all    = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + unique_id   = (known after apply)
    }

  # module.jumphost.module.jumphost_profile.aws_iam_policy.profile will be created
  + resource "aws_iam_policy" "profile" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ec2:Describe*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
    }

  # module.jumphost.module.jumphost_profile.aws_iam_role.profile will be created
  + resource "aws_iam_role" "profile" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + unique_id             = (known after apply)
    }

  # module.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.extra["package-publisher"] will be created
  + resource "aws_iam_role_policy_attachment" "extra" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::493370826424:policy/package-publisher"
      + role       = (known after apply)
    }

  # module.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.extra["required"] will be created
  + resource "aws_iam_role_policy_attachment" "extra" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.profile will be created
  + resource "aws_iam_role_policy_attachment" "profile" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.jumphost.module.update_dns.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/jumphost.update_dns/update_dns"
      + type                = "zip"
    }

  # module.jumphost.module.update_dns.data.aws_iam_policy_document.lambda-permissions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-permissions" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:CompleteLifecycleAction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ec2:DescribeInstances",
              + "ec2:DescribeTags",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:CreateTags",
            ]
          + resources = [
              + "arn:aws:ec2:*:493370826424:instance/*",
            ]
        }
      + statement {
          + actions   = [
              + "route53:ChangeResourceRecordSets",
              + "route53:ListResourceRecordSets",
            ]
          + resources = [
              + "arn:aws:route53:::hostedzone/Z07662251LH3YRF2ERM3G",
            ]
        }
    }

  # module.jumphost.module.update_dns.data.aws_iam_policy_document.lambda_logging will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_logging" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:us-west-1:493370826424:log-group:*:log-stream:*",
            ]
        }
    }

  # module.jumphost.module.update_dns.aws_cloudwatch_event_rule.instance_change will be created
  + resource "aws_cloudwatch_event_rule" "instance_change" {
      + arn            = (known after apply)
      + description    = "Instance running"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + state = [
                      + "running",
                      + "shutting-down",
                    ]
                }
              + detail-type = [
                  + "EC2 Instance State-change Notification",
                ]
              + source      = [
                  + "aws.ec2",
                ]
            }
        )
      + id             = (known after apply)
      + name           = (known after apply)
      + name_prefix    = "asg_instance"
      + tags_all       = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
    }

  # module.jumphost.module.update_dns.aws_cloudwatch_event_rule.scale will be created
  + resource "aws_cloudwatch_event_rule" "scale" {
      + arn            = (known after apply)
      + description    = "ASG lifecycle hook"
      + event_bus_name = "default"
      + event_pattern  = (known after apply)
      + id             = (known after apply)
      + name           = (known after apply)
      + name_prefix    = "asg-scale"
      + tags_all       = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
    }

  # module.jumphost.module.update_dns.aws_cloudwatch_event_target.instance-running will be created
  + resource "aws_cloudwatch_event_target" "instance-running" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # module.jumphost.module.update_dns.aws_cloudwatch_event_target.scale-out will be created
  + resource "aws_cloudwatch_event_target" "scale-out" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # module.jumphost.module.update_dns.aws_cloudwatch_log_group.update_dns will be created
  + resource "aws_cloudwatch_log_group" "update_dns" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = (known after apply)
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags_all          = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
    }

  # module.jumphost.module.update_dns.aws_iam_policy.lambda_logging will be created
  + resource "aws_iam_policy" "lambda_logging" {
      + arn         = (known after apply)
      + description = "IAM policy for logging from a lambda"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "lambda_logging"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
    }

  # module.jumphost.module.update_dns.aws_iam_policy.lambda_permissions will be created
  + resource "aws_iam_policy" "lambda_permissions" {
      + arn         = (known after apply)
      + description = "IAM policy for a lambda permissions"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "lambda_permissions"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
    }

  # module.jumphost.module.update_dns.aws_iam_role.iam_for_lambda will be created
  + resource "aws_iam_role" "iam_for_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "iam_for_lambda"
      + path                  = "/"
      + tags_all              = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + unique_id             = (known after apply)
    }

  # module.jumphost.module.update_dns.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaBasicExecutionRole" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = (known after apply)
    }

  # module.jumphost.module.update_dns.aws_iam_role_policy_attachment.lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.jumphost.module.update_dns.aws_iam_role_policy_attachment.lambda_permissions will be created
  + resource "aws_iam_role_policy_attachment" "lambda_permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.jumphost.module.update_dns.aws_lambda_function.update_dns will be created
  + resource "aws_lambda_function" "update_dns" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = (known after apply)
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + s3_bucket                      = (known after apply)
      + s3_key                         = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }
    }

  # module.jumphost.module.update_dns.aws_lambda_function_event_invoke_config.update_dns will be created
  + resource "aws_lambda_function_event_invoke_config" "update_dns" {
      + function_name          = (known after apply)
      + id                     = (known after apply)
      + maximum_retry_attempts = 0
    }

  # module.jumphost.module.update_dns.aws_lambda_permission.allow_cloudwatch_asg_lifecycle_hook will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_asg_lifecycle_hook" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # module.jumphost.module.update_dns.aws_lambda_permission.allow_cloudwatch_instance_running will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_instance_running" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # module.jumphost.module.update_dns.aws_s3_bucket.lambda_tmp will be created
  + resource "aws_s3_bucket" "lambda_tmp" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "infrahouse-asg-lambda-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.jumphost.module.update_dns.aws_s3_bucket_public_access_block.public_access will be created
  + resource "aws_s3_bucket_public_access_block" "public_access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.jumphost.module.update_dns.aws_s3_object.lambda_package will be created
  + resource "aws_s3_object" "lambda_package" {
      + acl                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = (known after apply)
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + version_id             = (known after apply)
    }

  # module.jumphost.module.update_dns.null_resource.install_python_dependencies will be created
  + resource "null_resource" "install_python_dependencies" {
      + id       = (known after apply)
      + triggers = {
          + "dependencies_version" = "715a0f7310ae4dabf9b710802339dcd5"
          + "main_version"         = "5a37bacb3628184e3d52726a91564155"
        }
    }

  # module.jumphost.module.update_dns.random_uuid.lamda_src_hash will be created
  + resource "random_uuid" "lamda_src_hash" {
      + id      = (known after apply)
      + keepers = {
          + "main.py"          = "5a37bacb3628184e3d52726a91564155"
          + "requirements.txt" = "715a0f7310ae4dabf9b710802339dcd5"
        }
      + result  = (known after apply)
    }

Plan: 37 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: data.terraform_remote_state.cicd: Reading...%0Amodule.release_infrahouse_com["focal"].random_password.passphrase: Refreshing state... [id=none]%0Amodule.release_infrahouse_com["jammy"].random_password.passphrase: Refreshing state... [id=none]%0Amodule.jumphost.module.jumphost_profile.data.aws_iam_policy_document.assume: Reading...%0Amodule.jumphost.module.update_dns.data.aws_caller_identity.current: Reading...%0Amodule.release_infrahouse_com["focal"].aws_secretsmanager_secret.passphrase: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-focal-gzxQPq]%0Amodule.jumphost.module.update_dns.data.aws_iam_policy.AWSLambdaBasicExecutionRole: Reading...%0Amodule.release_infrahouse_com["jammy"].aws_secretsmanager_secret.passphrase: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-jammy-xa6PTG]%0Amodule.jumphost.module.update_dns.data.aws_iam_policy_document.assume_role: Reading...%0Adata.aws_iam_policy.administrator-access: Reading...%0Amodule.jumphost.module.jumphost_profile.data.aws_iam_policy_document.assume: Read complete after 0s [id=2851119427]%0Amodule.jumphost.module.update_dns.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]%0Amodule.infrahouse_com.aws_route53_zone.infrahouse_com: Refreshing state... [id=Z07662251LH3YRF2ERM3G]%0Adata.aws_ami.ubuntu_22: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy.admin: Reading...%0Amodule.jumphost.module.update_dns.data.aws_caller_identity.current: Read complete after 0s [id=493370826424]%0Amodule.jumphost.module.update_dns.data.aws_region.current: Reading...%0Amodule.jumphost.module.update_dns.data.aws_region.current: Read complete after 0s [id=us-west-1]%0Amodule.infrahouse-puppet-data-github.data.aws_iam_openid_connect_provider.github: Reading...%0Amodule.release_infrahouse_com["jammy"].aws_cloudfront_function.http_auth: Refreshing state... [id=release-jammy_infrahouse_com-auth]%0Amodule.release_infrahouse_com["focal"].aws_cloudfront_function.http_auth: Refreshing state... [id=release-focal_infrahouse_com-auth]%0Adata.terraform_remote_state.cicd: Read complete after 0s%0Amodule.management.aws_vpc.vpc: Refreshing state... [id=vpc-08e19d859c26d18b2]%0Adata.aws_ami.ubuntu_22: Read complete after 1s [id=ami-07919a622dbba7dd9]%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy.admin: Reading...%0Amodule.infrahouse-puppet-data-github.data.aws_iam_openid_connect_provider.github: Read complete after 1s [id=arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-permissions: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=83731904]%0Amodule.puppet-code-github.data.aws_iam_openid_connect_provider.github: Reading...%0Amodule.jumphost.data.aws_caller_identity.current: Reading...%0Amodule.jumphost.data.aws_caller_identity.current: Read complete after 0s [id=493370826424]%0Amodule.jumphost.data.aws_iam_policy_document.jumphost_permissions: Reading...%0Amodule.jumphost.data.aws_iam_policy_document.jumphost_permissions: Read complete after 0s [id=2218315402]%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy_document.github-permissions: Reading...%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=1585346832]%0Amodule.jumphost.module.jumphost_userdata.data.aws_region.current: Reading...%0Amodule.jumphost.module.jumphost_userdata.data.aws_region.current: Read complete after 0s [id=us-west-1]%0Amodule.jumphost.data.aws_ami.ubuntu: Reading...%0Amodule.jumphost.data.aws_region.current: Reading...%0Amodule.jumphost.data.aws_region.current: Read complete after 0s [id=us-west-1]%0Amodule.release_infrahouse_com["jammy"].aws_cloudfront_cache_policy.default: Refreshing state... [id=b04aff45-48e1-4501-90d3-998c9fa1f264]%0Amodule.jumphost.data.aws_ami.ubuntu: Read complete after 0s [id=ami-07919a622dbba7dd9]%0Amodule.release_infrahouse_com["focal"].aws_cloudfront_cache_policy.default: Refreshing state... [id=5db494dd-546b-4231-a0c7-133b245ada49]%0Amodule.puppet-code-github.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket.repo-logs: Refreshing state... [id=infrahouse-release-jammy-logs]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket.repo-logs: Refreshing state... [id=infrahouse-release-focal-logs]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket.repo: Refreshing state... [id=infrahouse-release-jammy]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket.repo: Refreshing state... [id=infrahouse-release-focal]%0Aaws_key_pair.aleks: Refreshing state... [id=aleks]%0Adata.aws_availability_zones.uw1: Reading...%0Amodule.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com]%0Amodule.release_infrahouse_com["focal"].aws_secretsmanager_secret.key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-focal-XrTWrP]%0Adata.aws_availability_zones.uw1: Read complete after 0s [id=us-west-1]%0Amodule.release_infrahouse_com["jammy"].aws_secretsmanager_secret.key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-jammy-XrTWrP]%0Amodule.release_infrahouse_com["focal"].aws_secretsmanager_secret_version.passphrase: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-focal-gzxQPq|6586EB13-79C2-424D-AFED-6810E61156D7]%0Amodule.release_infrahouse_com["jammy"].aws_secretsmanager_secret_version.passphrase: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-jammy-xa6PTG|D6ABCB2B-F850-4487-A764-07263736323E]%0Adata.aws_route53_zone.cicd-ih-com: Reading...%0Amodule.infrahouse-puppet-data-github.data.aws_iam_policy_document.github-trust: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::493370826424:policy/ih-tf-aws-control-493370826424-github]%0Amodule.infrahouse-puppet-data-github.data.aws_iam_policy_document.github-trust: Read complete after 0s [id=290351380]%0Amodule.release_infrahouse_com["jammy"].aws_acm_certificate.repo: Refreshing state... [id=arn:aws:acm:us-east-1:493370826424:certificate/402852e1-7054-4cea-80ac-3ccbee72a398]%0Amodule.release_infrahouse_com["focal"].aws_acm_certificate.repo: Refreshing state... [id=arn:aws:acm:us-east-1:493370826424:certificate/2eed53d3-e1ad-4743-ace5-89c193cd3c65]%0Amodule.ih-tf-infrahouse-website-infra-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::493370826424:policy/ih-tf-infrahouse-website-infra-github]%0Amodule.jumphost.module.jumphost_userdata.data.cloudinit_config.config: Reading...%0Amodule.jumphost.module.jumphost_userdata.data.cloudinit_config.config: Read complete after 0s [id=4104788115]%0Amodule.infrahouse_com.aws_route53_record.txt_spf: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_TXT]%0Amodule.infrahouse_com.aws_route53_record.spf: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_SPF]%0Amodule.infrahouse_com.aws_route53_record.mx: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_MX]%0Adata.aws_iam_policy.administrator-access: Read complete after 2s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.infrahouse_com.aws_route53_record.txt_dkim: Refreshing state... [id=Z07662251LH3YRF2ERM3G_google._domainkey.infrahouse.com_TXT]%0Amodule.jumphost.module.update_dns.data.aws_iam_policy.AWSLambdaBasicExecutionRole: Read complete after 2s [id=arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]%0Amodule.puppet-code-github.data.aws_iam_policy_document.github-trust: Reading...%0Amodule.puppet-code-github.data.aws_iam_policy_document.github-trust: Read complete after 0s [id=2423520793]%0Amodule.management.aws_default_security_group.default: Refreshing state... [id=sg-08b960b85f5996100]%0Amodule.management.aws_internet_gateway.ig: Refreshing state... [id=igw-079090e09ed5db582]%0Amodule.management.aws_default_route_table.default: Refreshing state... [id=rtb-0d73383afeb6ad142]%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy.admin: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket_ownership_controls.repo-logs: Refreshing state... [id=infrahouse-release-jammy-logs]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket_ownership_controls.repo-logs: Refreshing state... [id=infrahouse-release-focal-logs]%0Adata.aws_route53_zone.cicd-ih-com: Read complete after 1s [id=Z06790082OU0POPWOCPZ4]%0Amodule.infrahouse-puppet-data-github.aws_iam_role.github: Refreshing state... [id=ih-tf-infrahouse-puppet-data-github]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy.admin: Read complete after 2s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket_website_configuration.repo: Refreshing state... [id=infrahouse-release-jammy]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket_website_configuration.repo: Refreshing state... [id=infrahouse-release-focal]%0Amodule.release_infrahouse_com["jammy"].data.aws_iam_policy_document.public-access: Reading...%0Amodule.release_infrahouse_com["jammy"].data.aws_iam_policy_document.public-access: Read complete after 0s [id=4184171728]%0Amodule.release_infrahouse_com["focal"].data.aws_iam_policy_document.public-access: Reading...%0Amodule.release_infrahouse_com["focal"].data.aws_iam_policy_document.public-access: Read complete after 0s [id=1693473946]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket_ownership_controls.repo: Refreshing state... [id=infrahouse-release-jammy]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket_ownership_controls.repo: Refreshing state... [id=infrahouse-release-focal]%0Amodule.release_infrahouse_com["jammy"].aws_s3_object.distributions: Refreshing state... [id=conf/distributions]%0Amodule.release_infrahouse_com["focal"].aws_s3_object.distributions: Refreshing state... [id=conf/distributions]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket_public_access_block.repo: Refreshing state... [id=infrahouse-release-jammy]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket_public_access_block.repo: Refreshing state... [id=infrahouse-release-focal]%0Amodule.puppet-code-github.aws_iam_role.github: Refreshing state... [id=ih-tf-puppet-code-github]%0Amodule.management.aws_route_table.all["10.0.0.0/24"]: Refreshing state... [id=rtb-04a16e74d5b12a338]%0Amodule.management.aws_route_table.all["10.0.1.0/24"]: Refreshing state... [id=rtb-067c30e65dd4108e9]%0Amodule.management.aws_subnet.all["10.0.0.0/24"]: Refreshing state... [id=subnet-0df885dcc99418799]%0Amodule.management.aws_subnet.all["10.0.1.0/24"]: Refreshing state... [id=subnet-0f91dd2675e7a16c3]%0Adata.aws_iam_policy_document.github-assume: Reading...%0Adata.aws_iam_policy_document.github-assume: Read complete after 0s [id=3592205772]%0Adata.aws_iam_policy_document.infrahouse-com-github-assume: Reading...%0Adata.aws_iam_policy_document.infrahouse-com-github-assume: Read complete after 0s [id=1754214164]%0Amodule.management.aws_vpc_security_group_ingress_rule.default[0]: Refreshing state... [id=sgr-06140053abc62a119]%0Amodule.management.aws_vpc_security_group_egress_rule.default[0]: Refreshing state... [id=sgr-0e1eea4ce5b798046]%0Aaws_route53_record.ci-cd-ns: Refreshing state... [id=Z07662251LH3YRF2ERM3G_ci-cd.infrahouse.com_NS]%0Amodule.jumphost.data.aws_route53_zone.jumphost_zone: Reading...%0Amodule.release_infrahouse_com["jammy"].aws_route53_record.cert_validation["release-jammy.infrahouse.com"]: Refreshing state... [id=Z07662251LH3YRF2ERM3G__047ae29925ec0297eaebfeddc886f234.release-jammy.infrahouse.com._CNAME]%0Amodule.release_infrahouse_com["focal"].aws_route53_record.cert_validation["release-focal.infrahouse.com"]: Refreshing state... [id=Z07662251LH3YRF2ERM3G__87f2ead3abf68134c497bf52718e07b1.release-focal.infrahouse.com._CNAME]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket_acl.repo-logs: Refreshing state... [id=infrahouse-release-jammy-logs,private]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket_acl.repo-logs: Refreshing state... [id=infrahouse-release-focal-logs,private]%0Amodule.management.aws_route.default_main: Refreshing state... [id=r-rtb-0d73383afeb6ad1421080289494]%0Amodule.management.aws_eip.nat_eip["10.0.0.0/24"]: Refreshing state... [id=eipalloc-02b42e70d52a5db7f]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-assume: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=3911844868]%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy_document.github-assume: Reading...%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=709841391]%0Aaws_iam_role.infrahouse-toolkit-github: Refreshing state... [id=infrahouse-toolkit-github]%0Aaws_iam_role.infrahouse-com-github: Refreshing state... [id=infrahouse-com-github]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket_acl.repo: Refreshing state... [id=infrahouse-release-jammy,public-read]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket_acl.repo: Refreshing state... [id=infrahouse-release-focal,public-read]%0Amodule.jumphost.module.update_dns.data.aws_route53_zone.asg_zone: Reading...%0Amodule.management.aws_route.subnet_public["10.0.0.0/24"]: Refreshing state... [id=r-rtb-04a16e74d5b12a3381080289494]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-493370826424-github]%0Amodule.ih-tf-infrahouse-website-infra-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-infrahouse-website-infra-github]%0Amodule.management.aws_route_table_association.private_rt_assoc["10.0.0.0/24"]: Refreshing state... [id=rtbassoc-08a410160e2dcc592]%0Amodule.management.aws_route_table_association.private_rt_assoc["10.0.1.0/24"]: Refreshing state... [id=rtbassoc-099b958af19485f2b]%0Amodule.management.aws_nat_gateway.nat_gw["10.0.0.0/24"]: Refreshing state... [id=nat-08fb9b52683277947]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket_policy.public-access: Refreshing state... [id=infrahouse-release-focal]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket_policy.public-access: Refreshing state... [id=infrahouse-release-jammy]%0Amodule.release_infrahouse_com["jammy"].aws_s3_object.index-html: Refreshing state... [id=index.html]%0Amodule.release_infrahouse_com["focal"].aws_s3_object.index-html: Refreshing state... [id=index.html]%0Amodule.release_infrahouse_com["jammy"].aws_s3_object.deb-gpg-public-key: Refreshing state... [id=DEB-GPG-KEY-release-jammy.infrahouse.com]%0Amodule.release_infrahouse_com["focal"].aws_s3_object.deb-gpg-public-key: Refreshing state... [id=DEB-GPG-KEY-release-focal.infrahouse.com]%0Amodule.jumphost.data.aws_subnet.selected: Reading...%0Amodule.management.aws_route.subnet_private["10.0.1.0/24"]: Refreshing state... [id=r-rtb-067c30e65dd4108e91080289494]%0Amodule.release_infrahouse_com["focal"].aws_acm_certificate_validation.repo: Refreshing state... [id=2023-07-24 18:51:39.442 +0000 UTC]%0Amodule.release_infrahouse_com["jammy"].aws_acm_certificate_validation.repo: Refreshing state... [id=2023-07-24 18:51:39.051 +0000 UTC]%0Amodule.jumphost.data.aws_subnet.selected: Read complete after 0s [id=subnet-0df885dcc99418799]%0Amodule.ih-tf-infrahouse-website-infra-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-infrahouse-website-infra-github-20230818034150993400000001]%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy_document.admin-assume: Reading...%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=2714260376]%0Amodule.ih-tf-infrahouse-website-infra-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-infrahouse-website-infra-admin]%0Amodule.jumphost.data.aws_route53_zone.jumphost_zone: Read complete after 1s [id=Z07662251LH3YRF2ERM3G]%0Amodule.jumphost.module.update_dns.data.aws_route53_zone.asg_zone: Read complete after 1s [id=Z07662251LH3YRF2ERM3G]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-aws-control-493370826424-github-20230817010818258200000001]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.admin-assume: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=2899629952]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-493370826424-admin]%0Amodule.release_infrahouse_com["jammy"].aws_cloudfront_distribution.repo: Refreshing state... [id=E1IILWIY0OU78B]%0Amodule.release_infrahouse_com["focal"].aws_cloudfront_distribution.repo: Refreshing state... [id=E161QGCPE3JIOK]%0Amodule.ih-tf-infrahouse-website-infra-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-infrahouse-website-infra-admin-20230818034158985100000002]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-493370826424-admin-20230709164321319900000001]%0Amodule.release_infrahouse_com["jammy"].aws_route53_record.repo: Refreshing state... [id=Z07662251LH3YRF2ERM3G_release-jammy.infrahouse.com_A]%0Amodule.release_infrahouse_com["focal"].aws_route53_record.repo: Refreshing state... [id=Z07662251LH3YRF2ERM3G_release-focal.infrahouse.com_A]%0Adata.aws_iam_policy_document.package-publisher: Reading...%0Adata.aws_iam_policy_document.package-publisher: Read complete after 0s [id=4050006037]%0Aaws_iam_policy.package-publisher: Refreshing state... [id=arn:aws:iam::493370826424:policy/package-publisher]%0Aaws_iam_role_policy_attachment.infrahouse-puppet-data-github: Refreshing state... [id=ih-tf-infrahouse-puppet-data-github-20231108133200175400000001]%0Aaws_iam_role_policy_attachment.infrahouse-com-github: Refreshing state... [id=infrahouse-com-github-20230819214139756300000001]%0Aaws_iam_role_policy_attachment.puppet-code-github: Refreshing state... [id=ih-tf-puppet-code-github-20231108132248583100000001]%0Aaws_iam_role_policy_attachment.infrahouse-toolkit-github: Refreshing state... [id=infrahouse-toolkit-github-20230728211642836200000001]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.jumphost.data.aws_iam_policy_document.required_permissions will be read during apply%0A  # (config refers to values not yet known)%0A <= data "aws_iam_policy_document" "required_permissions" {%0A      + id   = (known after apply)%0A      + json = (known after apply)%0A%0A      + statement {%0A          + actions   = [%0A              + "autoscaling:DescribeAutoScalingInstances",%0A            ]%0A          + resources = [%0A              + (known after apply),%0A            ]%0A        }%0A    }%0A%0A  # module.jumphost.aws_autoscaling_group.jumphost will be created%0A  + resource "aws_autoscaling_group" "jumphost" {%0A      + arn                              = (known after apply)%0A      + availability_zones               = (known after apply)%0A      + default_cooldown                 = (known after apply)%0A      + desired_capacity                 = (known after apply)%0A      + force_delete                     = false%0A      + force_delete_warm_pool           = false%0A      + health_check_grace_period        = 300%0A      + health_check_type                = (known after apply)%0A      + id                               = (known after apply)%0A      + ignore_failed_scaling_activities = false%0A      + load_balancers                   = (known after apply)%0A      + max_instance_lifetime            = 7776000%0A      + max_size                         = 3%0A      + metrics_granularity              = "1Minute"%0A      + min_size                         = 1%0A      + name                             = (known after apply)%0A      + name_prefix                      = (known after apply)%0A      + predicted_capacity               = (known after apply)%0A      + protect_from_scale_in            = false%0A      + service_linked_role_arn          = (known after apply)%0A      + target_group_arns                = (known after apply)%0A      + vpc_zone_identifier              = [%0A          + "subnet-0df885dcc99418799",%0A        ]%0A      + wait_for_capacity_timeout        = "10m"%0A      + warm_pool_size                   = (known after apply)%0A%0A      + instance_refresh {%0A          + strategy = "Rolling"%0A%0A          + preferences {%0A              + max_healthy_percentage       = 100%0A              + min_healthy_percentage       = 100%0A              + scale_in_protected_instances = "Ignore"%0A              + skip_matching                = false%0A              + standby_instances            = "Ignore"%0A            }%0A        }%0A%0A      + launch_template {%0A          + id      = (known after apply)%0A          + name    = (known after apply)%0A          + version = (known after apply)%0A        }%0A%0A      + tag {%0A          + key                 = "Name"%0A          + propagate_at_launch = true%0A          + value               = "jumphost"%0A        }%0A    }%0A%0A  # module.jumphost.aws_autoscaling_lifecycle_hook.launching will be created%0A  + resource "aws_autoscaling_lifecycle_hook" "launching" {%0A      + autoscaling_group_name = (known after apply)%0A      + default_result         = "ABANDON"%0A      + heartbeat_timeout      = 300%0A      + id                     = (known after apply)%0A      + lifecycle_transition   = "autoscaling:EC2_INSTANCE_LAUNCHING"%0A      + name                   = "launching"%0A    }%0A%0A  # module.jumphost.aws_autoscaling_lifecycle_hook.terminating will be created%0A  + resource "aws_autoscaling_lifecycle_hook" "terminating" {%0A      + autoscaling_group_name = (known after apply)%0A      + default_result         = "ABANDON"%0A      + heartbeat_timeout      = 300%0A      + id                     = (known after apply)%0A      + lifecycle_transition   = "autoscaling:EC2_INSTANCE_TERMINATING"%0A      + name                   = "terminating"%0A    }%0A%0A  # module.jumphost.aws_iam_policy.required will be created%0A  + resource "aws_iam_policy" "required" {%0A      + arn         = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A      + name_prefix = (known after apply)%0A      + path        = "/"%0A      + policy      = (known after apply)%0A      + policy_id   = (known after apply)%0A      + tags_all    = {%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A        }%0A    }%0A%0A  # module.jumphost.aws_launch_template.jumphost will be created%0A  + resource "aws_launch_template" "jumphost" {%0A      + arn                    = (known after apply)%0A      + default_version        = (known after apply)%0A      + id                     = (known after apply)%0A      + image_id               = "ami-07919a622dbba7dd9"%0A      + instance_type          = "t3a.micro"%0A      + key_name               = "aleks"%0A      + latest_version         = (known after apply)%0A      + name                   = (known after apply)%0A      + name_prefix            = "jumphost-"%0A      + tags_all               = {%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A        }%0A      + user_data              = "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJhcHQiOgogICJzb3VyY2VzIjoKICAgICJpbmZyYWhvdXNlIjoKICAgICAgImtleSI6IHwKICAgICAgICAtLS0tLUJFR0lOIFBHUCBQVUJMSUMgS0VZIEJMT0NLLS0tLS0KCiAgICAgICAgbVFJTkJHUzdGdGtCRUFERitZbURnNlF2c3Y1VjZaUXcrUWh4ZFR2ak1YZUxDOVQ2UkZSVkQ5NDdxS3p0Tk5RbgogICAgICAgICtBL3l4cHJMQW1XMjVVdS8xMW9Dc3pOVklJYVIzT1k4TXR5aWxiQ3R6VWtCenZXZGxYM0h2VHc5MUxwOGJ4VUwKICAgICAgICBFWE9NOW5zY3FPck92ZkJqYW5wbEtERUtQTVk2dklaM2twMXJVc0NOR0xCTDB4MktaZ1U4MHVsUnNNTThxbkJOCiAgICAgICAga3BUaUFlWEtPRVZ0UnpsV2x2T0ZMSjdwWUR2YVowVWdIU1Z1RStaa2xkcU9kTExScEtrZEl2SlBja1hxTDV4VAogICAgICAgIFV2V1RXMWVuRkFIZDUrTlF4TW5DYTNpa2pRVjNEVGxFanNnTExRYmJ5c1hqWFByNlBJUHMyOWNUY2ZvcTQzMU8KICAgICAgICB0UjREclpCNHZNRU9BODhUbUtCa0VpTUcraUI5Y2p6NXdCSXVNdTk1Wm1vSnhkdmpQUjcyRllLZ3JDWE50TmhkCiAgICAgICAgVmVyRVJ2cExUaGRhUm1aZ2k3bHkrRHZrWTdMcXlKUHZkSGNxeGVkZ0ZuUEtSNFQrZ1NRbWJVUGQ5cXFkSlIwUQogICAgICAgIEtsL1BtdHVTL3c5Z3kyWjRheTBRSUtyTkJ6UXhoQThMRFpwcDFydWZDSjUrWk1lZjkwdkhwd3hNK09hUHJ5TmwKICAgICAgICBFZERXN1lROGZ1QjVuUHFqd1VBcG1sWVlMSllsZDd2Sjc5RUl4L3NqZ2g2RytJRmltN3hSN1dpUUYvbkpldmZxCiAgICAgICAgdnpZTzdvci9HSUNiNmVad3ZQZHR5NzlIbVZlUHFFVGxEVTAwb3lvcFd5VHNZeVNZRFNIbi80ZG9UdXg4ditGLwogICAgICAgIFlleWJ2Z3FicmlIN2lTRjhIeHdFRmVEanJNdFVUSHNYQzM1REhGZU1DaEpveHN5S3Y0OEorYklHRndBUkFRQUIKICAgICAgICB0QzFKYm1aeVlVaHZkWE5sSUZCaFkydGhaMlZ5SUR4d1lXTnJZV2RsY2tCcGJtWnlZV2h2ZFhObExtTnZiVDZKCiAgICAgICAgQWxRRUV3RUtBRDRXSVFTaU5oNWtZM3c4VzBnQUY4WGd1SmFveGZjRDd3VUNaTHNXMlFJYkF3VUpBOEpuQUFVTAogICAgICAgIENRZ0hBZ1lWQ2drSUN3SUVGZ0lEQVFJZUFRSVhnQUFLQ1JEZ3VKYW94ZmNEN3diN0QvOWVuYnRPMURFUW4xUHQKICAgICAgICBoZ2t0SCtJcmJCZFlSSGs3MWlsMmhibm1BYm9Ma2sxYWsvYWFRWS9YUURKRmhyQTdqTWtQTE9DUmVvdEhpUW12CiAgICAgICAgMVVmcURjTTJlUTQveDBOOUYyRExVU2t1d3cxMTd2dHRVb0J4aXJCNzJwTzBUL2xkOW8zOVNITUMvRGZrNnk2aAogICAgICAgIHRUR3F4TGdoOGozRFN5TzVFRXJKTGEvM0J2TXFyNGlxYjNQVHdOZURSRWphdlFKaFhTdkVGanlBQ29vOWQ3cnMKICAgICAgICA3bGhDYmJTUGpnVGNHL1BDZnpMcjM3UXl6WGlUUi9Ud2ppd1ZkVGhkQ1MvQ0tuc29NOG5nSHhqWFlwSzdNNndnCiAgICAgICAgdHpBOEprSFpyNU1wa3JQR3JnUWV2aEpCTGtIUi9qY3NhYUJaTjdudzhhZUhjd3dNNC9DaEhJeVpkUTkxMDU5cAogICAgICAgIE9NYVltV21qUFFmcTFyT25BQXZBMXhXdytUWk56SGdXSXE0dnVzeDdPQnZyRnNWZVpOc3FkN09hNHBydFZXZzAKICAgICAgICA5MWNLWkpvL092Nm9wTS93RFdOMnlCbmttQkN3YVhwb0g1TkRRMjJiaG5HVEplSVdkZWk4VVNHcHZCa1R4QkkyCiAgICAgICAgWDMycHlPbVpEbjgxTDJ6TTJpb052Z1hJYjV1NXRqYjlOT2lBdDZvVzBHMHgwMGRncjNyNnB1OHFtTXdrQlZCQwogICAgICAgIHZXd0VtYXhRbmtUaG5iQWQ1N1ZiYXQ0Ly91RGNIRnBEYUJQcEZXZUNMMmRmRFNyUzlpaUs2SzFWa3ZHTG9YaDgKICAgICAgICBNcEpxam9kZHBmTmg0dXlmekt5TkUxZHJRMjltY3dmSWx6WG9QcmIwOVc2WkhwbSt0cWQ4TWs3MDd6d3NkRkdSCiAgICAgICAgcVJzeG10UG45SjFyZVlaaVZ1RTVHMjZmMWFLVFI3a0NEUVJrdXhiWkFSQUE0KzlrbjRzbUJYWmNNMHZGcTlSOAogICAgICAgIDI0WEtadFRhVm1Wb1ZKTVJRTTQ0cVdSK3MvUzBNenZiTzV1MGNTVlRoWTY1WXpNTHM5MjBVWTZ1R3BvUzJaWXcKICAgICAgICBJTWlwa2FCKzJGNkI4UjdWN25sL1NnYVhHYTJNZXhrQzd3dDZibEZiYXc3cGJ2SStpSTl3UzhCS0hnTUR6ZDBGCiAgICAgICAgVGpTcTl2ZGtWa2Y3eUkzaEV3bGxYN3pUNklMT3Zrbk5HYm9zMGRGSTkyY0JXUXMraVhQNTB4RFZpdDMrOW1DRAogICAgICAgIHJ1V1ZZazczbXZTRXpGY3VYQ3liS0o1VS9uelNRNzBKb1FtU1BjNTBSUWp1SEdkemwvWXpHRmFGbjV6SVo1cFAKICAgICAgICBrNVMrS1RZZWt6Y2lSa0h6YmVhNVBqK0E2S1ppbEtqNXlrQVJGencrQ1B4cXN1ZWpEa2k3QSthM20zV0dxK21tCiAgICAgICAgQWtsUTRZQmNvbHpOT3BnV2NsSVN1RTNkNWtndGFKQUNJZ3RlODdGNlFCQnNrOG9EQkZRQ25abW9PaXJsU2xiZgogICAgICAgIEp1RDZmVkNKdTJ6WTdUaE4xTzBvV1R3QWFOQXZNNTVDTFR2NnMzRm10UjkybG5sUURGdUorZmo4NjNjNnF4MTQKICAgICAgICBGdU80bU03ZXVTMDh3R2dWR205MXdBN2JZbDRhaHhDNlMyQkdCNUZ2a1pmekJCd2pzZm1VV0hBdTdWUlpKeGtYCiAgICAgICAgSnA2OTZPVGRSM1JmSTdJWjZPVzZ0R0VMaWpzd1diYlpYYjVYUldFVzk5dldPN05JSzZzT3ZoTUROcDliU011YgogICAgICAgIFhQM1BiUHhneVQwYm1zczB5d05Zd3VjbmZjbURYcVBWdTNHZHQ1M2F0MStoSzdtbG5RM3VVczVlVkVPSUhuSm0KICAgICAgICBmMXRyRGdnU1RFN2Zua3g2Q3psK2lNa0FFUUVBQVlrQ1BBUVlBUW9BSmhZaEJLSTJIbVJqZkR4YlNBQVh4ZUM0CiAgICAgICAgbHFqRjl3UHZCUUprdXhiWkFoc01CUWtEd21jQUFBb0pFT0M0bHFqRjl3UHY4U1FQL2pzUWZKQ1VIcmpwWDRmUAogICAgICAgIDBOdFZ5cWxDcnExT21MUDdCTHJYckN4b0FGUmI2NFlKVWRXazVQMzVrOXdqMkJRanBqY05qMmlrODBGb28wMkUKICAgICAgICB5YytQelcvNHR6VnZkeFJyRXpzT0ZtK21NUitsbFVIQUt6QmE2UUJ4SFQwb2ZMN3A1WFlUdU1ObllvK1BqVk1tCiAgICAgICAgalAzVEVKR1lYWW11aEdmYWFKWnBqTG1KRnFwNTl4Ly9kc01IZUxxVUNod2I2Q2c2RHVrQWloZUFzM1ArclhvMwogICAgICAgIHRCbkE0SkNDaVhSNy8vMFdlelJvU1BkYWxOZW00dnM4UFQ4N3NuSGJEbGlGTVZmOHcrZmtzSW5xdm90aVJESTQKICAgICAgICBRQnJCZnMzTmRlWlcvdG11cE9hWkpSekhEdnZLYmcvL082aXAxYVB2SUxXdlRETThLY1FDUUVTYVdrQ2JJMXVjCiAgICAgICAgcml6QU1ibFRCMmd5dzl5b2pDcFZDTUJYZGl6QXFxeWw1WlZydzQrWC9pMDlJc050OGhBOS81Ulk3djNjN1oyQwogICAgICAgIFh5MnhLV210TEk5bmxPU1N3VXhCNTY2STI5bFZLQkxVbVhtUWZuUklJSENpSkRYWUZEUC82TGZ2OSttaEVXVTgKICAgICAgICBxZWQzeGhwZU5TQUl6QStNVGxqdGlSbW9yeHBkZGlYYnRDYWZjUGwvSjNYMEIwN2ZjY0pad1pzQ1lDcHRMeTFjCiAgICAgICAgeXZWYU4rRUJtam9DcDNqdDZ3TGU0eGNscVUzQUN3ei84VEREbXRKN1VVZGw3TWRraXBRWjI3OEwya3BsNm82MQogICAgICAgIE1GMmZYRDdmWk1lWmZFdzZsdTBCRjVtWjAvY2gzSHhYZVpvWGlmNzlnMjV2Wm1TZFc5N3BjZWV3UGx2bEVURlEKICAgICAgICA1NXBNb3JReVVURVFDUTNFQ3pIWVNuTC9UbVc3CiAgICAgICAgPSswUmMKICAgICAgICAtLS0tLUVORCBQR1AgUFVCTElDIEtFWSBCTE9DSy0tLS0tCiAgICAgICJzb3VyY2UiOiAiZGViIFtzaWduZWQtYnk9JEtFWV9GSUxFXSBodHRwczovL3JlbGVhc2UtamFtbXkuaW5mcmFob3VzZS5jb20vICRSRUxFQVNFCiAgICAgICAgbWFpbiIKInBhY2thZ2VfdXBkYXRlIjogdHJ1ZQoicGFja2FnZXMiOgotICJwdXBwZXQtY29kZSIKLSAiaW5mcmFob3VzZS10b29sa2l0IgotICJpbmZyYWhvdXNlLXB1cHBldC1kYXRhIgoicHVwcGV0IjoKICAiY29sbGVjdGlvbiI6ICJwdXBwZXQ4IgogICJpbnN0YWxsIjogdHJ1ZQogICJpbnN0YWxsX3R5cGUiOiAiYWlvIgogICJwYWNrYWdlX25hbWUiOiAicHVwcGV0LWFnZW50IgogICJzdGFydF9zZXJ2aWNlIjogZmFsc2UKInJ1bmNtZCI6Ci0gLSAiaWgtcHVwcGV0IgogIC0gIi0tZW52aXJvbm1lbnQiCiAgLSAicHJvZHVjdGlvbiIKICAtICItLWVudmlyb25tZW50cGF0aCIKICAtICJ7cm9vdF9kaXJlY3Rvcnl9L2Vudmlyb25tZW50cyIKICAtICItLXJvb3QtZGlyZWN0b3J5IgogIC0gIi9vcHQvcHVwcGV0LWNvZGUiCiAgLSAiLS1oaWVyYS1jb25maWciCiAgLSAiL29wdC9pbmZyYWhvdXNlLXB1cHBldC1kYXRhL2Vudmlyb25tZW50cy9wcm9kdWN0aW9uL2hpZXJhLnlhbWwiCiAgLSAiLS1tb2R1bGUtcGF0aCIKICAtICJ7cm9vdF9kaXJlY3Rvcnl9L21vZHVsZXMiCiAgLSAiYXBwbHkiCiJ3cml0ZV9maWxlcyI6Ci0gImNvbnRlbnQiOiAiZXhwb3J0IEFXU19ERUZBVUxUX1JFR0lPTj11cy13ZXN0LTEiCiAgInBhdGgiOiAiL2V0Yy9wcm9maWxlLmQvYXdzLnNoIgogICJwZXJtaXNzaW9ucyI6ICIwNjQ0IgotICJjb250ZW50IjogfC0KICAgIFtkZWZhdWx0XQogICAgcmVnaW9uPXVzLXdlc3QtMQogICJwYXRoIjogIi9yb290Ly5hd3MvY29uZmlnIgogICJwZXJtaXNzaW9ucyI6ICIwNjAwIgotICJjb250ZW50IjogfAogICAgInB1cHBldF9lbnZpcm9ubWVudCI6ICJwcm9kdWN0aW9uIgogICAgInB1cHBldF9yb2xlIjogImp1bXBob3N0IgogICJwYXRoIjogIi9ldGMvcHVwcGV0bGFicy9mYWN0ZXIvZmFjdHMuZC9wdXBwZXQueWFtbCIKICAicGVybWlzc2lvbnMiOiAiMDY0NCIKLSAiY29udGVudCI6ICJ7XCJpaC1wdXBwZXRcIjp7XCJkZWJ1Z1wiOmZhbHNlLFwiZW52aXJvbm1lbnRwYXRoXCI6XCJ7cm9vdF9kaXJlY3Rvcnl9L2Vudmlyb25tZW50c1wiLFwiaGllcmEtY29uZmlnXCI6XCIvb3B0L2luZnJhaG91c2UtcHVwcGV0LWRhdGEvZW52aXJvbm1lbnRzL3Byb2R1Y3Rpb24vaGllcmEueWFtbFwiLFwibW9kdWxlLXBhdGhcIjpcIntyb290X2RpcmVjdG9yeX0vbW9kdWxlc1wiLFwicm9vdC1kaXJlY3RvcnlcIjpcIi9vcHQvcHVwcGV0LWNvZGVcIn19IgogICJwYXRoIjogIi9ldGMvcHVwcGV0bGFicy9mYWN0ZXIvZmFjdHMuZC9paC1wdXBwZXQuanNvbiIKICAicGVybWlzc2lvbnMiOiAiMDY0NCIKLSAiY29udGVudCI6ICJ7fSIKICAicGF0aCI6ICIvZXRjL3B1cHBldGxhYnMvZmFjdGVyL2ZhY3RzLmQvY3VzdG9tLmpzb24iCiAgInBlcm1pc3Npb25zIjogIjA2NDQiCg0KLS1NSU1FQk9VTkRBUlktLQ0K"%0A      + vpc_security_group_ids = (known after apply)%0A%0A      + iam_instance_profile {%0A          + arn = (known after apply)%0A        }%0A    }%0A%0A  # module.jumphost.aws_security_group.jumphost will be created%0A  + resource "aws_security_group" "jumphost" {%0A      + arn                    = (known after apply)%0A      + description            = "Manage traffic to jumphost"%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = (known after apply)%0A      + name_prefix            = "jumphost"%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Name" = "jumphost"%0A        }%0A      + tags_all               = {%0A          + "Name"        = "jumphost"%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A        }%0A      + vpc_id                 = "vpc-08e19d859c26d18b2"%0A    }%0A%0A  # module.jumphost.aws_vpc_security_group_egress_rule.default will be created%0A  + resource "aws_vpc_security_group_egress_rule" "default" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "0.0.0.0/0"%0A      + description            = "Allow all traffic"%0A      + id                     = (known after apply)%0A      + ip_protocol            = "-1"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags                   = {%0A          + "Name" = "outgoing traffic"%0A        }%0A      + tags_all               = {%0A          + "Name"        = "outgoing traffic"%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A        }%0A    }%0A%0A  # module.jumphost.aws_vpc_security_group_ingress_rule.icmp will be created%0A  + resource "aws_vpc_security_group_ingress_rule" "icmp" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "0.0.0.0/0"%0A      + description            = "Allow all ICMP traffic"%0A      + from_port              = -1%0A      + id                     = (known after apply)%0A      + ip_protocol            = "icmp"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags                   = {%0A          + "Name" = "ICMP traffic"%0A        }%0A      + tags_all               = {%0A          + "Name"        = "ICMP traffic"%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A        }%0A      + to_port                = -1%0A    }%0A%0A  # module.jumphost.aws_vpc_security_group_ingress_rule.ssh will be created%0A  + resource "aws_vpc_security_group_ingress_rule" "ssh" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "0.0.0.0/0"%0A      + description            = "Allow SSH traffic"%0A      + from_port              = 22%0A      + id                     = (known after apply)%0A      + ip_protocol            = "tcp"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags                   = {%0A          + "Name" = "SSH access"%0A        }%0A      + tags_all               = {%0A          + "Name"        = "SSH access"%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A        }%0A      + to_port                = 22%0A    }%0A%0A  # module.jumphost.random_string.asg_name will be created%0A  + resource "random_string" "asg_name" {%0A      + id          = (known after apply)%0A      + length      = 6%0A      + lower       = true%0A      + min_lower   = 0%0A      + min_numeric = 0%0A      + min_special = 0%0A      + min_upper   = 0%0A      + number      = true%0A      + numeric     = true%0A      + result      = (known after apply)%0A      + special     = false%0A      + upper       = true%0A    }%0A%0A  # module.jumphost.random_string.profile-suffix will be created%0A  + resource "random_string" "profile-suffix" {%0A      + id          = (known after apply)%0A      + length      = 12%0A      + lower       = true%0A      + min_lower   = 0%0A      + min_numeric = 0%0A      + min_special = 0%0A      + min_upper   = 0%0A      + number      = true%0A      + numeric     = true%0A      + result      = (known after apply)%0A      + special     = false%0A      + upper       = true%0A    }%0A%0A  # module.jumphost.module.jumphost_profile.aws_iam_instance_profile.profile will be created%0A  + resource "aws_iam_instance_profile" "profile" {%0A      + arn         = (known after apply)%0A      + create_date = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A      + name_prefix = (known after apply)%0A      + path        = "/"%0A      + role        = (known after apply)%0A      + tags_all    = {%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A        }%0A      + unique_id   = (known after apply)%0A    }%0A%0A  # module.jumphost.module.jumphost_profile.aws_iam_policy.profile will be created%0A  + resource "aws_iam_policy" "profile" {%0A      + arn         = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A      + name_prefix = (known after apply)%0A      + path        = "/"%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = "ec2:Describe*"%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id   = (known after apply)%0A      + tags_all    = {%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A        }%0A    }%0A%0A  # module.jumphost.module.jumphost_profile.aws_iam_role.profile will be created%0A  + resource "aws_iam_role" "profile" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "ec2.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = (known after apply)%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = {%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A        }%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # module.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.extra["package-publisher"] will be created%0A  + resource "aws_iam_role_policy_attachment" "extra" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::493370826424:policy/package-publisher"%0A      + role       = (known after apply)%0A    }%0A%0A  # module.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.extra["required"] will be created%0A  + resource "aws_iam_role_policy_attachment" "extra" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = (known after apply)%0A    }%0A%0A  # module.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.profile will be created%0A  + resource "aws_iam_role_policy_attachment" "profile" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = (known after apply)%0A    }%0A%0A  # module.jumphost.module.update_dns.data.archive_file.lambda will be read during apply%0A  # (config refers to values not yet known)%0A <= data "archive_file" "lambda" {%0A      + excludes            = [%0A          + "__pycache__",%0A        ]%0A      + id                  = (known after apply)%0A      + output_base64sha256 = (known after apply)%0A      + output_base64sha512 = (known after apply)%0A      + output_md5          = (known after apply)%0A      + output_path         = (known after apply)%0A      + output_sha          = (known after apply)%0A      + output_sha256       = (known after apply)%0A      + output_sha512       = (known after apply)%0A      + output_size         = (known after apply)%0A      + source_dir          = ".terraform/modules/jumphost.update_dns/update_dns"%0A      + type                = "zip"%0A    }%0A%0A  # module.jumphost.module.update_dns.data.aws_iam_policy_document.lambda-permissions will be read during apply%0A  # (config refers to values not yet known)%0A <= data "aws_iam_policy_document" "lambda-permissions" {%0A      + id   = (known after apply)%0A      + json = (known after apply)%0A%0A      + statement {%0A          + actions   = [%0A              + "autoscaling:CompleteLifecycleAction",%0A            ]%0A          + resources = [%0A              + (known after apply),%0A            ]%0A        }%0A      + statement {%0A          + actions   = [%0A              + "ec2:DescribeInstances",%0A              + "ec2:DescribeTags",%0A            ]%0A          + resources = [%0A              + "*",%0A            ]%0A        }%0A      + statement {%0A          + actions   = [%0A              + "ec2:CreateTags",%0A            ]%0A          + resources = [%0A              + "arn:aws:ec2:*:493370826424:instance/*",%0A            ]%0A        }%0A      + statement {%0A          + actions   = [%0A              + "route53:ChangeResourceRecordSets",%0A              + "route53:ListResourceRecordSets",%0A            ]%0A          + resources = [%0A              + "arn:aws:route53:::hostedzone/Z07662251LH3YRF2ERM3G",%0A            ]%0A        }%0A    }%0A%0A  # module.jumphost.module.update_dns.data.aws_iam_policy_document.lambda_logging will be read during apply%0A  # (config refers to values not yet known)%0A <= data "aws_iam_policy_document" "lambda_logging" {%0A      + id   = (known after apply)%0A      + json = (known after apply)%0A%0A      + statement {%0A          + actions   = [%0A              + "logs:CreateLogStream",%0A            ]%0A          + effect    = "Allow"%0A          + resources = [%0A              + (known after apply),%0A            ]%0A        }%0A      + statement {%0A          + actions   = [%0A              + "logs:PutLogEvents",%0A            ]%0A          + effect    = "Allow"%0A          + resources = [%0A              + "arn:aws:logs:us-west-1:493370826424:log-group:*:log-stream:*",%0A            ]%0A        }%0A    }%0A%0A  # module.jumphost.module.update_dns.aws_cloudwatch_event_rule.instance_change will be created%0A  + resource "aws_cloudwatch_event_rule" "instance_change" {%0A      + arn            = (known after apply)%0A      + description    = "Instance running"%0A      + event_bus_name = "default"%0A      + event_pattern  = jsonencode(%0A            {%0A              + detail      = {%0A                  + state = [%0A                      + "running",%0A                      + "shutting-down",%0A                    ]%0A                }%0A              + detail-type = [%0A                  + "EC2 Instance State-change Notification",%0A                ]%0A              + source      = [%0A                  + "aws.ec2",%0A                ]%0A            }%0A        )%0A      + id             = (known after apply)%0A      + name           = (known after apply)%0A      + name_prefix    = "asg_instance"%0A      + tags_all       = {%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A        }%0A    }%0A%0A  # module.jumphost.module.update_dns.aws_cloudwatch_event_rule.scale will be created%0A  + resource "aws_cloudwatch_event_rule" "scale" {%0A      + arn            = (known after apply)%0A      + description    = "ASG lifecycle hook"%0A      + event_bus_name = "default"%0A      + event_pattern  = (known after apply)%0A      + id             = (known after apply)%0A      + name           = (known after apply)%0A      + name_prefix    = "asg-scale"%0A      + tags_all       = {%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A        }%0A    }%0A%0A  # module.jumphost.module.update_dns.aws_cloudwatch_event_target.instance-running will be created%0A  + resource "aws_cloudwatch_event_target" "instance-running" {%0A      + arn            = (known after apply)%0A      + event_bus_name = "default"%0A      + id             = (known after apply)%0A      + rule           = (known after apply)%0A      + target_id      = (known after apply)%0A    }%0A%0A  # module.jumphost.module.update_dns.aws_cloudwatch_event_target.scale-out will be created%0A  + resource "aws_cloudwatch_event_target" "scale-out" {%0A      + arn            = (known after apply)%0A      + event_bus_name = "default"%0A      + id             = (known after apply)%0A      + rule           = (known after apply)%0A      + target_id      = (known after apply)%0A    }%0A%0A  # module.jumphost.module.update_dns.aws_cloudwatch_log_group.update_dns will be created%0A  + resource "aws_cloudwatch_log_group" "update_dns" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + log_group_class   = (known after apply)%0A      + name              = (known after apply)%0A      + name_prefix       = (known after apply)%0A      + retention_in_days = 14%0A      + skip_destroy      = false%0A      + tags_all          = {%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A        }%0A    }%0A%0A  # module.jumphost.module.update_dns.aws_iam_policy.lambda_logging will be created%0A  + resource "aws_iam_policy" "lambda_logging" {%0A      + arn         = (known after apply)%0A      + description = "IAM policy for logging from a lambda"%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A      + name_prefix = "lambda_logging"%0A      + path        = "/"%0A      + policy      = (known after apply)%0A      + policy_id   = (known after apply)%0A      + tags_all    = {%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A        }%0A    }%0A%0A  # module.jumphost.module.update_dns.aws_iam_policy.lambda_permissions will be created%0A  + resource "aws_iam_policy" "lambda_permissions" {%0A      + arn         = (known after apply)%0A      + description = "IAM policy for a lambda permissions"%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A      + name_prefix = "lambda_permissions"%0A      + path        = "/"%0A      + policy      = (known after apply)%0A      + policy_id   = (known after apply)%0A      + tags_all    = {%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A        }%0A    }%0A%0A  # module.jumphost.module.update_dns.aws_iam_role.iam_for_lambda will be created%0A  + resource "aws_iam_role" "iam_for_lambda" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "lambda.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = (known after apply)%0A      + name_prefix           = "iam_for_lambda"%0A      + path                  = "/"%0A      + tags_all              = {%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A        }%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # module.jumphost.module.update_dns.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole will be created%0A  + resource "aws_iam_role_policy_attachment" "AWSLambdaBasicExecutionRole" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"%0A      + role       = (known after apply)%0A    }%0A%0A  # module.jumphost.module.update_dns.aws_iam_role_policy_attachment.lambda_logs will be created%0A  + resource "aws_iam_role_policy_attachment" "lambda_logs" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = (known after apply)%0A    }%0A%0A  # module.jumphost.module.update_dns.aws_iam_role_policy_attachment.lambda_permissions will be created%0A  + resource "aws_iam_role_policy_attachment" "lambda_permissions" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = (known after apply)%0A    }%0A%0A  # module.jumphost.module.update_dns.aws_lambda_function.update_dns will be created%0A  + resource "aws_lambda_function" "update_dns" {%0A      + architectures                  = (known after apply)%0A      + arn                            = (known after apply)%0A      + function_name                  = (known after apply)%0A      + handler                        = "main.lambda_handler"%0A      + id                             = (known after apply)%0A      + invoke_arn                     = (known after apply)%0A      + last_modified                  = (known after apply)%0A      + memory_size                    = 128%0A      + package_type                   = "Zip"%0A      + publish                        = false%0A      + qualified_arn                  = (known after apply)%0A      + qualified_invoke_arn           = (known after apply)%0A      + reserved_concurrent_executions = -1%0A      + role                           = (known after apply)%0A      + runtime                        = "python3.9"%0A      + s3_bucket                      = (known after apply)%0A      + s3_key                         = (known after apply)%0A      + signing_job_arn                = (known after apply)%0A      + signing_profile_version_arn    = (known after apply)%0A      + skip_destroy                   = false%0A      + source_code_hash               = (known after apply)%0A      + source_code_size               = (known after apply)%0A      + tags_all                       = {%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A        }%0A      + timeout                        = 30%0A      + version                        = (known after apply)%0A%0A      + environment {%0A          + variables = (known after apply)%0A        }%0A    }%0A%0A  # module.jumphost.module.update_dns.aws_lambda_function_event_invoke_config.update_dns will be created%0A  + resource "aws_lambda_function_event_invoke_config" "update_dns" {%0A      + function_name          = (known after apply)%0A      + id                     = (known after apply)%0A      + maximum_retry_attempts = 0%0A    }%0A%0A  # module.jumphost.module.update_dns.aws_lambda_permission.allow_cloudwatch_asg_lifecycle_hook will be created%0A  + resource "aws_lambda_permission" "allow_cloudwatch_asg_lifecycle_hook" {%0A      + action              = "lambda:InvokeFunction"%0A      + function_name       = (known after apply)%0A      + id                  = (known after apply)%0A      + principal           = "events.amazonaws.com"%0A      + source_arn          = (known after apply)%0A      + statement_id        = (known after apply)%0A      + statement_id_prefix = (known after apply)%0A    }%0A%0A  # module.jumphost.module.update_dns.aws_lambda_permission.allow_cloudwatch_instance_running will be created%0A  + resource "aws_lambda_permission" "allow_cloudwatch_instance_running" {%0A      + action              = "lambda:InvokeFunction"%0A      + function_name       = (known after apply)%0A      + id                  = (known after apply)%0A      + principal           = "events.amazonaws.com"%0A      + source_arn          = (known after apply)%0A      + statement_id        = (known after apply)%0A      + statement_id_prefix = (known after apply)%0A    }%0A%0A  # module.jumphost.module.update_dns.aws_s3_bucket.lambda_tmp will be created%0A  + resource "aws_s3_bucket" "lambda_tmp" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = (known after apply)%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = "infrahouse-asg-lambda-"%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags_all                    = {%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0A  # module.jumphost.module.update_dns.aws_s3_bucket_public_access_block.public_access will be created%0A  + resource "aws_s3_bucket_public_access_block" "public_access" {%0A      + block_public_acls       = true%0A      + block_public_policy     = true%0A      + bucket                  = (known after apply)%0A      + id                      = (known after apply)%0A      + ignore_public_acls      = true%0A      + restrict_public_buckets = true%0A    }%0A%0A  # module.jumphost.module.update_dns.aws_s3_object.lambda_package will be created%0A  + resource "aws_s3_object" "lambda_package" {%0A      + acl                    = (known after apply)%0A      + bucket                 = (known after apply)%0A      + bucket_key_enabled     = (known after apply)%0A      + checksum_crc32         = (known after apply)%0A      + checksum_crc32c        = (known after apply)%0A      + checksum_sha1          = (known after apply)%0A      + checksum_sha256        = (known after apply)%0A      + content_type           = (known after apply)%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = (known after apply)%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = {%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.jumphost.module.update_dns.null_resource.install_python_dependencies will be created%0A  + resource "null_resource" "install_python_dependencies" {%0A      + id       = (known after apply)%0A      + triggers = {%0A          + "dependencies_version" = "715a0f7310ae4dabf9b710802339dcd5"%0A          + "main_version"         = "5a37bacb3628184e3d52726a91564155"%0A        }%0A    }%0A%0A  # module.jumphost.module.update_dns.random_uuid.lamda_src_hash will be created%0A  + resource "random_uuid" "lamda_src_hash" {%0A      + id      = (known after apply)%0A      + keepers = {%0A          + "main.py"          = "5a37bacb3628184e3d52726a91564155"%0A          + "requirements.txt" = "715a0f7310ae4dabf9b710802339dcd5"%0A        }%0A      + result  = (known after apply)%0A    }%0A%0APlan: 37 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgInN0ZG91dCI6ICJUZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uXG5wbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6XG4gICsgY3JlYXRlXG4gPD0gcmVhZCAoZGF0YSByZXNvdXJjZXMpXG5cblRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOlxuXG4gICMgbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucmVxdWlyZWRfcGVybWlzc2lvbnMgd2lsbCBiZSByZWFkIGR1cmluZyBhcHBseVxuICAjIChjb25maWcgcmVmZXJzIHRvIHZhbHVlcyBub3QgeWV0IGtub3duKVxuIDw9IGRhdGEgXCJhd3NfaWFtX3BvbGljeV9kb2N1bWVudFwiIFwicmVxdWlyZWRfcGVybWlzc2lvbnNcIiB7XG4gICAgICArIGlkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGpzb24gPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG5cbiAgICAgICsgc3RhdGVtZW50IHtcbiAgICAgICAgICArIGFjdGlvbnMgICA9IFtcbiAgICAgICAgICAgICAgKyBcImF1dG9zY2FsaW5nOkRlc2NyaWJlQXV0b1NjYWxpbmdJbnN0YW5jZXNcIixcbiAgICAgICAgICAgIF1cbiAgICAgICAgICArIHJlc291cmNlcyA9IFtcbiAgICAgICAgICAgICAgKyAoa25vd24gYWZ0ZXIgYXBwbHkpLFxuICAgICAgICAgICAgXVxuICAgICAgICB9XG4gICAgfVxuXG4gICMgbW9kdWxlLmp1bXBob3N0LmF3c19hdXRvc2NhbGluZ19ncm91cC5qdW1waG9zdCB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19hdXRvc2NhbGluZ19ncm91cFwiIFwianVtcGhvc3RcIiB7XG4gICAgICArIGFybiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBhdmFpbGFiaWxpdHlfem9uZXMgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZGVmYXVsdF9jb29sZG93biAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGRlc2lyZWRfY2FwYWNpdHkgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBmb3JjZV9kZWxldGUgICAgICAgICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICArIGZvcmNlX2RlbGV0ZV93YXJtX3Bvb2wgICAgICAgICAgID0gZmFsc2VcbiAgICAgICsgaGVhbHRoX2NoZWNrX2dyYWNlX3BlcmlvZCAgICAgICAgPSAzMDBcbiAgICAgICsgaGVhbHRoX2NoZWNrX3R5cGUgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZ25vcmVfZmFpbGVkX3NjYWxpbmdfYWN0aXZpdGllcyA9IGZhbHNlXG4gICAgICArIGxvYWRfYmFsYW5jZXJzICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBtYXhfaW5zdGFuY2VfbGlmZXRpbWUgICAgICAgICAgICA9IDc3NzYwMDBcbiAgICAgICsgbWF4X3NpemUgICAgICAgICAgICAgICAgICAgICAgICAgPSAzXG4gICAgICArIG1ldHJpY3NfZ3JhbnVsYXJpdHkgICAgICAgICAgICAgID0gXCIxTWludXRlXCJcbiAgICAgICsgbWluX3NpemUgICAgICAgICAgICAgICAgICAgICAgICAgPSAxXG4gICAgICArIG5hbWUgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lX3ByZWZpeCAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcHJlZGljdGVkX2NhcGFjaXR5ICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHByb3RlY3RfZnJvbV9zY2FsZV9pbiAgICAgICAgICAgID0gZmFsc2VcbiAgICAgICsgc2VydmljZV9saW5rZWRfcm9sZV9hcm4gICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHRhcmdldF9ncm91cF9hcm5zICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB2cGNfem9uZV9pZGVudGlmaWVyICAgICAgICAgICAgICA9IFtcbiAgICAgICAgICArIFwic3VibmV0LTBkZjg4NWRjYzk5NDE4Nzk5XCIsXG4gICAgICAgIF1cbiAgICAgICsgd2FpdF9mb3JfY2FwYWNpdHlfdGltZW91dCAgICAgICAgPSBcIjEwbVwiXG4gICAgICArIHdhcm1fcG9vbF9zaXplICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuXG4gICAgICArIGluc3RhbmNlX3JlZnJlc2gge1xuICAgICAgICAgICsgc3RyYXRlZ3kgPSBcIlJvbGxpbmdcIlxuXG4gICAgICAgICAgKyBwcmVmZXJlbmNlcyB7XG4gICAgICAgICAgICAgICsgbWF4X2hlYWx0aHlfcGVyY2VudGFnZSAgICAgICA9IDEwMFxuICAgICAgICAgICAgICArIG1pbl9oZWFsdGh5X3BlcmNlbnRhZ2UgICAgICAgPSAxMDBcbiAgICAgICAgICAgICAgKyBzY2FsZV9pbl9wcm90ZWN0ZWRfaW5zdGFuY2VzID0gXCJJZ25vcmVcIlxuICAgICAgICAgICAgICArIHNraXBfbWF0Y2hpbmcgICAgICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgICAgICAgICArIHN0YW5kYnlfaW5zdGFuY2VzICAgICAgICAgICAgPSBcIklnbm9yZVwiXG4gICAgICAgICAgICB9XG4gICAgICAgIH1cblxuICAgICAgKyBsYXVuY2hfdGVtcGxhdGUge1xuICAgICAgICAgICsgaWQgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgICArIG5hbWUgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICAgKyB2ZXJzaW9uID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICB9XG5cbiAgICAgICsgdGFnIHtcbiAgICAgICAgICArIGtleSAgICAgICAgICAgICAgICAgPSBcIk5hbWVcIlxuICAgICAgICAgICsgcHJvcGFnYXRlX2F0X2xhdW5jaCA9IHRydWVcbiAgICAgICAgICArIHZhbHVlICAgICAgICAgICAgICAgPSBcImp1bXBob3N0XCJcbiAgICAgICAgfVxuICAgIH1cblxuICAjIG1vZHVsZS5qdW1waG9zdC5hd3NfYXV0b3NjYWxpbmdfbGlmZWN5Y2xlX2hvb2subGF1bmNoaW5nIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2F1dG9zY2FsaW5nX2xpZmVjeWNsZV9ob29rXCIgXCJsYXVuY2hpbmdcIiB7XG4gICAgICArIGF1dG9zY2FsaW5nX2dyb3VwX25hbWUgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGRlZmF1bHRfcmVzdWx0ICAgICAgICAgPSBcIkFCQU5ET05cIlxuICAgICAgKyBoZWFydGJlYXRfdGltZW91dCAgICAgID0gMzAwXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGxpZmVjeWNsZV90cmFuc2l0aW9uICAgPSBcImF1dG9zY2FsaW5nOkVDMl9JTlNUQU5DRV9MQVVOQ0hJTkdcIlxuICAgICAgKyBuYW1lICAgICAgICAgICAgICAgICAgID0gXCJsYXVuY2hpbmdcIlxuICAgIH1cblxuICAjIG1vZHVsZS5qdW1waG9zdC5hd3NfYXV0b3NjYWxpbmdfbGlmZWN5Y2xlX2hvb2sudGVybWluYXRpbmcgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfYXV0b3NjYWxpbmdfbGlmZWN5Y2xlX2hvb2tcIiBcInRlcm1pbmF0aW5nXCIge1xuICAgICAgKyBhdXRvc2NhbGluZ19ncm91cF9uYW1lID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBkZWZhdWx0X3Jlc3VsdCAgICAgICAgID0gXCJBQkFORE9OXCJcbiAgICAgICsgaGVhcnRiZWF0X3RpbWVvdXQgICAgICA9IDMwMFxuICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBsaWZlY3ljbGVfdHJhbnNpdGlvbiAgID0gXCJhdXRvc2NhbGluZzpFQzJfSU5TVEFOQ0VfVEVSTUlOQVRJTkdcIlxuICAgICAgKyBuYW1lICAgICAgICAgICAgICAgICAgID0gXCJ0ZXJtaW5hdGluZ1wiXG4gICAgfVxuXG4gICMgbW9kdWxlLmp1bXBob3N0LmF3c19pYW1fcG9saWN5LnJlcXVpcmVkIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9wb2xpY3lcIiBcInJlcXVpcmVkXCIge1xuICAgICAgKyBhcm4gICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWUgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lX3ByZWZpeCA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcGF0aCAgICAgICAgPSBcIi9cIlxuICAgICAgKyBwb2xpY3kgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcG9saWN5X2lkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHRhZ3NfYWxsICAgID0ge1xuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXG4gICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIlxuICAgICAgICB9XG4gICAgfVxuXG4gICMgbW9kdWxlLmp1bXBob3N0LmF3c19sYXVuY2hfdGVtcGxhdGUuanVtcGhvc3Qgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfbGF1bmNoX3RlbXBsYXRlXCIgXCJqdW1waG9zdFwiIHtcbiAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZGVmYXVsdF92ZXJzaW9uICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaW1hZ2VfaWQgICAgICAgICAgICAgICA9IFwiYW1pLTA3OTE5YTYyMmRiYmE3ZGQ5XCJcbiAgICAgICsgaW5zdGFuY2VfdHlwZSAgICAgICAgICA9IFwidDNhLm1pY3JvXCJcbiAgICAgICsga2V5X25hbWUgICAgICAgICAgICAgICA9IFwiYWxla3NcIlxuICAgICAgKyBsYXRlc3RfdmVyc2lvbiAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lX3ByZWZpeCAgICAgICAgICAgID0gXCJqdW1waG9zdC1cIlxuICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXG4gICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIlxuICAgICAgICB9XG4gICAgICArIHVzZXJfZGF0YSAgICAgICAgICAgICAgPSBcIlEyOXVkR1Z1ZEMxVWVYQmxPaUJ0ZFd4MGFYQmhjblF2YldsNFpXUTdJR0p2ZFc1a1lYSjVQU0pOU1UxRlFrOVZUa1JCVWxraUNrMUpUVVV0Vm1WeWMybHZiam9nTVM0d0RRb05DaTB0VFVsTlJVSlBWVTVFUVZKWkRRcERiMjUwWlc1MExWUnlZVzV6Wm1WeUxVVnVZMjlrYVc1bk9pQTNZbWwwRFFwRGIyNTBaVzUwTFZSNWNHVTZJSFJsZUhRdlkyeHZkV1F0WTI5dVptbG5EUXBOYVcxbExWWmxjbk5wYjI0NklERXVNQTBLRFFvalkyeHZkV1F0WTI5dVptbG5DaUpoY0hRaU9nb2dJQ0p6YjNWeVkyVnpJam9LSUNBZ0lDSnBibVp5WVdodmRYTmxJam9LSUNBZ0lDQWdJbXRsZVNJNklId0tJQ0FnSUNBZ0lDQXRMUzB0TFVKRlIwbE9JRkJIVUNCUVZVSk1TVU1nUzBWWklFSk1UME5MTFMwdExTMEtDaUFnSUNBZ0lDQWdiVkZKVGtKSFV6ZEdkR3RDUlVGRVJpdFpiVVJuTmxGMmMzWTFWalphVVhjclVXaDRaRlIyYWsxWVpVeERPVlEyVWtaU1ZrUTVORGR4UzNwMFRrNVJiZ29nSUNBZ0lDQWdJQ3RCTDNsNGNISk1RVzFYTWpWVmRTOHhNVzlEYzNwT1ZrbEpZVkl6VDFrNFRYUjVhV3hpUTNSNlZXdENlblpYWkd4WU0waDJWSGM1TVV4d09HSjRWVXdLSUNBZ0lDQWdJQ0JGV0U5Tk9XNXpZM0ZQY2s5MlprSnFZVzV3YkV0RVJVdFFUVmsyZGtsYU0ydHdNWEpWYzBOT1IweENUREI0TWt0YVoxVTRNSFZzVW5OTlRUaHhia0pPQ2lBZ0lDQWdJQ0FnYTNCVWFVRmxXRXRQUlZaMFVucHNWMngyVDBaTVNqZHdXVVIyWVZvd1ZXZElVMVoxUlN0YWEyeGtjVTlrVEV4U2NFdHJaRWwyU2xCamExaHhURFY0VkFvZ0lDQWdJQ0FnSUZWMlYxUlhNV1Z1UmtGSVpEVXJUbEY0VFc1RFlUTnBhMnBSVmpORVZHeEZhbk5uVEV4UlltSjVjMWhxV0ZCeU5sQkpVSE15T1dOVVkyWnZjVFF6TVU4S0lDQWdJQ0FnSUNCMFVqUkVjbHBDTkhaTlJVOUJPRGhVYlV0Q2EwVnBUVWNyYVVJNVkycDZOWGRDU1hWTmRUazFXbTF2U25oa2RtcFFVamN5UmxsTFozSkRXRTUwVG1oa0NpQWdJQ0FnSUNBZ1ZtVnlSVkoyY0V4VWFHUmhVbTFhWjJrM2JIa3JSSFpyV1RkTWNYbEtVSFprU0dOeGVHVmtaMFp1VUV0U05GUXJaMU5SYldKVlVHUTVjWEZrU2xJd1VRb2dJQ0FnSUNBZ0lFdHNMMUJ0ZEhWVEwzYzVaM2t5V2pSaGVUQlJTVXR5VGtKNlVYaG9RVGhNUkZwd2NERnlkV1pEU2pVcldrMWxaamt3ZGtod2QzaE5LMDloVUhKNVRtd0tJQ0FnSUNBZ0lDQkZaRVJYTjFsUk9HWjFRalZ1VUhGcWQxVkJjRzFzV1ZsTVNsbHNaRGQyU2pjNVJVbDRMM05xWjJnMlJ5dEpSbWx0TjNoU04xZHBVVVl2YmtwbGRtWnhDaUFnSUNBZ0lDQWdkbnBaVHpkdmNpOUhTVU5pTm1WYWQzWlFaSFI1TnpsSWJWWmxVSEZGVkd4RVZUQXdiM2x2Y0ZkNVZITlplVk5aUkZOSWJpODBaRzlVZFhnNGRpdEdMd29nSUNBZ0lDQWdJRmxsZVdKMlozRmljbWxJTjJsVFJqaEllSGRGUm1WRWFuSk5kRlZVU0hOWVF6TTFSRWhHWlUxRGFFcHZlSE41UzNZME9Fb3JZa2xIUm5kQlVrRlJRVUlLSUNBZ0lDQWdJQ0IwUXpGS1ltMWFlVmxWYUhaa1dFNXNTVVpDYUZreWRHaGFNbFo1U1VSNGQxbFhUbkpaVjJSc1kydENjR0p0V25sWlYyaDJaRmhPYkV4dFRuWmlWRFpLQ2lBZ0lDQWdJQ0FnUVd4UlJVVjNSVXRCUkRSWFNWRlRhVTVvTld0Wk0zYzRWekJuUVVZNFdHZDFTbUZ2ZUdaalJEZDNWVU5hVEhOWE1sRkpZa0YzVlVwQk9FcHVRVUZWVEFvZ0lDQWdJQ0FnSUVOUlowaEJaMWxXUTJkclNVTjNTVVZHWjBsRVFWRkpaVUZSU1ZoblFVRkxRMUpFWjNWS1lXOTRabU5FTjNkaU4wUXZPV1Z1WW5SUE1VUkZVVzR4VUhRS0lDQWdJQ0FnSUNCb1oydDBTQ3RKY21KQ1pGbFNTR3MzTVdsc01taGlibTFCWW05TWEyc3hZV3N2WVdGUldTOVlVVVJLUm1oeVFUZHFUV3RRVEU5RFVtVnZkRWhwVVcxMkNpQWdJQ0FnSUNBZ01WVm1jVVJqVFRKbFVUUXZlREJPT1VZeVJFeFZVMnQxZDNjeE1UZDJkSFJWYjBKNGFYSkNOekp3VHpCVUwyeGtPVzh6T1ZOSVRVTXZSR1pyTm5rMmFBb2dJQ0FnSUNBZ0lIUlVSM0Y0VEdkb09Hb3pSRk41VHpWRlJYSktUR0V2TTBKMlRYRnlOR2x4WWpOUVZIZE9aVVJTUldwaGRsRkthRmhUZGtWR2FubEJRMjl2T1dRM2NuTUtJQ0FnSUNBZ0lDQTNiR2hEWW1KVFVHcG5WR05ITDFCRFpucE1jak0zVVhsNldHbFVVaTlVZDJwcGQxWmtWR2hrUTFNdlEwdHVjMjlOT0c1blNIaHFXRmx3U3pkTk5uZG5DaUFnSUNBZ0lDQWdkSHBCT0VwclNGcHlOVTF3YTNKUVIzSm5VV1YyYUVwQ1RHdElVaTlxWTNOaFlVSmFUamR1ZHpoaFpVaGpkM2ROTkM5RGFFaEplVnBrVVRreE1EVTVjQW9nSUNBZ0lDQWdJRTlOWVZsdFYyMXFVRkZtY1RGeVQyNUJRWFpCTVhoWGR5dFVXazU2U0dkWFNYRTBkblZ6ZURkUFFuWnlSbk5XWlZwT2MzRmtOMDloTkhCeWRGWlhaekFLSUNBZ0lDQWdJQ0E1TVdOTFdrcHZMMDkyTm05d1RTOTNSRmRPTW5sQ2JtdHRRa04zWVZod2IwZzFUa1JSTWpKaWFHNUhWRXBsU1Zka1pXazRWVk5IY0haQ2ExUjRRa2t5Q2lBZ0lDQWdJQ0FnV0RNeWNIbFBiVnBFYmpneFRESjZUVEpwYjA1MloxaEpZalYxTlhScVlqbE9UMmxCZERadlZ6QkhNSGd3TUdSbmNqTnlObkIxT0hGdFRYZHJRbFpDUXdvZ0lDQWdJQ0FnSUhaWGQwVnRZWGhSYm10VWFHNWlRV1ExTjFaaVlYUTBMeTkxUkdOSVJuQkVZVUpRY0VaWFpVTk1NbVJtUkZOeVV6bHBhVXMyU3pGV2EzWkhURzlZYURnS0lDQWdJQ0FnSUNCTmNFcHhhbTlrWkhCbVRtZzBkWGxtZWt0NVRrVXhaSEpSTWpsdFkzZG1TV3g2V0c5UWNtSXdPVmMyV2tod2JTdDBjV1E0VFdzM01EZDZkM05rUmtkU0NpQWdJQ0FnSUNBZ2NWSnplRzEwVUc0NVNqRnlaVmxhYVZaMVJUVkhNalptTVdGTFZGSTNhME5FVVZKcmRYaGlXa0ZTUVVFMEt6bHJialJ6YlVKWVdtTk5NSFpHY1RsU09Bb2dJQ0FnSUNBZ0lESTBXRXRhZEZSaFZtMVdiMVpLVFZKUlRUUTBjVmRTSzNNdlV6Qk5lblppVHpWMU1HTlRWbFJvV1RZMVdYcE5USE01TWpCVldUWjFSM0J2VXpKYVdYY0tJQ0FnSUNBZ0lDQkpUV2x3YTJGQ0t6SkdOa0k0VWpkV04yNXNMMU5uWVZoSFlUSk5aWGhyUXpkM2REWmliRVppWVhjM2NHSjJTU3RwU1RsM1V6aENTMGhuVFVSNlpEQkdDaUFnSUNBZ0lDQWdWR3BUY1RsMlpHdFdhMlkzZVVremFFVjNiR3hZTjNwVU5rbE1UM1pyYms1SFltOXpNR1JHU1RreVkwSlhVWE1yYVZoUU5UQjRSRlpwZERNck9XMURSQW9nSUNBZ0lDQWdJSEoxVjFaWmF6Y3piWFpUUlhwR1kzVllRM2xpUzBvMVZTOXVlbE5STnpCS2IxRnRVMUJqTlRCU1VXcDFTRWRrZW13dldYcEhSbUZHYmpWNlNWbzFjRkFLSUNBZ0lDQWdJQ0JyTlZNclMxUlpaV3Q2WTJsU2EwaDZZbVZoTlZCcUswRTJTMXBwYkV0cU5YbHJRVkpHZW5jclExQjRjWE4xWldwRWEyazNRU3RoTTIwelYwZHhLMjF0Q2lBZ0lDQWdJQ0FnUVd0c1VUUlpRbU52YkhwT1QzQm5WMk5zU1ZOMVJUTmtOV3RuZEdGS1FVTkpaM1JsT0RkR05sRkNRbk5yT0c5RVFrWlJRMjVhYlc5UGFYSnNVMnhpWmdvZ0lDQWdJQ0FnSUVwMVJEWm1Wa05LZFRKNldUZFVhRTR4VHpCdlYxUjNRV0ZPUVhaTk5UVkRURlIyTm5NelJtMTBVamt5Ykc1c1VVUkdkVW9yWm1vNE5qTmpObkY0TVRRS0lDQWdJQ0FnSUNCR2RVODBiVTAzWlhWVE1EaDNSMmRXUjIwNU1YZEJOMkpaYkRSaGFIaERObE15UWtkQ05VWjJhMXBtZWtKQ2QycHpabTFWVjBoQmRUZFdVbHBLZUd0WUNpQWdJQ0FnSUNBZ1NuQTJPVFpQVkdSU00xSm1TVGRKV2paUFZ6WjBSMFZNYVdwemQxZGlZbHBZWWpWWVVsZEZWems1ZGxkUE4wNUpTelp6VDNab1RVUk9jRGxpVTAxMVlnb2dJQ0FnSUNBZ0lGaFFNMUJpVUhobmVWUXdZbTF6Y3pCNWQwNVpkM1ZqYm1aamJVUlljVkJXZFROSFpIUTFNMkYwTVN0b1N6ZHRiRzVSTTNWVmN6VmxWa1ZQU1VodVNtMEtJQ0FnSUNBZ0lDQm1NWFJ5UkdkblUxUkZOMlp1YTNnMlEzcHNLMmxOYTBGRlVVVkJRVmxyUTFCQlVWbEJVVzlCU21oWmFFSkxTVEpJYlZKcVprUjRZbE5CUVZoNFpVTTBDaUFnSUNBZ0lDQWdiSEZxUmpsM1VIWkNVVXByZFhoaVdrRm9jMDFDVVd0RWQyMWpRVUZCYjBwRlQwTTBiSEZxUmpsM1VIWTRVMUZRTDJwelVXWktRMVZJY21wd1dEUm1VQW9nSUNBZ0lDQWdJREJPZEZaNWNXeERjbkV4VDIxTVVEZENUSEpZY2tONGIwRkdVbUkyTkZsS1ZXUlhhelZRTXpWck9YZHFNa0pSYW5CcVkwNXFNbWxyT0RCR2IyOHdNa1VLSUNBZ0lDQWdJQ0I1WXl0UWVsY3ZOSFI2Vm5aa2VGSnlSWHB6VDBadEsyMU5VaXRzYkZWSVFVdDZRbUUyVVVKNFNGUXdiMlpNTjNBMVdGbFVkVTFPYmxsdksxQnFWazF0Q2lBZ0lDQWdJQ0FnYWxBelZFVktSMWxZV1cxMWFFZG1ZV0ZLV25CcVRHMUtSbkZ3TlRsNEx5OWtjMDFJWlV4eFZVTm9kMkkyUTJjMlJIVnJRV2xvWlVGek0xQXJjbGh2TXdvZ0lDQWdJQ0FnSUhSQ2JrRTBTa05EYVZoU055OHZNRmRsZWxKdlUxQmtZV3hPWlcwMGRuTTRVRlE0TjNOdVNHSkViR2xHVFZabU9IY3JabXR6U1c1eGRtOTBhVkpFU1RRS0lDQWdJQ0FnSUNCUlFuSkNabk16VG1SbFdsY3ZkRzExY0U5aFdrcFNla2hFZG5aTFltY3ZMMDgyYVhBeFlWQjJTVXhYZGxSRVRUaExZMUZEVVVWVFlWZHJRMkpKTVhWakNpQWdJQ0FnSUNBZ2NtbDZRVTFpYkZSQ01tZDVkemw1YjJwRGNGWkRUVUpZWkdsNlFYRnhlV3cxV2xaeWR6UXJXQzlwTURsSmMwNTBPR2hCT1M4MVVsazNkak5qTjFveVF3b2dJQ0FnSUNBZ0lGaDVNbmhMVjIxMFRFazVibXhQVTFOM1ZYaENOVFkyU1RJNWJGWkxRa3hWYlZodFVXWnVVa2xKU0VOcFNrUllXVVpFVUM4MlRHWjJPU3R0YUVWWFZUZ0tJQ0FnSUNBZ0lDQnhaV1F6ZUdod1pVNVRRVWw2UVN0TlZHeHFkR2xTYlc5eWVIQmtaR2xZWW5SRFlXWmpVR3d2U2pOWU1FSXdOMlpqWTBwYWQxcHpRMWxEY0hSTWVURmpDaUFnSUNBZ0lDQWdlWFpXWVU0clJVSnRhbTlEY0ROcWREWjNUR1UwZUdOc2NWVXpRVU4zZWk4NFZFUkViWFJLTjFWVlpHdzNUV1JyYVhCUldqSTNPRXd5YTNCc05tODJNUW9nSUNBZ0lDQWdJRTFHTW1aWVJEZG1XazFsV21aRmR6WnNkVEJDUmpWdFdqQXZZMmd6U0hoWVpWcHZXR2xtTnpsbk1qVjJXbTFUWkZjNU4zQmpaV1YzVUd4MmJFVlVSbEVLSUNBZ0lDQWdJQ0ExTlhCTmIzSlJlVlZVUlZGRFVUTkZRM3BJV1ZOdVRDOVViVmMzQ2lBZ0lDQWdJQ0FnUFNzd1VtTUtJQ0FnSUNBZ0lDQXRMUzB0TFVWT1JDQlFSMUFnVUZWQ1RFbERJRXRGV1NCQ1RFOURTeTB0TFMwdENpQWdJQ0FnSUNKemIzVnlZMlVpT2lBaVpHVmlJRnR6YVdkdVpXUXRZbms5SkV0RldWOUdTVXhGWFNCb2RIUndjem92TDNKbGJHVmhjMlV0YW1GdGJYa3VhVzVtY21Gb2IzVnpaUzVqYjIwdklDUlNSVXhGUVZORkNpQWdJQ0FnSUNBZ2JXRnBiaUlLSW5CaFkydGhaMlZmZFhCa1lYUmxJam9nZEhKMVpRb2ljR0ZqYTJGblpYTWlPZ290SUNKd2RYQndaWFF0WTI5a1pTSUtMU0FpYVc1bWNtRm9iM1Z6WlMxMGIyOXNhMmwwSWdvdElDSnBibVp5WVdodmRYTmxMWEIxY0hCbGRDMWtZWFJoSWdvaWNIVndjR1YwSWpvS0lDQWlZMjlzYkdWamRHbHZiaUk2SUNKd2RYQndaWFE0SWdvZ0lDSnBibk4wWVd4c0lqb2dkSEoxWlFvZ0lDSnBibk4wWVd4c1gzUjVjR1VpT2lBaVlXbHZJZ29nSUNKd1lXTnJZV2RsWDI1aGJXVWlPaUFpY0hWd2NHVjBMV0ZuWlc1MElnb2dJQ0p6ZEdGeWRGOXpaWEoyYVdObElqb2dabUZzYzJVS0luSjFibU50WkNJNkNpMGdMU0FpYVdndGNIVndjR1YwSWdvZ0lDMGdJaTB0Wlc1MmFYSnZibTFsYm5RaUNpQWdMU0FpY0hKdlpIVmpkR2x2YmlJS0lDQXRJQ0l0TFdWdWRtbHliMjV0Wlc1MGNHRjBhQ0lLSUNBdElDSjdjbTl2ZEY5a2FYSmxZM1J2Y25sOUwyVnVkbWx5YjI1dFpXNTBjeUlLSUNBdElDSXRMWEp2YjNRdFpHbHlaV04wYjNKNUlnb2dJQzBnSWk5dmNIUXZjSFZ3Y0dWMExXTnZaR1VpQ2lBZ0xTQWlMUzFvYVdWeVlTMWpiMjVtYVdjaUNpQWdMU0FpTDI5d2RDOXBibVp5WVdodmRYTmxMWEIxY0hCbGRDMWtZWFJoTDJWdWRtbHliMjV0Wlc1MGN5OXdjbTlrZFdOMGFXOXVMMmhwWlhKaExubGhiV3dpQ2lBZ0xTQWlMUzF0YjJSMWJHVXRjR0YwYUNJS0lDQXRJQ0o3Y205dmRGOWthWEpsWTNSdmNubDlMMjF2WkhWc1pYTWlDaUFnTFNBaVlYQndiSGtpQ2lKM2NtbDBaVjltYVd4bGN5STZDaTBnSW1OdmJuUmxiblFpT2lBaVpYaHdiM0owSUVGWFUxOUVSVVpCVlV4VVgxSkZSMGxQVGoxMWN5MTNaWE4wTFRFaUNpQWdJbkJoZEdnaU9pQWlMMlYwWXk5d2NtOW1hV3hsTG1RdllYZHpMbk5vSWdvZ0lDSndaWEp0YVhOemFXOXVjeUk2SUNJd05qUTBJZ290SUNKamIyNTBaVzUwSWpvZ2ZDMEtJQ0FnSUZ0a1pXWmhkV3gwWFFvZ0lDQWdjbVZuYVc5dVBYVnpMWGRsYzNRdE1Rb2dJQ0p3WVhSb0lqb2dJaTl5YjI5MEx5NWhkM012WTI5dVptbG5JZ29nSUNKd1pYSnRhWE56YVc5dWN5STZJQ0l3TmpBd0lnb3RJQ0pqYjI1MFpXNTBJam9nZkFvZ0lDQWdJbkIxY0hCbGRGOWxiblpwY205dWJXVnVkQ0k2SUNKd2NtOWtkV04wYVc5dUlnb2dJQ0FnSW5CMWNIQmxkRjl5YjJ4bElqb2dJbXAxYlhCb2IzTjBJZ29nSUNKd1lYUm9Jam9nSWk5bGRHTXZjSFZ3Y0dWMGJHRmljeTltWVdOMFpYSXZabUZqZEhNdVpDOXdkWEJ3WlhRdWVXRnRiQ0lLSUNBaWNHVnliV2x6YzJsdmJuTWlPaUFpTURZME5DSUtMU0FpWTI5dWRHVnVkQ0k2SUNKN1hDSnBhQzF3ZFhCd1pYUmNJanA3WENKa1pXSjFaMXdpT21aaGJITmxMRndpWlc1MmFYSnZibTFsYm5Sd1lYUm9YQ0k2WENKN2NtOXZkRjlrYVhKbFkzUnZjbmw5TDJWdWRtbHliMjV0Wlc1MGMxd2lMRndpYUdsbGNtRXRZMjl1Wm1sblhDSTZYQ0l2YjNCMEwybHVabkpoYUc5MWMyVXRjSFZ3Y0dWMExXUmhkR0V2Wlc1MmFYSnZibTFsYm5SekwzQnliMlIxWTNScGIyNHZhR2xsY21FdWVXRnRiRndpTEZ3aWJXOWtkV3hsTFhCaGRHaGNJanBjSW50eWIyOTBYMlJwY21WamRHOXllWDB2Ylc5a2RXeGxjMXdpTEZ3aWNtOXZkQzFrYVhKbFkzUnZjbmxjSWpwY0lpOXZjSFF2Y0hWd2NHVjBMV052WkdWY0luMTlJZ29nSUNKd1lYUm9Jam9nSWk5bGRHTXZjSFZ3Y0dWMGJHRmljeTltWVdOMFpYSXZabUZqZEhNdVpDOXBhQzF3ZFhCd1pYUXVhbk52YmlJS0lDQWljR1Z5YldsemMybHZibk1pT2lBaU1EWTBOQ0lLTFNBaVkyOXVkR1Z1ZENJNklDSjdmU0lLSUNBaWNHRjBhQ0k2SUNJdlpYUmpMM0IxY0hCbGRHeGhZbk12Wm1GamRHVnlMMlpoWTNSekxtUXZZM1Z6ZEc5dExtcHpiMjRpQ2lBZ0luQmxjbTFwYzNOcGIyNXpJam9nSWpBMk5EUWlDZzBLTFMxTlNVMUZRazlWVGtSQlVsa3RMUTBLXCJcbiAgICAgICsgdnBjX3NlY3VyaXR5X2dyb3VwX2lkcyA9IChrbm93biBhZnRlciBhcHBseSlcblxuICAgICAgKyBpYW1faW5zdGFuY2VfcHJvZmlsZSB7XG4gICAgICAgICAgKyBhcm4gPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBtb2R1bGUuanVtcGhvc3QuYXdzX3NlY3VyaXR5X2dyb3VwLmp1bXBob3N0IHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX3NlY3VyaXR5X2dyb3VwXCIgXCJqdW1waG9zdFwiIHtcbiAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZGVzY3JpcHRpb24gICAgICAgICAgICA9IFwiTWFuYWdlIHRyYWZmaWMgdG8ganVtcGhvc3RcIlxuICAgICAgKyBlZ3Jlc3MgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpbmdyZXNzICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lX3ByZWZpeCAgICAgICAgICAgID0gXCJqdW1waG9zdFwiXG4gICAgICArIG93bmVyX2lkICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJldm9rZV9ydWxlc19vbl9kZWxldGUgPSBmYWxzZVxuICAgICAgKyB0YWdzICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJOYW1lXCIgPSBcImp1bXBob3N0XCJcbiAgICAgICAgfVxuICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCJqdW1waG9zdFwiXG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJcbiAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiXG4gICAgICAgIH1cbiAgICAgICsgdnBjX2lkICAgICAgICAgICAgICAgICA9IFwidnBjLTA4ZTE5ZDg1OWMyNmQxOGIyXCJcbiAgICB9XG5cbiAgIyBtb2R1bGUuanVtcGhvc3QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9lZ3Jlc3NfcnVsZS5kZWZhdWx0IHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX3ZwY19zZWN1cml0eV9ncm91cF9lZ3Jlc3NfcnVsZVwiIFwiZGVmYXVsdFwiIHtcbiAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgY2lkcl9pcHY0ICAgICAgICAgICAgICA9IFwiMC4wLjAuMC8wXCJcbiAgICAgICsgZGVzY3JpcHRpb24gICAgICAgICAgICA9IFwiQWxsb3cgYWxsIHRyYWZmaWNcIlxuICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpcF9wcm90b2NvbCAgICAgICAgICAgID0gXCItMVwiXG4gICAgICArIHNlY3VyaXR5X2dyb3VwX2lkICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHNlY3VyaXR5X2dyb3VwX3J1bGVfaWQgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHRhZ3MgICAgICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgKyBcIk5hbWVcIiA9IFwib3V0Z29pbmcgdHJhZmZpY1wiXG4gICAgICAgIH1cbiAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiTmFtZVwiICAgICAgICA9IFwib3V0Z29pbmcgdHJhZmZpY1wiXG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJcbiAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiXG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBtb2R1bGUuanVtcGhvc3QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUuaWNtcCB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlXCIgXCJpY21wXCIge1xuICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBjaWRyX2lwdjQgICAgICAgICAgICAgID0gXCIwLjAuMC4wLzBcIlxuICAgICAgKyBkZXNjcmlwdGlvbiAgICAgICAgICAgID0gXCJBbGxvdyBhbGwgSUNNUCB0cmFmZmljXCJcbiAgICAgICsgZnJvbV9wb3J0ICAgICAgICAgICAgICA9IC0xXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlwX3Byb3RvY29sICAgICAgICAgICAgPSBcImljbXBcIlxuICAgICAgKyBzZWN1cml0eV9ncm91cF9pZCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBzZWN1cml0eV9ncm91cF9ydWxlX2lkID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0YWdzICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJOYW1lXCIgPSBcIklDTVAgdHJhZmZpY1wiXG4gICAgICAgIH1cbiAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiTmFtZVwiICAgICAgICA9IFwiSUNNUCB0cmFmZmljXCJcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIlxuICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCJcbiAgICAgICAgfVxuICAgICAgKyB0b19wb3J0ICAgICAgICAgICAgICAgID0gLTFcbiAgICB9XG5cbiAgIyBtb2R1bGUuanVtcGhvc3QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUuc3NoIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGVcIiBcInNzaFwiIHtcbiAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgY2lkcl9pcHY0ICAgICAgICAgICAgICA9IFwiMC4wLjAuMC8wXCJcbiAgICAgICsgZGVzY3JpcHRpb24gICAgICAgICAgICA9IFwiQWxsb3cgU1NIIHRyYWZmaWNcIlxuICAgICAgKyBmcm9tX3BvcnQgICAgICAgICAgICAgID0gMjJcbiAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaXBfcHJvdG9jb2wgICAgICAgICAgICA9IFwidGNwXCJcbiAgICAgICsgc2VjdXJpdHlfZ3JvdXBfaWQgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgc2VjdXJpdHlfZ3JvdXBfcnVsZV9pZCA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdGFncyAgICAgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiTmFtZVwiID0gXCJTU0ggYWNjZXNzXCJcbiAgICAgICAgfVxuICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCJTU0ggYWNjZXNzXCJcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIlxuICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCJcbiAgICAgICAgfVxuICAgICAgKyB0b19wb3J0ICAgICAgICAgICAgICAgID0gMjJcbiAgICB9XG5cbiAgIyBtb2R1bGUuanVtcGhvc3QucmFuZG9tX3N0cmluZy5hc2dfbmFtZSB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcInJhbmRvbV9zdHJpbmdcIiBcImFzZ19uYW1lXCIge1xuICAgICAgKyBpZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbGVuZ3RoICAgICAgPSA2XG4gICAgICArIGxvd2VyICAgICAgID0gdHJ1ZVxuICAgICAgKyBtaW5fbG93ZXIgICA9IDBcbiAgICAgICsgbWluX251bWVyaWMgPSAwXG4gICAgICArIG1pbl9zcGVjaWFsID0gMFxuICAgICAgKyBtaW5fdXBwZXIgICA9IDBcbiAgICAgICsgbnVtYmVyICAgICAgPSB0cnVlXG4gICAgICArIG51bWVyaWMgICAgID0gdHJ1ZVxuICAgICAgKyByZXN1bHQgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgc3BlY2lhbCAgICAgPSBmYWxzZVxuICAgICAgKyB1cHBlciAgICAgICA9IHRydWVcbiAgICB9XG5cbiAgIyBtb2R1bGUuanVtcGhvc3QucmFuZG9tX3N0cmluZy5wcm9maWxlLXN1ZmZpeCB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcInJhbmRvbV9zdHJpbmdcIiBcInByb2ZpbGUtc3VmZml4XCIge1xuICAgICAgKyBpZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbGVuZ3RoICAgICAgPSAxMlxuICAgICAgKyBsb3dlciAgICAgICA9IHRydWVcbiAgICAgICsgbWluX2xvd2VyICAgPSAwXG4gICAgICArIG1pbl9udW1lcmljID0gMFxuICAgICAgKyBtaW5fc3BlY2lhbCA9IDBcbiAgICAgICsgbWluX3VwcGVyICAgPSAwXG4gICAgICArIG51bWJlciAgICAgID0gdHJ1ZVxuICAgICAgKyBudW1lcmljICAgICA9IHRydWVcbiAgICAgICsgcmVzdWx0ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHNwZWNpYWwgICAgID0gZmFsc2VcbiAgICAgICsgdXBwZXIgICAgICAgPSB0cnVlXG4gICAgfVxuXG4gICMgbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmF3c19pYW1faW5zdGFuY2VfcHJvZmlsZS5wcm9maWxlIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9pbnN0YW5jZV9wcm9maWxlXCIgXCJwcm9maWxlXCIge1xuICAgICAgKyBhcm4gICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgY3JlYXRlX2RhdGUgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbmFtZV9wcmVmaXggPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBhdGggICAgICAgID0gXCIvXCJcbiAgICAgICsgcm9sZSAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHRhZ3NfYWxsICAgID0ge1xuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXG4gICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIlxuICAgICAgICB9XG4gICAgICArIHVuaXF1ZV9pZCAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuICAjIG1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5hd3NfaWFtX3BvbGljeS5wcm9maWxlIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9wb2xpY3lcIiBcInByb2ZpbGVcIiB7XG4gICAgICArIGFybiAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbmFtZSAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWVfcHJlZml4ID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwYXRoICAgICAgICA9IFwiL1wiXG4gICAgICArIHBvbGljeSAgICAgID0ganNvbmVuY29kZShcbiAgICAgICAgICAgIHtcbiAgICAgICAgICAgICAgKyBTdGF0ZW1lbnQgPSBbXG4gICAgICAgICAgICAgICAgICArIHtcbiAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgID0gXCJlYzI6RGVzY3JpYmUqXCJcbiAgICAgICAgICAgICAgICAgICAgICArIEVmZmVjdCAgID0gXCJBbGxvd1wiXG4gICAgICAgICAgICAgICAgICAgICAgKyBSZXNvdXJjZSA9IFwiKlwiXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICArIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiXG4gICAgICAgICAgICB9XG4gICAgICAgIClcbiAgICAgICsgcG9saWN5X2lkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHRhZ3NfYWxsICAgID0ge1xuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXG4gICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIlxuICAgICAgICB9XG4gICAgfVxuXG4gICMgbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmF3c19pYW1fcm9sZS5wcm9maWxlIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlXCIgXCJwcm9maWxlXCIge1xuICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGFzc3VtZV9yb2xlX3BvbGljeSAgICA9IGpzb25lbmNvZGUoXG4gICAgICAgICAgICB7XG4gICAgICAgICAgICAgICsgU3RhdGVtZW50ID0gW1xuICAgICAgICAgICAgICAgICAgKyB7XG4gICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICAgPSBcInN0czpBc3N1bWVSb2xlXCJcbiAgICAgICAgICAgICAgICAgICAgICArIEVmZmVjdCAgICA9IFwiQWxsb3dcIlxuICAgICAgICAgICAgICAgICAgICAgICsgUHJpbmNpcGFsID0ge1xuICAgICAgICAgICAgICAgICAgICAgICAgICArIFNlcnZpY2UgPSBcImVjMi5hbWF6b25hd3MuY29tXCJcbiAgICAgICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAgICAgfSxcbiAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICsgVmVyc2lvbiAgID0gXCIyMDEyLTEwLTE3XCJcbiAgICAgICAgICAgIH1cbiAgICAgICAgKVxuICAgICAgKyBjcmVhdGVfZGF0ZSAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGZvcmNlX2RldGFjaF9wb2xpY2llcyA9IGZhbHNlXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbWFuYWdlZF9wb2xpY3lfYXJucyAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBtYXhfc2Vzc2lvbl9kdXJhdGlvbiAgPSAzNjAwXG4gICAgICArIG5hbWUgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbmFtZV9wcmVmaXggICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwYXRoICAgICAgICAgICAgICAgICAgPSBcIi9cIlxuICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJcbiAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiXG4gICAgICAgIH1cbiAgICAgICsgdW5pcXVlX2lkICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuICAjIG1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuZXh0cmFbXCJwYWNrYWdlLXB1Ymxpc2hlclwiXSB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudFwiIFwiZXh0cmFcIiB7XG4gICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBvbGljeV9hcm4gPSBcImFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cG9saWN5L3BhY2thZ2UtcHVibGlzaGVyXCJcbiAgICAgICsgcm9sZSAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cbiAgIyBtb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmV4dHJhW1wicmVxdWlyZWRcIl0gd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnRcIiBcImV4dHJhXCIge1xuICAgICAgKyBpZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwb2xpY3lfYXJuID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyByb2xlICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuICAjIG1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQucHJvZmlsZSB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudFwiIFwicHJvZmlsZVwiIHtcbiAgICAgICsgaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcG9saWN5X2FybiA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcm9sZSAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cbiAgIyBtb2R1bGUuanVtcGhvc3QubW9kdWxlLnVwZGF0ZV9kbnMuZGF0YS5hcmNoaXZlX2ZpbGUubGFtYmRhIHdpbGwgYmUgcmVhZCBkdXJpbmcgYXBwbHlcbiAgIyAoY29uZmlnIHJlZmVycyB0byB2YWx1ZXMgbm90IHlldCBrbm93bilcbiA8PSBkYXRhIFwiYXJjaGl2ZV9maWxlXCIgXCJsYW1iZGFcIiB7XG4gICAgICArIGV4Y2x1ZGVzICAgICAgICAgICAgPSBbXG4gICAgICAgICAgKyBcIl9fcHljYWNoZV9fXCIsXG4gICAgICAgIF1cbiAgICAgICsgaWQgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3V0cHV0X2Jhc2U2NHNoYTI1NiA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3V0cHV0X2Jhc2U2NHNoYTUxMiA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3V0cHV0X21kNSAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3V0cHV0X3BhdGggICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3V0cHV0X3NoYSAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3V0cHV0X3NoYTI1NiAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3V0cHV0X3NoYTUxMiAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3V0cHV0X3NpemUgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgc291cmNlX2RpciAgICAgICAgICA9IFwiLnRlcnJhZm9ybS9tb2R1bGVzL2p1bXBob3N0LnVwZGF0ZV9kbnMvdXBkYXRlX2Ruc1wiXG4gICAgICArIHR5cGUgICAgICAgICAgICAgICAgPSBcInppcFwiXG4gICAgfVxuXG4gICMgbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS51cGRhdGVfZG5zLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQubGFtYmRhLXBlcm1pc3Npb25zIHdpbGwgYmUgcmVhZCBkdXJpbmcgYXBwbHlcbiAgIyAoY29uZmlnIHJlZmVycyB0byB2YWx1ZXMgbm90IHlldCBrbm93bilcbiA8PSBkYXRhIFwiYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnRcIiBcImxhbWJkYS1wZXJtaXNzaW9uc1wiIHtcbiAgICAgICsgaWQgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsganNvbiA9IChrbm93biBhZnRlciBhcHBseSlcblxuICAgICAgKyBzdGF0ZW1lbnQge1xuICAgICAgICAgICsgYWN0aW9ucyAgID0gW1xuICAgICAgICAgICAgICArIFwiYXV0b3NjYWxpbmc6Q29tcGxldGVMaWZlY3ljbGVBY3Rpb25cIixcbiAgICAgICAgICAgIF1cbiAgICAgICAgICArIHJlc291cmNlcyA9IFtcbiAgICAgICAgICAgICAgKyAoa25vd24gYWZ0ZXIgYXBwbHkpLFxuICAgICAgICAgICAgXVxuICAgICAgICB9XG4gICAgICArIHN0YXRlbWVudCB7XG4gICAgICAgICAgKyBhY3Rpb25zICAgPSBbXG4gICAgICAgICAgICAgICsgXCJlYzI6RGVzY3JpYmVJbnN0YW5jZXNcIixcbiAgICAgICAgICAgICAgKyBcImVjMjpEZXNjcmliZVRhZ3NcIixcbiAgICAgICAgICAgIF1cbiAgICAgICAgICArIHJlc291cmNlcyA9IFtcbiAgICAgICAgICAgICAgKyBcIipcIixcbiAgICAgICAgICAgIF1cbiAgICAgICAgfVxuICAgICAgKyBzdGF0ZW1lbnQge1xuICAgICAgICAgICsgYWN0aW9ucyAgID0gW1xuICAgICAgICAgICAgICArIFwiZWMyOkNyZWF0ZVRhZ3NcIixcbiAgICAgICAgICAgIF1cbiAgICAgICAgICArIHJlc291cmNlcyA9IFtcbiAgICAgICAgICAgICAgKyBcImFybjphd3M6ZWMyOio6NDkzMzcwODI2NDI0Omluc3RhbmNlLypcIixcbiAgICAgICAgICAgIF1cbiAgICAgICAgfVxuICAgICAgKyBzdGF0ZW1lbnQge1xuICAgICAgICAgICsgYWN0aW9ucyAgID0gW1xuICAgICAgICAgICAgICArIFwicm91dGU1MzpDaGFuZ2VSZXNvdXJjZVJlY29yZFNldHNcIixcbiAgICAgICAgICAgICAgKyBcInJvdXRlNTM6TGlzdFJlc291cmNlUmVjb3JkU2V0c1wiLFxuICAgICAgICAgICAgXVxuICAgICAgICAgICsgcmVzb3VyY2VzID0gW1xuICAgICAgICAgICAgICArIFwiYXJuOmF3czpyb3V0ZTUzOjo6aG9zdGVkem9uZS9aMDc2NjIyNTFMSDNZUkYyRVJNM0dcIixcbiAgICAgICAgICAgIF1cbiAgICAgICAgfVxuICAgIH1cblxuICAjIG1vZHVsZS5qdW1waG9zdC5tb2R1bGUudXBkYXRlX2Rucy5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmxhbWJkYV9sb2dnaW5nIHdpbGwgYmUgcmVhZCBkdXJpbmcgYXBwbHlcbiAgIyAoY29uZmlnIHJlZmVycyB0byB2YWx1ZXMgbm90IHlldCBrbm93bilcbiA8PSBkYXRhIFwiYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnRcIiBcImxhbWJkYV9sb2dnaW5nXCIge1xuICAgICAgKyBpZCAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBqc29uID0gKGtub3duIGFmdGVyIGFwcGx5KVxuXG4gICAgICArIHN0YXRlbWVudCB7XG4gICAgICAgICAgKyBhY3Rpb25zICAgPSBbXG4gICAgICAgICAgICAgICsgXCJsb2dzOkNyZWF0ZUxvZ1N0cmVhbVwiLFxuICAgICAgICAgICAgXVxuICAgICAgICAgICsgZWZmZWN0ICAgID0gXCJBbGxvd1wiXG4gICAgICAgICAgKyByZXNvdXJjZXMgPSBbXG4gICAgICAgICAgICAgICsgKGtub3duIGFmdGVyIGFwcGx5KSxcbiAgICAgICAgICAgIF1cbiAgICAgICAgfVxuICAgICAgKyBzdGF0ZW1lbnQge1xuICAgICAgICAgICsgYWN0aW9ucyAgID0gW1xuICAgICAgICAgICAgICArIFwibG9nczpQdXRMb2dFdmVudHNcIixcbiAgICAgICAgICAgIF1cbiAgICAgICAgICArIGVmZmVjdCAgICA9IFwiQWxsb3dcIlxuICAgICAgICAgICsgcmVzb3VyY2VzID0gW1xuICAgICAgICAgICAgICArIFwiYXJuOmF3czpsb2dzOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6bG9nLWdyb3VwOio6bG9nLXN0cmVhbToqXCIsXG4gICAgICAgICAgICBdXG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBtb2R1bGUuanVtcGhvc3QubW9kdWxlLnVwZGF0ZV9kbnMuYXdzX2Nsb3Vkd2F0Y2hfZXZlbnRfcnVsZS5pbnN0YW5jZV9jaGFuZ2Ugd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfY2xvdWR3YXRjaF9ldmVudF9ydWxlXCIgXCJpbnN0YW5jZV9jaGFuZ2VcIiB7XG4gICAgICArIGFybiAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBkZXNjcmlwdGlvbiAgICA9IFwiSW5zdGFuY2UgcnVubmluZ1wiXG4gICAgICArIGV2ZW50X2J1c19uYW1lID0gXCJkZWZhdWx0XCJcbiAgICAgICsgZXZlbnRfcGF0dGVybiAgPSBqc29uZW5jb2RlKFxuICAgICAgICAgICAge1xuICAgICAgICAgICAgICArIGRldGFpbCAgICAgID0ge1xuICAgICAgICAgICAgICAgICAgKyBzdGF0ZSA9IFtcbiAgICAgICAgICAgICAgICAgICAgICArIFwicnVubmluZ1wiLFxuICAgICAgICAgICAgICAgICAgICAgICsgXCJzaHV0dGluZy1kb3duXCIsXG4gICAgICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICsgZGV0YWlsLXR5cGUgPSBbXG4gICAgICAgICAgICAgICAgICArIFwiRUMyIEluc3RhbmNlIFN0YXRlLWNoYW5nZSBOb3RpZmljYXRpb25cIixcbiAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICsgc291cmNlICAgICAgPSBbXG4gICAgICAgICAgICAgICAgICArIFwiYXdzLmVjMlwiLFxuICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgIH1cbiAgICAgICAgKVxuICAgICAgKyBpZCAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbmFtZSAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWVfcHJlZml4ICAgID0gXCJhc2dfaW5zdGFuY2VcIlxuICAgICAgKyB0YWdzX2FsbCAgICAgICA9IHtcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIlxuICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCJcbiAgICAgICAgfVxuICAgIH1cblxuICAjIG1vZHVsZS5qdW1waG9zdC5tb2R1bGUudXBkYXRlX2Rucy5hd3NfY2xvdWR3YXRjaF9ldmVudF9ydWxlLnNjYWxlIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2Nsb3Vkd2F0Y2hfZXZlbnRfcnVsZVwiIFwic2NhbGVcIiB7XG4gICAgICArIGFybiAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBkZXNjcmlwdGlvbiAgICA9IFwiQVNHIGxpZmVjeWNsZSBob29rXCJcbiAgICAgICsgZXZlbnRfYnVzX25hbWUgPSBcImRlZmF1bHRcIlxuICAgICAgKyBldmVudF9wYXR0ZXJuICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWUgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lX3ByZWZpeCAgICA9IFwiYXNnLXNjYWxlXCJcbiAgICAgICsgdGFnc19hbGwgICAgICAgPSB7XG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJcbiAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiXG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBtb2R1bGUuanVtcGhvc3QubW9kdWxlLnVwZGF0ZV9kbnMuYXdzX2Nsb3Vkd2F0Y2hfZXZlbnRfdGFyZ2V0Lmluc3RhbmNlLXJ1bm5pbmcgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfY2xvdWR3YXRjaF9ldmVudF90YXJnZXRcIiBcImluc3RhbmNlLXJ1bm5pbmdcIiB7XG4gICAgICArIGFybiAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBldmVudF9idXNfbmFtZSA9IFwiZGVmYXVsdFwiXG4gICAgICArIGlkICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBydWxlICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdGFyZ2V0X2lkICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG4gICMgbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS51cGRhdGVfZG5zLmF3c19jbG91ZHdhdGNoX2V2ZW50X3RhcmdldC5zY2FsZS1vdXQgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfY2xvdWR3YXRjaF9ldmVudF90YXJnZXRcIiBcInNjYWxlLW91dFwiIHtcbiAgICAgICsgYXJuICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGV2ZW50X2J1c19uYW1lID0gXCJkZWZhdWx0XCJcbiAgICAgICsgaWQgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJ1bGUgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0YXJnZXRfaWQgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cbiAgIyBtb2R1bGUuanVtcGhvc3QubW9kdWxlLnVwZGF0ZV9kbnMuYXdzX2Nsb3Vkd2F0Y2hfbG9nX2dyb3VwLnVwZGF0ZV9kbnMgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfY2xvdWR3YXRjaF9sb2dfZ3JvdXBcIiBcInVwZGF0ZV9kbnNcIiB7XG4gICAgICArIGFybiAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbG9nX2dyb3VwX2NsYXNzICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWUgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lX3ByZWZpeCAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcmV0ZW50aW9uX2luX2RheXMgPSAxNFxuICAgICAgKyBza2lwX2Rlc3Ryb3kgICAgICA9IGZhbHNlXG4gICAgICArIHRhZ3NfYWxsICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXG4gICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIlxuICAgICAgICB9XG4gICAgfVxuXG4gICMgbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS51cGRhdGVfZG5zLmF3c19pYW1fcG9saWN5LmxhbWJkYV9sb2dnaW5nIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9wb2xpY3lcIiBcImxhbWJkYV9sb2dnaW5nXCIge1xuICAgICAgKyBhcm4gICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZGVzY3JpcHRpb24gPSBcIklBTSBwb2xpY3kgZm9yIGxvZ2dpbmcgZnJvbSBhIGxhbWJkYVwiXG4gICAgICArIGlkICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbmFtZV9wcmVmaXggPSBcImxhbWJkYV9sb2dnaW5nXCJcbiAgICAgICsgcGF0aCAgICAgICAgPSBcIi9cIlxuICAgICAgKyBwb2xpY3kgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcG9saWN5X2lkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHRhZ3NfYWxsICAgID0ge1xuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXG4gICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIlxuICAgICAgICB9XG4gICAgfVxuXG4gICMgbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS51cGRhdGVfZG5zLmF3c19pYW1fcG9saWN5LmxhbWJkYV9wZXJtaXNzaW9ucyB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19pYW1fcG9saWN5XCIgXCJsYW1iZGFfcGVybWlzc2lvbnNcIiB7XG4gICAgICArIGFybiAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBkZXNjcmlwdGlvbiA9IFwiSUFNIHBvbGljeSBmb3IgYSBsYW1iZGEgcGVybWlzc2lvbnNcIlxuICAgICAgKyBpZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbmFtZSAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWVfcHJlZml4ID0gXCJsYW1iZGFfcGVybWlzc2lvbnNcIlxuICAgICAgKyBwYXRoICAgICAgICA9IFwiL1wiXG4gICAgICArIHBvbGljeSAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwb2xpY3lfaWQgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdGFnc19hbGwgICAgPSB7XG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJcbiAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiXG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBtb2R1bGUuanVtcGhvc3QubW9kdWxlLnVwZGF0ZV9kbnMuYXdzX2lhbV9yb2xlLmlhbV9mb3JfbGFtYmRhIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlXCIgXCJpYW1fZm9yX2xhbWJkYVwiIHtcbiAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBhc3N1bWVfcm9sZV9wb2xpY3kgICAgPSBqc29uZW5jb2RlKFxuICAgICAgICAgICAge1xuICAgICAgICAgICAgICArIFN0YXRlbWVudCA9IFtcbiAgICAgICAgICAgICAgICAgICsge1xuICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgID0gXCJzdHM6QXNzdW1lUm9sZVwiXG4gICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICAgPSBcIkFsbG93XCJcbiAgICAgICAgICAgICAgICAgICAgICArIFByaW5jaXBhbCA9IHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBTZXJ2aWNlID0gXCJsYW1iZGEuYW1hem9uYXdzLmNvbVwiXG4gICAgICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICArIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiXG4gICAgICAgICAgICB9XG4gICAgICAgIClcbiAgICAgICsgY3JlYXRlX2RhdGUgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBmb3JjZV9kZXRhY2hfcG9saWNpZXMgPSBmYWxzZVxuICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG1hbmFnZWRfcG9saWN5X2FybnMgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbWF4X3Nlc3Npb25fZHVyYXRpb24gID0gMzYwMFxuICAgICAgKyBuYW1lICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWVfcHJlZml4ICAgICAgICAgICA9IFwiaWFtX2Zvcl9sYW1iZGFcIlxuICAgICAgKyBwYXRoICAgICAgICAgICAgICAgICAgPSBcIi9cIlxuICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJcbiAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiXG4gICAgICAgIH1cbiAgICAgICsgdW5pcXVlX2lkICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuICAjIG1vZHVsZS5qdW1waG9zdC5tb2R1bGUudXBkYXRlX2Rucy5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuQVdTTGFtYmRhQmFzaWNFeGVjdXRpb25Sb2xlIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50XCIgXCJBV1NMYW1iZGFCYXNpY0V4ZWN1dGlvblJvbGVcIiB7XG4gICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBvbGljeV9hcm4gPSBcImFybjphd3M6aWFtOjphd3M6cG9saWN5L3NlcnZpY2Utcm9sZS9BV1NMYW1iZGFCYXNpY0V4ZWN1dGlvblJvbGVcIlxuICAgICAgKyByb2xlICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuICAjIG1vZHVsZS5qdW1waG9zdC5tb2R1bGUudXBkYXRlX2Rucy5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQubGFtYmRhX2xvZ3Mgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnRcIiBcImxhbWJkYV9sb2dzXCIge1xuICAgICAgKyBpZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwb2xpY3lfYXJuID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyByb2xlICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuICAjIG1vZHVsZS5qdW1waG9zdC5tb2R1bGUudXBkYXRlX2Rucy5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQubGFtYmRhX3Blcm1pc3Npb25zIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50XCIgXCJsYW1iZGFfcGVybWlzc2lvbnNcIiB7XG4gICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBvbGljeV9hcm4gPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJvbGUgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG4gICMgbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS51cGRhdGVfZG5zLmF3c19sYW1iZGFfZnVuY3Rpb24udXBkYXRlX2RucyB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19sYW1iZGFfZnVuY3Rpb25cIiBcInVwZGF0ZV9kbnNcIiB7XG4gICAgICArIGFyY2hpdGVjdHVyZXMgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBmdW5jdGlvbl9uYW1lICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGhhbmRsZXIgICAgICAgICAgICAgICAgICAgICAgICA9IFwibWFpbi5sYW1iZGFfaGFuZGxlclwiXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaW52b2tlX2FybiAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBsYXN0X21vZGlmaWVkICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG1lbW9yeV9zaXplICAgICAgICAgICAgICAgICAgICA9IDEyOFxuICAgICAgKyBwYWNrYWdlX3R5cGUgICAgICAgICAgICAgICAgICAgPSBcIlppcFwiXG4gICAgICArIHB1Ymxpc2ggICAgICAgICAgICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICArIHF1YWxpZmllZF9hcm4gICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcXVhbGlmaWVkX2ludm9rZV9hcm4gICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyByZXNlcnZlZF9jb25jdXJyZW50X2V4ZWN1dGlvbnMgPSAtMVxuICAgICAgKyByb2xlICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJ1bnRpbWUgICAgICAgICAgICAgICAgICAgICAgICA9IFwicHl0aG9uMy45XCJcbiAgICAgICsgczNfYnVja2V0ICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBzM19rZXkgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHNpZ25pbmdfam9iX2FybiAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgc2lnbmluZ19wcm9maWxlX3ZlcnNpb25fYXJuICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBza2lwX2Rlc3Ryb3kgICAgICAgICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgKyBzb3VyY2VfY29kZV9oYXNoICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHNvdXJjZV9jb2RlX3NpemUgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXG4gICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIlxuICAgICAgICB9XG4gICAgICArIHRpbWVvdXQgICAgICAgICAgICAgICAgICAgICAgICA9IDMwXG4gICAgICArIHZlcnNpb24gICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcblxuICAgICAgKyBlbnZpcm9ubWVudCB7XG4gICAgICAgICAgKyB2YXJpYWJsZXMgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBtb2R1bGUuanVtcGhvc3QubW9kdWxlLnVwZGF0ZV9kbnMuYXdzX2xhbWJkYV9mdW5jdGlvbl9ldmVudF9pbnZva2VfY29uZmlnLnVwZGF0ZV9kbnMgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfbGFtYmRhX2Z1bmN0aW9uX2V2ZW50X2ludm9rZV9jb25maWdcIiBcInVwZGF0ZV9kbnNcIiB7XG4gICAgICArIGZ1bmN0aW9uX25hbWUgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG1heGltdW1fcmV0cnlfYXR0ZW1wdHMgPSAwXG4gICAgfVxuXG4gICMgbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS51cGRhdGVfZG5zLmF3c19sYW1iZGFfcGVybWlzc2lvbi5hbGxvd19jbG91ZHdhdGNoX2FzZ19saWZlY3ljbGVfaG9vayB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19sYW1iZGFfcGVybWlzc2lvblwiIFwiYWxsb3dfY2xvdWR3YXRjaF9hc2dfbGlmZWN5Y2xlX2hvb2tcIiB7XG4gICAgICArIGFjdGlvbiAgICAgICAgICAgICAgPSBcImxhbWJkYTpJbnZva2VGdW5jdGlvblwiXG4gICAgICArIGZ1bmN0aW9uX25hbWUgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHByaW5jaXBhbCAgICAgICAgICAgPSBcImV2ZW50cy5hbWF6b25hd3MuY29tXCJcbiAgICAgICsgc291cmNlX2FybiAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgc3RhdGVtZW50X2lkICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgc3RhdGVtZW50X2lkX3ByZWZpeCA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cbiAgIyBtb2R1bGUuanVtcGhvc3QubW9kdWxlLnVwZGF0ZV9kbnMuYXdzX2xhbWJkYV9wZXJtaXNzaW9uLmFsbG93X2Nsb3Vkd2F0Y2hfaW5zdGFuY2VfcnVubmluZyB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19sYW1iZGFfcGVybWlzc2lvblwiIFwiYWxsb3dfY2xvdWR3YXRjaF9pbnN0YW5jZV9ydW5uaW5nXCIge1xuICAgICAgKyBhY3Rpb24gICAgICAgICAgICAgID0gXCJsYW1iZGE6SW52b2tlRnVuY3Rpb25cIlxuICAgICAgKyBmdW5jdGlvbl9uYW1lICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwcmluY2lwYWwgICAgICAgICAgID0gXCJldmVudHMuYW1hem9uYXdzLmNvbVwiXG4gICAgICArIHNvdXJjZV9hcm4gICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHN0YXRlbWVudF9pZCAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHN0YXRlbWVudF9pZF9wcmVmaXggPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG4gICMgbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS51cGRhdGVfZG5zLmF3c19zM19idWNrZXQubGFtYmRhX3RtcCB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19zM19idWNrZXRcIiBcImxhbWJkYV90bXBcIiB7XG4gICAgICArIGFjY2VsZXJhdGlvbl9zdGF0dXMgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgYWNsICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGJ1Y2tldCAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgYnVja2V0X2RvbWFpbl9uYW1lICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBidWNrZXRfcHJlZml4ICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtYXNnLWxhbWJkYS1cIlxuICAgICAgKyBidWNrZXRfcmVnaW9uYWxfZG9tYWluX25hbWUgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGZvcmNlX2Rlc3Ryb3kgICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICArIGhvc3RlZF96b25lX2lkICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBvYmplY3RfbG9ja19lbmFibGVkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBvbGljeSAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcmVnaW9uICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyByZXF1ZXN0X3BheWVyICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIlxuICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCJcbiAgICAgICAgfVxuICAgICAgKyB3ZWJzaXRlX2RvbWFpbiAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHdlYnNpdGVfZW5kcG9pbnQgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cbiAgIyBtb2R1bGUuanVtcGhvc3QubW9kdWxlLnVwZGF0ZV9kbnMuYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrLnB1YmxpY19hY2Nlc3Mgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2tcIiBcInB1YmxpY19hY2Nlc3NcIiB7XG4gICAgICArIGJsb2NrX3B1YmxpY19hY2xzICAgICAgID0gdHJ1ZVxuICAgICAgKyBibG9ja19wdWJsaWNfcG9saWN5ICAgICA9IHRydWVcbiAgICAgICsgYnVja2V0ICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZ25vcmVfcHVibGljX2FjbHMgICAgICA9IHRydWVcbiAgICAgICsgcmVzdHJpY3RfcHVibGljX2J1Y2tldHMgPSB0cnVlXG4gICAgfVxuXG4gICMgbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS51cGRhdGVfZG5zLmF3c19zM19vYmplY3QubGFtYmRhX3BhY2thZ2Ugd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfczNfb2JqZWN0XCIgXCJsYW1iZGFfcGFja2FnZVwiIHtcbiAgICAgICsgYWNsICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgYnVja2V0ICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgYnVja2V0X2tleV9lbmFibGVkICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgY2hlY2tzdW1fY3JjMzIgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgY2hlY2tzdW1fY3JjMzJjICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgY2hlY2tzdW1fc2hhMSAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgY2hlY2tzdW1fc2hhMjU2ICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgY29udGVudF90eXBlICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZXRhZyAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZm9yY2VfZGVzdHJveSAgICAgICAgICA9IGZhbHNlXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGtleSAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGttc19rZXlfaWQgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHNlcnZlcl9zaWRlX2VuY3J5cHRpb24gPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHNvdXJjZSAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHN0b3JhZ2VfY2xhc3MgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJcbiAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiXG4gICAgICAgIH1cbiAgICAgICsgdmVyc2lvbl9pZCAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cbiAgIyBtb2R1bGUuanVtcGhvc3QubW9kdWxlLnVwZGF0ZV9kbnMubnVsbF9yZXNvdXJjZS5pbnN0YWxsX3B5dGhvbl9kZXBlbmRlbmNpZXMgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJudWxsX3Jlc291cmNlXCIgXCJpbnN0YWxsX3B5dGhvbl9kZXBlbmRlbmNpZXNcIiB7XG4gICAgICArIGlkICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0cmlnZ2VycyA9IHtcbiAgICAgICAgICArIFwiZGVwZW5kZW5jaWVzX3ZlcnNpb25cIiA9IFwiNzE1YTBmNzMxMGFlNGRhYmY5YjcxMDgwMjMzOWRjZDVcIlxuICAgICAgICAgICsgXCJtYWluX3ZlcnNpb25cIiAgICAgICAgID0gXCI1YTM3YmFjYjM2MjgxODRlM2Q1MjcyNmE5MTU2NDE1NVwiXG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBtb2R1bGUuanVtcGhvc3QubW9kdWxlLnVwZGF0ZV9kbnMucmFuZG9tX3V1aWQubGFtZGFfc3JjX2hhc2ggd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJyYW5kb21fdXVpZFwiIFwibGFtZGFfc3JjX2hhc2hcIiB7XG4gICAgICArIGlkICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGtlZXBlcnMgPSB7XG4gICAgICAgICAgKyBcIm1haW4ucHlcIiAgICAgICAgICA9IFwiNWEzN2JhY2IzNjI4MTg0ZTNkNTI3MjZhOTE1NjQxNTVcIlxuICAgICAgICAgICsgXCJyZXF1aXJlbWVudHMudHh0XCIgPSBcIjcxNWEwZjczMTBhZTRkYWJmOWI3MTA4MDIzMzlkY2Q1XCJcbiAgICAgICAgfVxuICAgICAgKyByZXN1bHQgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuUGxhbjogMzcgdG8gYWRkLCAwIHRvIGNoYW5nZSwgMCB0byBkZXN0cm95LlxuXG5cdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcblxuU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW5cblxuVG8gcGVyZm9ybSBleGFjdGx5IHRoZXNlIGFjdGlvbnMsIHJ1biB0aGUgZm9sbG93aW5nIGNvbW1hbmQgdG8gYXBwbHk6XG4gICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiXG46OmRlYnVnOjpUZXJyYWZvcm0gZXhpdGVkIHdpdGggY29kZSAwLlxuOjpkZWJ1Zzo6c3Rkb3V0OiBkYXRhLnRlcnJhZm9ybV9yZW1vdGVfc3RhdGUuY2ljZDogUmVhZGluZy4uLiUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0ucmFuZG9tX3Bhc3N3b3JkLnBhc3NwaHJhc2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPW5vbmVdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5yYW5kb21fcGFzc3dvcmQucGFzc3BocmFzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9bm9uZV0lMEFtb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QubW9kdWxlLnVwZGF0ZV9kbnMuZGF0YS5hd3NfY2FsbGVyX2lkZW50aXR5LmN1cnJlbnQ6IFJlYWRpbmcuLi4lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQucGFzc3BocmFzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3JldDpwYWNrYWdlci1wYXNzcGhyYXNlLWZvY2FsLWd6eFFQcV0lMEFtb2R1bGUuanVtcGhvc3QubW9kdWxlLnVwZGF0ZV9kbnMuZGF0YS5hd3NfaWFtX3BvbGljeS5BV1NMYW1iZGFCYXNpY0V4ZWN1dGlvblJvbGU6IFJlYWRpbmcuLi4lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQucGFzc3BocmFzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3JldDpwYWNrYWdlci1wYXNzcGhyYXNlLWphbW15LXhhNlBUR10lMEFtb2R1bGUuanVtcGhvc3QubW9kdWxlLnVwZGF0ZV9kbnMuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWVfcm9sZTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI4NTExMTk0MjddJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS51cGRhdGVfZG5zLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lX3JvbGU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI2OTAyNTU0NTVdJTBBbW9kdWxlLmluZnJhaG91c2VfY29tLmF3c19yb3V0ZTUzX3pvbmUuaW5mcmFob3VzZV9jb206IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR10lMEFkYXRhLmF3c19hbWkudWJ1bnR1XzIyOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS51cGRhdGVfZG5zLmRhdGEuYXdzX2NhbGxlcl9pZGVudGl0eS5jdXJyZW50OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00OTMzNzA4MjY0MjRdJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS51cGRhdGVfZG5zLmRhdGEuYXdzX3JlZ2lvbi5jdXJyZW50OiBSZWFkaW5nLi4uJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS51cGRhdGVfZG5zLmRhdGEuYXdzX3JlZ2lvbi5jdXJyZW50OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD11cy13ZXN0LTFdJTBBbW9kdWxlLmluZnJhaG91c2UtcHVwcGV0LWRhdGEtZ2l0aHViLmRhdGEuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlYWRpbmcuLi4lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19jbG91ZGZyb250X2Z1bmN0aW9uLmh0dHBfYXV0aDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cmVsZWFzZS1qYW1teV9pbmZyYWhvdXNlX2NvbS1hdXRoXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX2Nsb3VkZnJvbnRfZnVuY3Rpb24uaHR0cF9hdXRoOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yZWxlYXNlLWZvY2FsX2luZnJhaG91c2VfY29tLWF1dGhdJTBBZGF0YS50ZXJyYWZvcm1fcmVtb3RlX3N0YXRlLmNpY2Q6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMlMEFtb2R1bGUubWFuYWdlbWVudC5hd3NfdnBjLnZwYzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dnBjLTA4ZTE5ZDg1OWMyNmQxOGIyXSUwQWRhdGEuYXdzX2FtaS51YnVudHVfMjI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPWFtaS0wNzkxOWE2MjJkYmJhN2RkOV0lMEFtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW46IFJlYWRpbmcuLi4lMEFtb2R1bGUuaW5mcmFob3VzZS1wdXBwZXQtZGF0YS1naXRodWIuZGF0YS5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YXJuOmF3czppYW06OjQ5MzM3MDgyNjQyNDpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD04MzczMTkwNF0lMEFtb2R1bGUucHVwcGV0LWNvZGUtZ2l0aHViLmRhdGEuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfY2FsbGVyX2lkZW50aXR5LmN1cnJlbnQ6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfY2FsbGVyX2lkZW50aXR5LmN1cnJlbnQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQ5MzM3MDgyNjQyNF0lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5qdW1waG9zdF9wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lmp1bXBob3N0X3Blcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMjE4MzE1NDAyXSUwQW1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xNTg1MzQ2ODMyXSUwQW1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfdXNlcmRhdGEuZGF0YS5hd3NfcmVnaW9uLmN1cnJlbnQ6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3VzZXJkYXRhLmRhdGEuYXdzX3JlZ2lvbi5jdXJyZW50OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD11cy13ZXN0LTFdJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2FtaS51YnVudHU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfcmVnaW9uLmN1cnJlbnQ6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfcmVnaW9uLmN1cnJlbnQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXVzLXdlc3QtMV0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19jbG91ZGZyb250X2NhY2hlX3BvbGljeS5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1iMDRhZmY0NS00OGUxLTQ1MDEtOTBkMy05OThjOWZhMWYyNjRdJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2FtaS51YnVudHU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFtaS0wNzkxOWE2MjJkYmJhN2RkOV0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmF3c19jbG91ZGZyb250X2NhY2hlX3BvbGljeS5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD01ZGI0OTRkZC01NDZiLTQyMzEtYTBjNy0xMzNiMjQ1YWRhNDldJTBBbW9kdWxlLnB1cHBldC1jb2RlLWdpdGh1Yi5kYXRhLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0Om9pZGMtcHJvdmlkZXIvdG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb21dJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfczNfYnVja2V0LnJlcG8tbG9nczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWphbW15LWxvZ3NdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfczNfYnVja2V0LnJlcG8tbG9nczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWZvY2FsLWxvZ3NdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfczNfYnVja2V0LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZS1qYW1teV0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmF3c19zM19idWNrZXQucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWZvY2FsXSUwQWF3c19rZXlfcGFpci5hbGVrczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YWxla3NdJTBBZGF0YS5hd3NfYXZhaWxhYmlsaXR5X3pvbmVzLnV3MTogUmVhZGluZy4uLiUwQW1vZHVsZS5naXRodWItY29ubmVjdG9yLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0Om9pZGMtcHJvdmlkZXIvdG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb21dJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmtleTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3JldDpwYWNrYWdlci1rZXktZm9jYWwtWHJUV3JQXSUwQWRhdGEuYXdzX2F2YWlsYWJpbGl0eV96b25lcy51dzE6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXVzLXdlc3QtMV0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQua2V5OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6c2VjcmV0OnBhY2thZ2VyLWtleS1qYW1teS1YclRXclBdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24ucGFzc3BocmFzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3JldDpwYWNrYWdlci1wYXNzcGhyYXNlLWZvY2FsLWd6eFFQcXw2NTg2RUIxMy03OUMyLTQyNEQtQUZFRC02ODEwRTYxMTU2RDddJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24ucGFzc3BocmFzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3JldDpwYWNrYWdlci1wYXNzcGhyYXNlLWphbW15LXhhNlBUR3xENkFCQ0IyQi1GODUwLTQ0ODctQTc2NC0wNzI2MzczNjMyM0VdJTBBZGF0YS5hd3Nfcm91dGU1M196b25lLmNpY2QtaWgtY29tOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmluZnJhaG91c2UtcHVwcGV0LWRhdGEtZ2l0aHViLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXRydXN0OiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5hd3NfaWFtX3BvbGljeS5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1naXRodWJdJTBBbW9kdWxlLmluZnJhaG91c2UtcHVwcGV0LWRhdGEtZ2l0aHViLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXRydXN0OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yOTAzNTEzODBdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfYWNtX2NlcnRpZmljYXRlLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6YWNtOnVzLWVhc3QtMTo0OTMzNzA4MjY0MjQ6Y2VydGlmaWNhdGUvNDAyODUyZTEtNzA1NC00Y2VhLTgwYWMtM2NjYmVlNzJhMzk4XSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX2FjbV9jZXJ0aWZpY2F0ZS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmFjbTp1cy1lYXN0LTE6NDkzMzcwODI2NDI0OmNlcnRpZmljYXRlLzJlZWQ1M2QzLWUxYWQtNDc0My1hY2U1LTg5YzE5M2NkM2M2NV0lMEFtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWFkbWluLmF3c19pYW1fcG9saWN5LmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjQ5MzM3MDgyNjQyNDpwb2xpY3kvaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWdpdGh1Yl0lMEFtb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3VzZXJkYXRhLmRhdGEuY2xvdWRpbml0X2NvbmZpZy5jb25maWc6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3VzZXJkYXRhLmRhdGEuY2xvdWRpbml0X2NvbmZpZy5jb25maWc6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQxMDQ3ODgxMTVdJTBBbW9kdWxlLmluZnJhaG91c2VfY29tLmF3c19yb3V0ZTUzX3JlY29yZC50eHRfc3BmOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfaW5mcmFob3VzZS5jb21fVFhUXSUwQW1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M19yZWNvcmQuc3BmOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfaW5mcmFob3VzZS5jb21fU1BGXSUwQW1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M19yZWNvcmQubXg6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19pbmZyYWhvdXNlLmNvbV9NWF0lMEFkYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDJzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXSUwQW1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M19yZWNvcmQudHh0X2RraW06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19nb29nbGUuX2RvbWFpbmtleS5pbmZyYWhvdXNlLmNvbV9UWFRdJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS51cGRhdGVfZG5zLmRhdGEuYXdzX2lhbV9wb2xpY3kuQVdTTGFtYmRhQmFzaWNFeGVjdXRpb25Sb2xlOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDJzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9zZXJ2aWNlLXJvbGUvQVdTTGFtYmRhQmFzaWNFeGVjdXRpb25Sb2xlXSUwQW1vZHVsZS5wdXBwZXQtY29kZS1naXRodWIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItdHJ1c3Q6IFJlYWRpbmcuLi4lMEFtb2R1bGUucHVwcGV0LWNvZGUtZ2l0aHViLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXRydXN0OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yNDIzNTIwNzkzXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19kZWZhdWx0X3NlY3VyaXR5X2dyb3VwLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnLTA4Yjk2MGI4NWY1OTk2MTAwXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19pbnRlcm5ldF9nYXRld2F5LmlnOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pZ3ctMDc5MDkwZTA5ZWQ1ZGI1ODJdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX2RlZmF1bHRfcm91dGVfdGFibGUuZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiLTBkNzMzODNhZmViNmFkMTQyXSUwQW1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbjogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc10lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19zM19idWNrZXRfb3duZXJzaGlwX2NvbnRyb2xzLnJlcG8tbG9nczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWphbW15LWxvZ3NdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfczNfYnVja2V0X293bmVyc2hpcF9jb250cm9scy5yZXBvLWxvZ3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZS1mb2NhbC1sb2dzXSUwQWRhdGEuYXdzX3JvdXRlNTNfem9uZS5jaWNkLWloLWNvbTogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9WjA2NzkwMDgyT1UwUE9QV09DUFo0XSUwQW1vZHVsZS5pbmZyYWhvdXNlLXB1cHBldC1kYXRhLWdpdGh1Yi5hd3NfaWFtX3JvbGUuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1pbmZyYWhvdXNlLXB1cHBldC1kYXRhLWdpdGh1Yl0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW46IFJlYWQgY29tcGxldGUgYWZ0ZXIgMnMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfczNfYnVja2V0X3dlYnNpdGVfY29uZmlndXJhdGlvbi5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtamFtbXldJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfczNfYnVja2V0X3dlYnNpdGVfY29uZmlndXJhdGlvbi5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtZm9jYWxdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB1YmxpYy1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHVibGljLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDE4NDE3MTcyOF0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHVibGljLWFjY2VzczogUmVhZGluZy4uLiUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wdWJsaWMtYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xNjkzNDczOTQ2XSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX3MzX2J1Y2tldF9vd25lcnNoaXBfY29udHJvbHMucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWphbW15XSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX3MzX2J1Y2tldF9vd25lcnNoaXBfY29udHJvbHMucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWZvY2FsXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX3MzX29iamVjdC5kaXN0cmlidXRpb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1jb25mL2Rpc3RyaWJ1dGlvbnNdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfczNfb2JqZWN0LmRpc3RyaWJ1dGlvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWNvbmYvZGlzdHJpYnV0aW9uc10lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtamFtbXldJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2sucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWZvY2FsXSUwQW1vZHVsZS5wdXBwZXQtY29kZS1naXRodWIuYXdzX2lhbV9yb2xlLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtcHVwcGV0LWNvZGUtZ2l0aHViXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZS5hbGxbXCIxMC4wLjAuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiLTA0YTE2ZTc0ZDViMTJhMzM4XSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZS5hbGxbXCIxMC4wLjEuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiLTA2N2MzMGU2NWRkNDEwOGU5XSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19zdWJuZXQuYWxsW1wiMTAuMC4wLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN1Ym5ldC0wZGY4ODVkY2M5OTQxODc5OV0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuMS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdWJuZXQtMGY5MWRkMjY3NWU3YTE2YzNdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zNTkyMjA1NzcyXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaW5mcmFob3VzZS1jb20tZ2l0aHViLWFzc3VtZTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaW5mcmFob3VzZS1jb20tZ2l0aHViLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTc1NDIxNDE2NF0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZS5kZWZhdWx0WzBdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZ3ItMDYxNDAwNTNhYmM2MmExMTldJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9lZ3Jlc3NfcnVsZS5kZWZhdWx0WzBdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZ3ItMGUxZWVhNGNlNWI3OTgwNDZdJTBBYXdzX3JvdXRlNTNfcmVjb3JkLmNpLWNkLW5zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfY2ktY2QuaW5mcmFob3VzZS5jb21fTlNdJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX3JvdXRlNTNfem9uZS5qdW1waG9zdF96b25lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3Nfcm91dGU1M19yZWNvcmQuY2VydF92YWxpZGF0aW9uW1wicmVsZWFzZS1qYW1teS5pbmZyYWhvdXNlLmNvbVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX18wNDdhZTI5OTI1ZWMwMjk3ZWFlYmZlZGRjODg2ZjIzNC5yZWxlYXNlLWphbW15LmluZnJhaG91c2UuY29tLl9DTkFNRV0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmF3c19yb3V0ZTUzX3JlY29yZC5jZXJ0X3ZhbGlkYXRpb25bXCJyZWxlYXNlLWZvY2FsLmluZnJhaG91c2UuY29tXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfXzg3ZjJlYWQzYWJmNjgxMzRjNDk3YmY1MjcxOGUwN2IxLnJlbGVhc2UtZm9jYWwuaW5mcmFob3VzZS5jb20uX0NOQU1FXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX3MzX2J1Y2tldF9hY2wucmVwby1sb2dzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtamFtbXktbG9ncyxwcml2YXRlXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX3MzX2J1Y2tldF9hY2wucmVwby1sb2dzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtZm9jYWwtbG9ncyxwcml2YXRlXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZS5kZWZhdWx0X21haW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTBkNzMzODNhZmViNmFkMTQyMTA4MDI4OTQ5NF0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3NfZWlwLm5hdF9laXBbXCIxMC4wLjAuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ZWlwYWxsb2MtMDJiNDJlNzBkNTJhNWRiN2ZdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzkxMTg0NDg2OF0lMEFtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLWFzc3VtZTogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD03MDk4NDEzOTFdJTBBYXdzX2lhbV9yb2xlLmluZnJhaG91c2UtdG9vbGtpdC1naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtdG9vbGtpdC1naXRodWJdJTBBYXdzX2lhbV9yb2xlLmluZnJhaG91c2UtY29tLWdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1jb20tZ2l0aHViXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX3MzX2J1Y2tldF9hY2wucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWphbW15LHB1YmxpYy1yZWFkXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX3MzX2J1Y2tldF9hY2wucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWZvY2FsLHB1YmxpYy1yZWFkXSUwQW1vZHVsZS5qdW1waG9zdC5tb2R1bGUudXBkYXRlX2Rucy5kYXRhLmF3c19yb3V0ZTUzX3pvbmUuYXNnX3pvbmU6IFJlYWRpbmcuLi4lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGUuc3VibmV0X3B1YmxpY1tcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wNGExNmU3NGQ1YjEyYTMzODEwODAyODk0OTRdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5hd3NfaWFtX3JvbGUuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtZ2l0aHViXSUwQW1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtYWRtaW4uYXdzX2lhbV9yb2xlLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWdpdGh1Yl0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb24ucHJpdmF0ZV9ydF9hc3NvY1tcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGJhc3NvYy0wOGE0MTAxNjBlMmRjYzU5Ml0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb24ucHJpdmF0ZV9ydF9hc3NvY1tcIjEwLjAuMS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGJhc3NvYy0wOTliOTU4YWYxOTQ4NWYyYl0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3NfbmF0X2dhdGV3YXkubmF0X2d3W1wiMTAuMC4wLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPW5hdC0wOGZiOWI1MjY4MzI3Nzk0N10lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmF3c19zM19idWNrZXRfcG9saWN5LnB1YmxpYy1hY2Nlc3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZS1mb2NhbF0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19zM19idWNrZXRfcG9saWN5LnB1YmxpYy1hY2Nlc3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZS1qYW1teV0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19zM19vYmplY3QuaW5kZXgtaHRtbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5kZXguaHRtbF0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmF3c19zM19vYmplY3QuaW5kZXgtaHRtbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5kZXguaHRtbF0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19zM19vYmplY3QuZGViLWdwZy1wdWJsaWMta2V5OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ERUItR1BHLUtFWS1yZWxlYXNlLWphbW15LmluZnJhaG91c2UuY29tXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX3MzX29iamVjdC5kZWItZ3BnLXB1YmxpYy1rZXk6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPURFQi1HUEctS0VZLXJlbGVhc2UtZm9jYWwuaW5mcmFob3VzZS5jb21dJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX3N1Ym5ldC5zZWxlY3RlZDogUmVhZGluZy4uLiUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZS5zdWJuZXRfcHJpdmF0ZVtcIjEwLjAuMS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wNjdjMzBlNjVkZDQxMDhlOTEwODAyODk0OTRdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfYWNtX2NlcnRpZmljYXRlX3ZhbGlkYXRpb24ucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9MjAyMy0wNy0yNCAxODo1MTozOS40NDIgKzAwMDAgVVRDXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX2FjbV9jZXJ0aWZpY2F0ZV92YWxpZGF0aW9uLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTIwMjMtMDctMjQgMTg6NTE6MzkuMDUxICswMDAwIFVUQ10lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3Nfc3VibmV0LnNlbGVjdGVkOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1zdWJuZXQtMGRmODg1ZGNjOTk0MTg3OTldJTBBbW9kdWxlLmloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtZ2l0aHViLTIwMjMwODE4MDM0MTUwOTkzNDAwMDAwMDAxXSUwQW1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hZG1pbi1hc3N1bWU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yNzE0MjYwMzc2XSUwQW1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtYWRtaW4uYXdzX2lhbV9yb2xlLmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtYWRtaW5dJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX3JvdXRlNTNfem9uZS5qdW1waG9zdF96b25lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0ddJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS51cGRhdGVfZG5zLmRhdGEuYXdzX3JvdXRlNTNfem9uZS5hc2dfem9uZTogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWdpdGh1Yi0yMDIzMDgxNzAxMDgxODI1ODIwMDAwMDAwMV0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tYXNzdW1lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9Mjg5OTYyOTk1Ml0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmF3c19pYW1fcm9sZS5hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX2Nsb3VkZnJvbnRfZGlzdHJpYnV0aW9uLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPUUxSUlMV0lZME9VNzhCXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX2Nsb3VkZnJvbnRfZGlzdHJpYnV0aW9uLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPUUxNjFRR0NQRTNKSU9LXSUwQW1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtYWRtaW4uYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtYWRtaW4tMjAyMzA4MTgwMzQxNTg5ODUxMDAwMDAwMDJdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi0yMDIzMDcwOTE2NDMyMTMxOTkwMDAwMDAwMV0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19yb3V0ZTUzX3JlY29yZC5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfcmVsZWFzZS1qYW1teS5pbmZyYWhvdXNlLmNvbV9BXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX3JvdXRlNTNfcmVjb3JkLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19yZWxlYXNlLWZvY2FsLmluZnJhaG91c2UuY29tX0FdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wYWNrYWdlLXB1Ymxpc2hlcjogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGFja2FnZS1wdWJsaXNoZXI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQwNTAwMDYwMzddJTBBYXdzX2lhbV9wb2xpY3kucGFja2FnZS1wdWJsaXNoZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cG9saWN5L3BhY2thZ2UtcHVibGlzaGVyXSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5pbmZyYWhvdXNlLXB1cHBldC1kYXRhLWdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtaW5mcmFob3VzZS1wdXBwZXQtZGF0YS1naXRodWItMjAyMzExMDgxMzMyMDAxNzU0MDAwMDAwMDFdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmluZnJhaG91c2UtY29tLWdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1jb20tZ2l0aHViLTIwMjMwODE5MjE0MTM5NzU2MzAwMDAwMDAxXSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5wdXBwZXQtY29kZS1naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLXB1cHBldC1jb2RlLWdpdGh1Yi0yMDIzMTEwODEzMjI0ODU4MzEwMDAwMDAwMV0lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuaW5mcmFob3VzZS10b29sa2l0LWdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10b29sa2l0LWdpdGh1Yi0yMDIzMDcyODIxMTY0MjgzNjIwMDAwMDAwMV0lMEElMEFUZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uJTBBcGxhbi4gUmVzb3VyY2UgYWN0aW9ucyBhcmUgaW5kaWNhdGVkIHdpdGggdGhlIGZvbGxvd2luZyBzeW1ib2xzOiUwQSAgKyBjcmVhdGUlMEEgPD0gcmVhZCAoZGF0YSByZXNvdXJjZXMpJTBBJTBBVGVycmFmb3JtIHdpbGwgcGVyZm9ybSB0aGUgZm9sbG93aW5nIGFjdGlvbnM6JTBBJTBBICAjIG1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJlcXVpcmVkX3Blcm1pc3Npb25zIHdpbGwgYmUgcmVhZCBkdXJpbmcgYXBwbHklMEEgICMgKGNvbmZpZyByZWZlcnMgdG8gdmFsdWVzIG5vdCB5ZXQga25vd24pJTBBIDw9IGRhdGEgXCJhd3NfaWFtX3BvbGljeV9kb2N1bWVudFwiIFwicmVxdWlyZWRfcGVybWlzc2lvbnNcIiB7JTBBICAgICAgKyBpZCAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsganNvbiA9IChrbm93biBhZnRlciBhcHBseSklMEElMEEgICAgICArIHN0YXRlbWVudCB7JTBBICAgICAgICAgICsgYWN0aW9ucyAgID0gWyUwQSAgICAgICAgICAgICAgKyBcImF1dG9zY2FsaW5nOkRlc2NyaWJlQXV0b1NjYWxpbmdJbnN0YW5jZXNcIiwlMEEgICAgICAgICAgICBdJTBBICAgICAgICAgICsgcmVzb3VyY2VzID0gWyUwQSAgICAgICAgICAgICAgKyAoa25vd24gYWZ0ZXIgYXBwbHkpLCUwQSAgICAgICAgICAgIF0lMEEgICAgICAgIH0lMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuanVtcGhvc3QuYXdzX2F1dG9zY2FsaW5nX2dyb3VwLmp1bXBob3N0IHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19hdXRvc2NhbGluZ19ncm91cFwiIFwianVtcGhvc3RcIiB7JTBBICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGF2YWlsYWJpbGl0eV96b25lcyAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZGVmYXVsdF9jb29sZG93biAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBkZXNpcmVkX2NhcGFjaXR5ICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGZvcmNlX2RlbGV0ZSAgICAgICAgICAgICAgICAgICAgID0gZmFsc2UlMEEgICAgICArIGZvcmNlX2RlbGV0ZV93YXJtX3Bvb2wgICAgICAgICAgID0gZmFsc2UlMEEgICAgICArIGhlYWx0aF9jaGVja19ncmFjZV9wZXJpb2QgICAgICAgID0gMzAwJTBBICAgICAgKyBoZWFsdGhfY2hlY2tfdHlwZSAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaWdub3JlX2ZhaWxlZF9zY2FsaW5nX2FjdGl2aXRpZXMgPSBmYWxzZSUwQSAgICAgICsgbG9hZF9iYWxhbmNlcnMgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBtYXhfaW5zdGFuY2VfbGlmZXRpbWUgICAgICAgICAgICA9IDc3NzYwMDAlMEEgICAgICArIG1heF9zaXplICAgICAgICAgICAgICAgICAgICAgICAgID0gMyUwQSAgICAgICsgbWV0cmljc19ncmFudWxhcml0eSAgICAgICAgICAgICAgPSBcIjFNaW51dGVcIiUwQSAgICAgICsgbWluX3NpemUgICAgICAgICAgICAgICAgICAgICAgICAgPSAxJTBBICAgICAgKyBuYW1lICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hbWVfcHJlZml4ICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcHJlZGljdGVkX2NhcGFjaXR5ICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwcm90ZWN0X2Zyb21fc2NhbGVfaW4gICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgKyBzZXJ2aWNlX2xpbmtlZF9yb2xlX2FybiAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHRhcmdldF9ncm91cF9hcm5zICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdnBjX3pvbmVfaWRlbnRpZmllciAgICAgICAgICAgICAgPSBbJTBBICAgICAgICAgICsgXCJzdWJuZXQtMGRmODg1ZGNjOTk0MTg3OTlcIiwlMEEgICAgICAgIF0lMEEgICAgICArIHdhaXRfZm9yX2NhcGFjaXR5X3RpbWVvdXQgICAgICAgID0gXCIxMG1cIiUwQSAgICAgICsgd2FybV9wb29sX3NpemUgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBJTBBICAgICAgKyBpbnN0YW5jZV9yZWZyZXNoIHslMEEgICAgICAgICAgKyBzdHJhdGVneSA9IFwiUm9sbGluZ1wiJTBBJTBBICAgICAgICAgICsgcHJlZmVyZW5jZXMgeyUwQSAgICAgICAgICAgICAgKyBtYXhfaGVhbHRoeV9wZXJjZW50YWdlICAgICAgID0gMTAwJTBBICAgICAgICAgICAgICArIG1pbl9oZWFsdGh5X3BlcmNlbnRhZ2UgICAgICAgPSAxMDAlMEEgICAgICAgICAgICAgICsgc2NhbGVfaW5fcHJvdGVjdGVkX2luc3RhbmNlcyA9IFwiSWdub3JlXCIlMEEgICAgICAgICAgICAgICsgc2tpcF9tYXRjaGluZyAgICAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgICAgICAgICArIHN0YW5kYnlfaW5zdGFuY2VzICAgICAgICAgICAgPSBcIklnbm9yZVwiJTBBICAgICAgICAgICAgfSUwQSAgICAgICAgfSUwQSUwQSAgICAgICsgbGF1bmNoX3RlbXBsYXRlIHslMEEgICAgICAgICAgKyBpZCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICAgICArIG5hbWUgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICAgICsgdmVyc2lvbiA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAgIH0lMEElMEEgICAgICArIHRhZyB7JTBBICAgICAgICAgICsga2V5ICAgICAgICAgICAgICAgICA9IFwiTmFtZVwiJTBBICAgICAgICAgICsgcHJvcGFnYXRlX2F0X2xhdW5jaCA9IHRydWUlMEEgICAgICAgICAgKyB2YWx1ZSAgICAgICAgICAgICAgID0gXCJqdW1waG9zdFwiJTBBICAgICAgICB9JTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmp1bXBob3N0LmF3c19hdXRvc2NhbGluZ19saWZlY3ljbGVfaG9vay5sYXVuY2hpbmcgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2F1dG9zY2FsaW5nX2xpZmVjeWNsZV9ob29rXCIgXCJsYXVuY2hpbmdcIiB7JTBBICAgICAgKyBhdXRvc2NhbGluZ19ncm91cF9uYW1lID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZGVmYXVsdF9yZXN1bHQgICAgICAgICA9IFwiQUJBTkRPTlwiJTBBICAgICAgKyBoZWFydGJlYXRfdGltZW91dCAgICAgID0gMzAwJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbGlmZWN5Y2xlX3RyYW5zaXRpb24gICA9IFwiYXV0b3NjYWxpbmc6RUMyX0lOU1RBTkNFX0xBVU5DSElOR1wiJTBBICAgICAgKyBuYW1lICAgICAgICAgICAgICAgICAgID0gXCJsYXVuY2hpbmdcIiUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5qdW1waG9zdC5hd3NfYXV0b3NjYWxpbmdfbGlmZWN5Y2xlX2hvb2sudGVybWluYXRpbmcgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2F1dG9zY2FsaW5nX2xpZmVjeWNsZV9ob29rXCIgXCJ0ZXJtaW5hdGluZ1wiIHslMEEgICAgICArIGF1dG9zY2FsaW5nX2dyb3VwX25hbWUgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBkZWZhdWx0X3Jlc3VsdCAgICAgICAgID0gXCJBQkFORE9OXCIlMEEgICAgICArIGhlYXJ0YmVhdF90aW1lb3V0ICAgICAgPSAzMDAlMEEgICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBsaWZlY3ljbGVfdHJhbnNpdGlvbiAgID0gXCJhdXRvc2NhbGluZzpFQzJfSU5TVEFOQ0VfVEVSTUlOQVRJTkdcIiUwQSAgICAgICsgbmFtZSAgICAgICAgICAgICAgICAgICA9IFwidGVybWluYXRpbmdcIiUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5qdW1waG9zdC5hd3NfaWFtX3BvbGljeS5yZXF1aXJlZCB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwicmVxdWlyZWRcIiB7JTBBICAgICAgKyBhcm4gICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZSAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lX3ByZWZpeCA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBhdGggICAgICAgID0gXCIvXCIlMEEgICAgICArIHBvbGljeSAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcG9saWN5X2lkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzX2FsbCAgICA9IHslMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCIlMEEgICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIiUwQSAgICAgICAgfSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5qdW1waG9zdC5hd3NfbGF1bmNoX3RlbXBsYXRlLmp1bXBob3N0IHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19sYXVuY2hfdGVtcGxhdGVcIiBcImp1bXBob3N0XCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGRlZmF1bHRfdmVyc2lvbiAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaW1hZ2VfaWQgICAgICAgICAgICAgICA9IFwiYW1pLTA3OTE5YTYyMmRiYmE3ZGQ5XCIlMEEgICAgICArIGluc3RhbmNlX3R5cGUgICAgICAgICAgPSBcInQzYS5taWNyb1wiJTBBICAgICAgKyBrZXlfbmFtZSAgICAgICAgICAgICAgID0gXCJhbGVrc1wiJTBBICAgICAgKyBsYXRlc3RfdmVyc2lvbiAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZSAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hbWVfcHJlZml4ICAgICAgICAgICAgPSBcImp1bXBob3N0LVwiJTBBICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIiUwQSAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiJTBBICAgICAgICB9JTBBICAgICAgKyB1c2VyX2RhdGEgICAgICAgICAgICAgID0gXCJRMjl1ZEdWdWRDMVVlWEJsT2lCdGRXeDBhWEJoY25RdmJXbDRaV1E3SUdKdmRXNWtZWEo1UFNKTlNVMUZRazlWVGtSQlVsa2lDazFKVFVVdFZtVnljMmx2YmpvZ01TNHdEUW9OQ2kwdFRVbE5SVUpQVlU1RVFWSlpEUXBEYjI1MFpXNTBMVlJ5WVc1elptVnlMVVZ1WTI5a2FXNW5PaUEzWW1sMERRcERiMjUwWlc1MExWUjVjR1U2SUhSbGVIUXZZMnh2ZFdRdFkyOXVabWxuRFFwTmFXMWxMVlpsY25OcGIyNDZJREV1TUEwS0RRb2pZMnh2ZFdRdFkyOXVabWxuQ2lKaGNIUWlPZ29nSUNKemIzVnlZMlZ6SWpvS0lDQWdJQ0pwYm1aeVlXaHZkWE5sSWpvS0lDQWdJQ0FnSW10bGVTSTZJSHdLSUNBZ0lDQWdJQ0F0TFMwdExVSkZSMGxPSUZCSFVDQlFWVUpNU1VNZ1MwVlpJRUpNVDBOTExTMHRMUzBLQ2lBZ0lDQWdJQ0FnYlZGSlRrSkhVemRHZEd0Q1JVRkVSaXRaYlVSbk5sRjJjM1kxVmpaYVVYY3JVV2g0WkZSMmFrMVlaVXhET1ZRMlVrWlNWa1E1TkRkeFMzcDBUazVSYmdvZ0lDQWdJQ0FnSUN0QkwzbDRjSEpNUVcxWE1qVlZkUzh4TVc5RGMzcE9Wa2xKWVZJelQxazRUWFI1YVd4aVEzUjZWV3RDZW5aWFpHeFlNMGgyVkhjNU1VeHdPR0o0VlV3S0lDQWdJQ0FnSUNCRldFOU5PVzV6WTNGUGNrOTJaa0pxWVc1d2JFdEVSVXRRVFZrMmRrbGFNMnR3TVhKVmMwTk9SMHhDVERCNE1rdGFaMVU0TUhWc1VuTk5UVGh4YmtKT0NpQWdJQ0FnSUNBZ2EzQlVhVUZsV0V0UFJWWjBVbnBzVjJ4MlQwWk1TamR3V1VSMllWb3dWV2RJVTFaMVJTdGFhMnhrY1U5a1RFeFNjRXRyWkVsMlNsQmphMWh4VERWNFZBb2dJQ0FnSUNBZ0lGVjJWMVJYTVdWdVJrRklaRFVyVGxGNFRXNURZVE5wYTJwUlZqTkVWR3hGYW5OblRFeFJZbUo1YzFocVdGQnlObEJKVUhNeU9XTlVZMlp2Y1RRek1VOEtJQ0FnSUNBZ0lDQjBValJFY2xwQ05IWk5SVTlCT0RoVWJVdENhMFZwVFVjcmFVSTVZMnA2TlhkQ1NYVk5kVGsxV20xdlNuaGtkbXBRVWpjeVJsbExaM0pEV0U1MFRtaGtDaUFnSUNBZ0lDQWdWbVZ5UlZKMmNFeFVhR1JoVW0xYVoyazNiSGtyUkhacldUZE1jWGxLVUhaa1NHTnhlR1ZrWjBadVVFdFNORlFyWjFOUmJXSlZVR1E1Y1hGa1NsSXdVUW9nSUNBZ0lDQWdJRXRzTDFCdGRIVlRMM2M1WjNreVdqUmhlVEJSU1V0eVRrSjZVWGhvUVRoTVJGcHdjREZ5ZFdaRFNqVXJXazFsWmprd2RraHdkM2hOSzA5aFVISjVUbXdLSUNBZ0lDQWdJQ0JGWkVSWE4xbFJPR1oxUWpWdVVIRnFkMVZCY0cxc1dWbE1TbGxzWkRkMlNqYzVSVWw0TDNOcVoyZzJSeXRKUm1sdE4zaFNOMWRwVVVZdmJrcGxkbVp4Q2lBZ0lDQWdJQ0FnZG5wWlR6ZHZjaTlIU1VOaU5tVmFkM1pRWkhSNU56bEliVlpsVUhGRlZHeEVWVEF3YjNsdmNGZDVWSE5aZVZOWlJGTkliaTgwWkc5VWRYZzRkaXRHTHdvZ0lDQWdJQ0FnSUZsbGVXSjJaM0ZpY21sSU4ybFRSamhJZUhkRlJtVkVhbkpOZEZWVVNITllRek0xUkVoR1pVMURhRXB2ZUhONVMzWTBPRW9yWWtsSFJuZEJVa0ZSUVVJS0lDQWdJQ0FnSUNCMFF6RktZbTFhZVZsVmFIWmtXRTVzU1VaQ2FGa3lkR2hhTWxaNVNVUjRkMWxYVG5KWlYyUnNZMnRDY0dKdFdubFpWMmgyWkZoT2JFeHRUblppVkRaS0NpQWdJQ0FnSUNBZ1FXeFJSVVYzUlV0QlJEUlhTVkZUYVU1b05XdFpNM2M0VnpCblFVWTRXR2QxU21GdmVHWmpSRGQzVlVOYVRITlhNbEZKWWtGM1ZVcEJPRXB1UVVGVlRBb2dJQ0FnSUNBZ0lFTlJaMGhCWjFsV1EyZHJTVU4zU1VWR1owbEVRVkZKWlVGUlNWaG5RVUZMUTFKRVozVktZVzk0Wm1ORU4zZGlOMFF2T1dWdVluUlBNVVJGVVc0eFVIUUtJQ0FnSUNBZ0lDQm9aMnQwU0N0SmNtSkNaRmxTU0dzM01XbHNNbWhpYm0xQlltOU1hMnN4WVdzdllXRlJXUzlZVVVSS1JtaHlRVGRxVFd0UVRFOURVbVZ2ZEVocFVXMTJDaUFnSUNBZ0lDQWdNVlZtY1VSalRUSmxVVFF2ZURCT09VWXlSRXhWVTJ0MWQzY3hNVGQyZEhSVmIwSjRhWEpDTnpKd1R6QlVMMnhrT1c4ek9WTklUVU12Ukdack5uazJhQW9nSUNBZ0lDQWdJSFJVUjNGNFRHZG9PR296UkZONVR6VkZSWEpLVEdFdk0wSjJUWEZ5TkdseFlqTlFWSGRPWlVSU1JXcGhkbEZLYUZoVGRrVkdhbmxCUTI5dk9XUTNjbk1LSUNBZ0lDQWdJQ0EzYkdoRFltSlRVR3BuVkdOSEwxQkRabnBNY2pNM1VYbDZXR2xVVWk5VWQycHBkMVprVkdoa1ExTXZRMHR1YzI5Tk9HNW5TSGhxV0Zsd1N6ZE5ObmRuQ2lBZ0lDQWdJQ0FnZEhwQk9FcHJTRnB5TlUxd2EzSlFSM0puVVdWMmFFcENUR3RJVWk5cVkzTmhZVUphVGpkdWR6aGhaVWhqZDNkTk5DOURhRWhKZVZwa1VUa3hNRFU1Y0FvZ0lDQWdJQ0FnSUU5TllWbHRWMjFxVUZGbWNURnlUMjVCUVhaQk1YaFhkeXRVV2s1NlNHZFhTWEUwZG5WemVEZFBRblp5Um5OV1pWcE9jM0ZrTjA5aE5IQnlkRlpYWnpBS0lDQWdJQ0FnSUNBNU1XTkxXa3B2TDA5Mk5tOXdUUzkzUkZkT01ubENibXR0UWtOM1lWaHdiMGcxVGtSUk1qSmlhRzVIVkVwbFNWZGtaV2s0VlZOSGNIWkNhMVI0UWtreUNpQWdJQ0FnSUNBZ1dETXljSGxQYlZwRWJqZ3hUREo2VFRKcGIwNTJaMWhKWWpWMU5YUnFZamxPVDJsQmREWnZWekJITUhnd01HUm5jak55Tm5CMU9IRnRUWGRyUWxaQ1F3b2dJQ0FnSUNBZ0lIWlhkMFZ0WVhoUmJtdFVhRzVpUVdRMU4xWmlZWFEwTHk5MVJHTklSbkJFWVVKUWNFWlhaVU5NTW1SbVJGTnlVemxwYVVzMlN6RldhM1pIVEc5WWFEZ0tJQ0FnSUNBZ0lDQk5jRXB4YW05a1pIQm1UbWcwZFhsbWVrdDVUa1V4WkhKUk1qbHRZM2RtU1d4NldHOVFjbUl3T1ZjMldraHdiU3QwY1dRNFRXczNNRGQ2ZDNOa1JrZFNDaUFnSUNBZ0lDQWdjVkp6ZUcxMFVHNDVTakZ5WlZsYWFWWjFSVFZITWpabU1XRkxWRkkzYTBORVVWSnJkWGhpV2tGU1FVRTBLemxyYmpSemJVSllXbU5OTUhaR2NUbFNPQW9nSUNBZ0lDQWdJREkwV0V0YWRGUmhWbTFXYjFaS1RWSlJUVFEwY1ZkU0szTXZVekJOZW5aaVR6VjFNR05UVmxSb1dUWTFXWHBOVEhNNU1qQlZXVFoxUjNCdlV6SmFXWGNLSUNBZ0lDQWdJQ0JKVFdsd2EyRkNLekpHTmtJNFVqZFdOMjVzTDFObllWaEhZVEpOWlhoclF6ZDNkRFppYkVaaVlYYzNjR0oyU1N0cFNUbDNVemhDUzBoblRVUjZaREJHQ2lBZ0lDQWdJQ0FnVkdwVGNUbDJaR3RXYTJZM2VVa3phRVYzYkd4WU4zcFVOa2xNVDNacmJrNUhZbTl6TUdSR1NUa3lZMEpYVVhNcmFWaFFOVEI0UkZacGRETXJPVzFEUkFvZ0lDQWdJQ0FnSUhKMVYxWlphemN6YlhaVFJYcEdZM1ZZUTNsaVMwbzFWUzl1ZWxOUk56QktiMUZ0VTFCak5UQlNVV3AxU0Vka2Vtd3ZXWHBIUm1GR2JqVjZTVm8xY0ZBS0lDQWdJQ0FnSUNCck5WTXJTMVJaWld0NlkybFNhMGg2WW1WaE5WQnFLMEUyUzFwcGJFdHFOWGxyUVZKR2VuY3JRMUI0Y1hOMVpXcEVhMmszUVN0aE0yMHpWMGR4SzIxdENpQWdJQ0FnSUNBZ1FXdHNVVFJaUW1OdmJIcE9UM0JuVjJOc1NWTjFSVE5rTld0bmRHRktRVU5KWjNSbE9EZEdObEZDUW5Ock9HOUVRa1pSUTI1YWJXOVBhWEpzVTJ4aVpnb2dJQ0FnSUNBZ0lFcDFSRFptVmtOS2RUSjZXVGRVYUU0eFR6QnZWMVIzUVdGT1FYWk5OVFZEVEZSMk5uTXpSbTEwVWpreWJHNXNVVVJHZFVvclptbzROak5qTm5GNE1UUUtJQ0FnSUNBZ0lDQkdkVTgwYlUwM1pYVlRNRGgzUjJkV1IyMDVNWGRCTjJKWmJEUmhhSGhETmxNeVFrZENOVVoyYTFwbWVrSkNkMnB6Wm0xVlYwaEJkVGRXVWxwS2VHdFlDaUFnSUNBZ0lDQWdTbkEyT1RaUFZHUlNNMUptU1RkSldqWlBWelowUjBWTWFXcHpkMWRpWWxwWVlqVllVbGRGVnprNWRsZFBOMDVKU3paelQzWm9UVVJPY0RsaVUwMTFZZ29nSUNBZ0lDQWdJRmhRTTFCaVVIaG5lVlF3WW0xemN6QjVkMDVaZDNWamJtWmpiVVJZY1ZCV2RUTkhaSFExTTJGME1TdG9TemR0Ykc1Uk0zVlZjelZsVmtWUFNVaHVTbTBLSUNBZ0lDQWdJQ0JtTVhSeVJHZG5VMVJGTjJadWEzZzJRM3BzSzJsTmEwRkZVVVZCUVZsclExQkJVVmxCVVc5QlNtaFphRUpMU1RKSWJWSnFaa1I0WWxOQlFWaDRaVU0wQ2lBZ0lDQWdJQ0FnYkhGcVJqbDNVSFpDVVVwcmRYaGlXa0ZvYzAxQ1VXdEVkMjFqUVVGQmIwcEZUME0wYkhGcVJqbDNVSFk0VTFGUUwycHpVV1pLUTFWSWNtcHdXRFJtVUFvZ0lDQWdJQ0FnSURCT2RGWjVjV3hEY25FeFQyMU1VRGRDVEhKWWNrTjRiMEZHVW1JMk5GbEtWV1JYYXpWUU16VnJPWGRxTWtKUmFuQnFZMDVxTW1sck9EQkdiMjh3TWtVS0lDQWdJQ0FnSUNCNVl5dFFlbGN2TkhSNlZuWmtlRkp5UlhwelQwWnRLMjFOVWl0c2JGVklRVXQ2UW1FMlVVSjRTRlF3YjJaTU4zQTFXRmxVZFUxT2JsbHZLMUJxVmsxdENpQWdJQ0FnSUNBZ2FsQXpWRVZLUjFsWVdXMTFhRWRtWVdGS1duQnFURzFLUm5Gd05UbDRMeTlrYzAxSVpVeHhWVU5vZDJJMlEyYzJSSFZyUVdsb1pVRnpNMUFyY2xodk13b2dJQ0FnSUNBZ0lIUkNia0UwU2tORGFWaFNOeTh2TUZkbGVsSnZVMUJrWVd4T1pXMDBkbk00VUZRNE4zTnVTR0pFYkdsR1RWWm1PSGNyWm10elNXNXhkbTkwYVZKRVNUUUtJQ0FnSUNBZ0lDQlJRbkpDWm5NelRtUmxXbGN2ZEcxMWNFOWhXa3BTZWtoRWRuWkxZbWN2TDA4MmFYQXhZVkIyU1V4WGRsUkVUVGhMWTFGRFVVVlRZVmRyUTJKSk1YVmpDaUFnSUNBZ0lDQWdjbWw2UVUxaWJGUkNNbWQ1ZHpsNWIycERjRlpEVFVKWVpHbDZRWEZ4ZVd3MVdsWnlkelFyV0M5cE1EbEpjMDUwT0doQk9TODFVbGszZGpOak4xb3lRd29nSUNBZ0lDQWdJRmg1TW5oTFYyMTBURWs1Ym14UFUxTjNWWGhDTlRZMlNUSTViRlpMUWt4VmJWaHRVV1p1VWtsSlNFTnBTa1JZV1VaRVVDODJUR1oyT1N0dGFFVlhWVGdLSUNBZ0lDQWdJQ0J4WldRemVHaHdaVTVUUVVsNlFTdE5WR3hxZEdsU2JXOXllSEJrWkdsWVluUkRZV1pqVUd3dlNqTllNRUl3TjJaalkwcGFkMXB6UTFsRGNIUk1lVEZqQ2lBZ0lDQWdJQ0FnZVhaV1lVNHJSVUp0YW05RGNETnFkRFozVEdVMGVHTnNjVlV6UVVOM2VpODRWRVJFYlhSS04xVlZaR3czVFdScmFYQlJXakkzT0V3eWEzQnNObTgyTVFvZ0lDQWdJQ0FnSUUxR01tWllSRGRtV2sxbFdtWkZkelpzZFRCQ1JqVnRXakF2WTJnelNIaFlaVnB2V0dsbU56bG5NalYyV20xVFpGYzVOM0JqWldWM1VHeDJiRVZVUmxFS0lDQWdJQ0FnSUNBMU5YQk5iM0pSZVZWVVJWRkRVVE5GUTNwSVdWTnVUQzlVYlZjM0NpQWdJQ0FnSUNBZ1BTc3dVbU1LSUNBZ0lDQWdJQ0F0TFMwdExVVk9SQ0JRUjFBZ1VGVkNURWxESUV0RldTQkNURTlEU3kwdExTMHRDaUFnSUNBZ0lDSnpiM1Z5WTJVaU9pQWlaR1ZpSUZ0emFXZHVaV1F0WW5rOUpFdEZXVjlHU1V4RlhTQm9kSFJ3Y3pvdkwzSmxiR1ZoYzJVdGFtRnRiWGt1YVc1bWNtRm9iM1Z6WlM1amIyMHZJQ1JTUlV4RlFWTkZDaUFnSUNBZ0lDQWdiV0ZwYmlJS0luQmhZMnRoWjJWZmRYQmtZWFJsSWpvZ2RISjFaUW9pY0dGamEyRm5aWE1pT2dvdElDSndkWEJ3WlhRdFkyOWtaU0lLTFNBaWFXNW1jbUZvYjNWelpTMTBiMjlzYTJsMElnb3RJQ0pwYm1aeVlXaHZkWE5sTFhCMWNIQmxkQzFrWVhSaElnb2ljSFZ3Y0dWMElqb0tJQ0FpWTI5c2JHVmpkR2x2YmlJNklDSndkWEJ3WlhRNElnb2dJQ0pwYm5OMFlXeHNJam9nZEhKMVpRb2dJQ0pwYm5OMFlXeHNYM1I1Y0dVaU9pQWlZV2x2SWdvZ0lDSndZV05yWVdkbFgyNWhiV1VpT2lBaWNIVndjR1YwTFdGblpXNTBJZ29nSUNKemRHRnlkRjl6WlhKMmFXTmxJam9nWm1Gc2MyVUtJbkoxYm1OdFpDSTZDaTBnTFNBaWFXZ3RjSFZ3Y0dWMElnb2dJQzBnSWkwdFpXNTJhWEp2Ym0xbGJuUWlDaUFnTFNBaWNISnZaSFZqZEdsdmJpSUtJQ0F0SUNJdExXVnVkbWx5YjI1dFpXNTBjR0YwYUNJS0lDQXRJQ0o3Y205dmRGOWthWEpsWTNSdmNubDlMMlZ1ZG1seWIyNXRaVzUwY3lJS0lDQXRJQ0l0TFhKdmIzUXRaR2x5WldOMGIzSjVJZ29nSUMwZ0lpOXZjSFF2Y0hWd2NHVjBMV052WkdVaUNpQWdMU0FpTFMxb2FXVnlZUzFqYjI1bWFXY2lDaUFnTFNBaUwyOXdkQzlwYm1aeVlXaHZkWE5sTFhCMWNIQmxkQzFrWVhSaEwyVnVkbWx5YjI1dFpXNTBjeTl3Y205a2RXTjBhVzl1TDJocFpYSmhMbmxoYld3aUNpQWdMU0FpTFMxdGIyUjFiR1V0Y0dGMGFDSUtJQ0F0SUNKN2NtOXZkRjlrYVhKbFkzUnZjbmw5TDIxdlpIVnNaWE1pQ2lBZ0xTQWlZWEJ3YkhraUNpSjNjbWwwWlY5bWFXeGxjeUk2Q2kwZ0ltTnZiblJsYm5RaU9pQWlaWGh3YjNKMElFRlhVMTlFUlVaQlZVeFVYMUpGUjBsUFRqMTFjeTEzWlhOMExURWlDaUFnSW5CaGRHZ2lPaUFpTDJWMFl5OXdjbTltYVd4bExtUXZZWGR6TG5Ob0lnb2dJQ0p3WlhKdGFYTnphVzl1Y3lJNklDSXdOalEwSWdvdElDSmpiMjUwWlc1MElqb2dmQzBLSUNBZ0lGdGtaV1poZFd4MFhRb2dJQ0FnY21WbmFXOXVQWFZ6TFhkbGMzUXRNUW9nSUNKd1lYUm9Jam9nSWk5eWIyOTBMeTVoZDNNdlkyOXVabWxuSWdvZ0lDSndaWEp0YVhOemFXOXVjeUk2SUNJd05qQXdJZ290SUNKamIyNTBaVzUwSWpvZ2ZBb2dJQ0FnSW5CMWNIQmxkRjlsYm5acGNtOXViV1Z1ZENJNklDSndjbTlrZFdOMGFXOXVJZ29nSUNBZ0luQjFjSEJsZEY5eWIyeGxJam9nSW1wMWJYQm9iM04wSWdvZ0lDSndZWFJvSWpvZ0lpOWxkR012Y0hWd2NHVjBiR0ZpY3k5bVlXTjBaWEl2Wm1GamRITXVaQzl3ZFhCd1pYUXVlV0Z0YkNJS0lDQWljR1Z5YldsemMybHZibk1pT2lBaU1EWTBOQ0lLTFNBaVkyOXVkR1Z1ZENJNklDSjdYQ0pwYUMxd2RYQndaWFJjSWpwN1hDSmtaV0oxWjF3aU9tWmhiSE5sTEZ3aVpXNTJhWEp2Ym0xbGJuUndZWFJvWENJNlhDSjdjbTl2ZEY5a2FYSmxZM1J2Y25sOUwyVnVkbWx5YjI1dFpXNTBjMXdpTEZ3aWFHbGxjbUV0WTI5dVptbG5YQ0k2WENJdmIzQjBMMmx1Wm5KaGFHOTFjMlV0Y0hWd2NHVjBMV1JoZEdFdlpXNTJhWEp2Ym0xbGJuUnpMM0J5YjJSMVkzUnBiMjR2YUdsbGNtRXVlV0Z0YkZ3aUxGd2liVzlrZFd4bExYQmhkR2hjSWpwY0ludHliMjkwWDJScGNtVmpkRzl5ZVgwdmJXOWtkV3hsYzF3aUxGd2ljbTl2ZEMxa2FYSmxZM1J2Y25sY0lqcGNJaTl2Y0hRdmNIVndjR1YwTFdOdlpHVmNJbjE5SWdvZ0lDSndZWFJvSWpvZ0lpOWxkR012Y0hWd2NHVjBiR0ZpY3k5bVlXTjBaWEl2Wm1GamRITXVaQzlwYUMxd2RYQndaWFF1YW5OdmJpSUtJQ0FpY0dWeWJXbHpjMmx2Ym5NaU9pQWlNRFkwTkNJS0xTQWlZMjl1ZEdWdWRDSTZJQ0o3ZlNJS0lDQWljR0YwYUNJNklDSXZaWFJqTDNCMWNIQmxkR3hoWW5NdlptRmpkR1Z5TDJaaFkzUnpMbVF2WTNWemRHOXRMbXB6YjI0aUNpQWdJbkJsY20xcGMzTnBiMjV6SWpvZ0lqQTJORFFpQ2cwS0xTMU5TVTFGUWs5VlRrUkJVbGt0TFEwS1wiJTBBICAgICAgKyB2cGNfc2VjdXJpdHlfZ3JvdXBfaWRzID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSUwQSAgICAgICsgaWFtX2luc3RhbmNlX3Byb2ZpbGUgeyUwQSAgICAgICAgICArIGFybiA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAgIH0lMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuanVtcGhvc3QuYXdzX3NlY3VyaXR5X2dyb3VwLmp1bXBob3N0IHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19zZWN1cml0eV9ncm91cFwiIFwianVtcGhvc3RcIiB7JTBBICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZGVzY3JpcHRpb24gICAgICAgICAgICA9IFwiTWFuYWdlIHRyYWZmaWMgdG8ganVtcGhvc3RcIiUwQSAgICAgICsgZWdyZXNzICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpbmdyZXNzICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZSAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hbWVfcHJlZml4ICAgICAgICAgICAgPSBcImp1bXBob3N0XCIlMEEgICAgICArIG93bmVyX2lkICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByZXZva2VfcnVsZXNfb25fZGVsZXRlID0gZmFsc2UlMEEgICAgICArIHRhZ3MgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJOYW1lXCIgPSBcImp1bXBob3N0XCIlMEEgICAgICAgIH0lMEEgICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCJqdW1waG9zdFwiJTBBICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiJTBBICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCIlMEEgICAgICAgIH0lMEEgICAgICArIHZwY19pZCAgICAgICAgICAgICAgICAgPSBcInZwYy0wOGUxOWQ4NTljMjZkMThiMlwiJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmp1bXBob3N0LmF3c192cGNfc2VjdXJpdHlfZ3JvdXBfZWdyZXNzX3J1bGUuZGVmYXVsdCB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2VncmVzc19ydWxlXCIgXCJkZWZhdWx0XCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGNpZHJfaXB2NCAgICAgICAgICAgICAgPSBcIjAuMC4wLjAvMFwiJTBBICAgICAgKyBkZXNjcmlwdGlvbiAgICAgICAgICAgID0gXCJBbGxvdyBhbGwgdHJhZmZpY1wiJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaXBfcHJvdG9jb2wgICAgICAgICAgICA9IFwiLTFcIiUwQSAgICAgICsgc2VjdXJpdHlfZ3JvdXBfaWQgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHNlY3VyaXR5X2dyb3VwX3J1bGVfaWQgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiTmFtZVwiID0gXCJvdXRnb2luZyB0cmFmZmljXCIlMEEgICAgICAgIH0lMEEgICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCJvdXRnb2luZyB0cmFmZmljXCIlMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCIlMEEgICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIiUwQSAgICAgICAgfSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5qdW1waG9zdC5hd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZS5pY21wIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlXCIgXCJpY21wXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGNpZHJfaXB2NCAgICAgICAgICAgICAgPSBcIjAuMC4wLjAvMFwiJTBBICAgICAgKyBkZXNjcmlwdGlvbiAgICAgICAgICAgID0gXCJBbGxvdyBhbGwgSUNNUCB0cmFmZmljXCIlMEEgICAgICArIGZyb21fcG9ydCAgICAgICAgICAgICAgPSAtMSUwQSAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlwX3Byb3RvY29sICAgICAgICAgICAgPSBcImljbXBcIiUwQSAgICAgICsgc2VjdXJpdHlfZ3JvdXBfaWQgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHNlY3VyaXR5X2dyb3VwX3J1bGVfaWQgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiTmFtZVwiID0gXCJJQ01QIHRyYWZmaWNcIiUwQSAgICAgICAgfSUwQSAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcIk5hbWVcIiAgICAgICAgPSBcIklDTVAgdHJhZmZpY1wiJTBBICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiJTBBICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCIlMEEgICAgICAgIH0lMEEgICAgICArIHRvX3BvcnQgICAgICAgICAgICAgICAgPSAtMSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5qdW1waG9zdC5hd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZS5zc2ggd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGVcIiBcInNzaFwiIHslMEEgICAgICArIGFybiAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBjaWRyX2lwdjQgICAgICAgICAgICAgID0gXCIwLjAuMC4wLzBcIiUwQSAgICAgICsgZGVzY3JpcHRpb24gICAgICAgICAgICA9IFwiQWxsb3cgU1NIIHRyYWZmaWNcIiUwQSAgICAgICsgZnJvbV9wb3J0ICAgICAgICAgICAgICA9IDIyJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaXBfcHJvdG9jb2wgICAgICAgICAgICA9IFwidGNwXCIlMEEgICAgICArIHNlY3VyaXR5X2dyb3VwX2lkICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBzZWN1cml0eV9ncm91cF9ydWxlX2lkID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdGFncyAgICAgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcIk5hbWVcIiA9IFwiU1NIIGFjY2Vzc1wiJTBBICAgICAgICB9JTBBICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiTmFtZVwiICAgICAgICA9IFwiU1NIIGFjY2Vzc1wiJTBBICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiJTBBICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCIlMEEgICAgICAgIH0lMEEgICAgICArIHRvX3BvcnQgICAgICAgICAgICAgICAgPSAyMiUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5qdW1waG9zdC5yYW5kb21fc3RyaW5nLmFzZ19uYW1lIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcInJhbmRvbV9zdHJpbmdcIiBcImFzZ19uYW1lXCIgeyUwQSAgICAgICsgaWQgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBsZW5ndGggICAgICA9IDYlMEEgICAgICArIGxvd2VyICAgICAgID0gdHJ1ZSUwQSAgICAgICsgbWluX2xvd2VyICAgPSAwJTBBICAgICAgKyBtaW5fbnVtZXJpYyA9IDAlMEEgICAgICArIG1pbl9zcGVjaWFsID0gMCUwQSAgICAgICsgbWluX3VwcGVyICAgPSAwJTBBICAgICAgKyBudW1iZXIgICAgICA9IHRydWUlMEEgICAgICArIG51bWVyaWMgICAgID0gdHJ1ZSUwQSAgICAgICsgcmVzdWx0ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBzcGVjaWFsICAgICA9IGZhbHNlJTBBICAgICAgKyB1cHBlciAgICAgICA9IHRydWUlMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuanVtcGhvc3QucmFuZG9tX3N0cmluZy5wcm9maWxlLXN1ZmZpeCB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJyYW5kb21fc3RyaW5nXCIgXCJwcm9maWxlLXN1ZmZpeFwiIHslMEEgICAgICArIGlkICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbGVuZ3RoICAgICAgPSAxMiUwQSAgICAgICsgbG93ZXIgICAgICAgPSB0cnVlJTBBICAgICAgKyBtaW5fbG93ZXIgICA9IDAlMEEgICAgICArIG1pbl9udW1lcmljID0gMCUwQSAgICAgICsgbWluX3NwZWNpYWwgPSAwJTBBICAgICAgKyBtaW5fdXBwZXIgICA9IDAlMEEgICAgICArIG51bWJlciAgICAgID0gdHJ1ZSUwQSAgICAgICsgbnVtZXJpYyAgICAgPSB0cnVlJTBBICAgICAgKyByZXN1bHQgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHNwZWNpYWwgICAgID0gZmFsc2UlMEEgICAgICArIHVwcGVyICAgICAgID0gdHJ1ZSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5hd3NfaWFtX2luc3RhbmNlX3Byb2ZpbGUucHJvZmlsZSB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX2luc3RhbmNlX3Byb2ZpbGVcIiBcInByb2ZpbGVcIiB7JTBBICAgICAgKyBhcm4gICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGNyZWF0ZV9kYXRlID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaWQgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hbWVfcHJlZml4ID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcGF0aCAgICAgICAgPSBcIi9cIiUwQSAgICAgICsgcm9sZSAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzX2FsbCAgICA9IHslMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCIlMEEgICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIiUwQSAgICAgICAgfSUwQSAgICAgICsgdW5pcXVlX2lkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmF3c19pYW1fcG9saWN5LnByb2ZpbGUgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2lhbV9wb2xpY3lcIiBcInByb2ZpbGVcIiB7JTBBICAgICAgKyBhcm4gICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZSAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lX3ByZWZpeCA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBhdGggICAgICAgID0gXCIvXCIlMEEgICAgICArIHBvbGljeSAgICAgID0ganNvbmVuY29kZSglMEEgICAgICAgICAgICB7JTBBICAgICAgICAgICAgICArIFN0YXRlbWVudCA9IFslMEEgICAgICAgICAgICAgICAgICArIHslMEEgICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICA9IFwiZWMyOkRlc2NyaWJlKlwiJTBBICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgPSBcIkFsbG93XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBSZXNvdXJjZSA9IFwiKlwiJTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICArIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiJTBBICAgICAgICAgICAgfSUwQSAgICAgICAgKSUwQSAgICAgICsgcG9saWN5X2lkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzX2FsbCAgICA9IHslMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCIlMEEgICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIiUwQSAgICAgICAgfSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5hd3NfaWFtX3JvbGUucHJvZmlsZSB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVcIiBcInByb2ZpbGVcIiB7JTBBICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBhc3N1bWVfcm9sZV9wb2xpY3kgICAgPSBqc29uZW5jb2RlKCUwQSAgICAgICAgICAgIHslMEEgICAgICAgICAgICAgICsgU3RhdGVtZW50ID0gWyUwQSAgICAgICAgICAgICAgICAgICsgeyUwQSAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgICA9IFwic3RzOkFzc3VtZVJvbGVcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIEVmZmVjdCAgICA9IFwiQWxsb3dcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIFByaW5jaXBhbCA9IHslMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgU2VydmljZSA9IFwiZWMyLmFtYXpvbmF3cy5jb21cIiUwQSAgICAgICAgICAgICAgICAgICAgICAgIH0lMEEgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICsgVmVyc2lvbiAgID0gXCIyMDEyLTEwLTE3XCIlMEEgICAgICAgICAgICB9JTBBICAgICAgICApJTBBICAgICAgKyBjcmVhdGVfZGF0ZSAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBmb3JjZV9kZXRhY2hfcG9saWNpZXMgPSBmYWxzZSUwQSAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbWFuYWdlZF9wb2xpY3lfYXJucyAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbWF4X3Nlc3Npb25fZHVyYXRpb24gID0gMzYwMCUwQSAgICAgICsgbmFtZSAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZV9wcmVmaXggICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcGF0aCAgICAgICAgICAgICAgICAgID0gXCIvXCIlMEEgICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCIlMEEgICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIiUwQSAgICAgICAgfSUwQSAgICAgICsgdW5pcXVlX2lkICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuZXh0cmFbXCJwYWNrYWdlLXB1Ymxpc2hlclwiXSB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnRcIiBcImV4dHJhXCIgeyUwQSAgICAgICsgaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBvbGljeV9hcm4gPSBcImFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cG9saWN5L3BhY2thZ2UtcHVibGlzaGVyXCIlMEEgICAgICArIHJvbGUgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5leHRyYVtcInJlcXVpcmVkXCJdIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudFwiIFwiZXh0cmFcIiB7JTBBICAgICAgKyBpZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcG9saWN5X2FybiA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHJvbGUgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5wcm9maWxlIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudFwiIFwicHJvZmlsZVwiIHslMEEgICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwb2xpY3lfYXJuID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcm9sZSAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuanVtcGhvc3QubW9kdWxlLnVwZGF0ZV9kbnMuZGF0YS5hcmNoaXZlX2ZpbGUubGFtYmRhIHdpbGwgYmUgcmVhZCBkdXJpbmcgYXBwbHklMEEgICMgKGNvbmZpZyByZWZlcnMgdG8gdmFsdWVzIG5vdCB5ZXQga25vd24pJTBBIDw9IGRhdGEgXCJhcmNoaXZlX2ZpbGVcIiBcImxhbWJkYVwiIHslMEEgICAgICArIGV4Y2x1ZGVzICAgICAgICAgICAgPSBbJTBBICAgICAgICAgICsgXCJfX3B5Y2FjaGVfX1wiLCUwQSAgICAgICAgXSUwQSAgICAgICsgaWQgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG91dHB1dF9iYXNlNjRzaGEyNTYgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBvdXRwdXRfYmFzZTY0c2hhNTEyID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgb3V0cHV0X21kNSAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG91dHB1dF9wYXRoICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBvdXRwdXRfc2hhICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgb3V0cHV0X3NoYTI1NiAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG91dHB1dF9zaGE1MTIgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBvdXRwdXRfc2l6ZSAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgc291cmNlX2RpciAgICAgICAgICA9IFwiLnRlcnJhZm9ybS9tb2R1bGVzL2p1bXBob3N0LnVwZGF0ZV9kbnMvdXBkYXRlX2Ruc1wiJTBBICAgICAgKyB0eXBlICAgICAgICAgICAgICAgID0gXCJ6aXBcIiUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5qdW1waG9zdC5tb2R1bGUudXBkYXRlX2Rucy5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmxhbWJkYS1wZXJtaXNzaW9ucyB3aWxsIGJlIHJlYWQgZHVyaW5nIGFwcGx5JTBBICAjIChjb25maWcgcmVmZXJzIHRvIHZhbHVlcyBub3QgeWV0IGtub3duKSUwQSA8PSBkYXRhIFwiYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnRcIiBcImxhbWJkYS1wZXJtaXNzaW9uc1wiIHslMEEgICAgICArIGlkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBqc29uID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSUwQSAgICAgICsgc3RhdGVtZW50IHslMEEgICAgICAgICAgKyBhY3Rpb25zICAgPSBbJTBBICAgICAgICAgICAgICArIFwiYXV0b3NjYWxpbmc6Q29tcGxldGVMaWZlY3ljbGVBY3Rpb25cIiwlMEEgICAgICAgICAgICBdJTBBICAgICAgICAgICsgcmVzb3VyY2VzID0gWyUwQSAgICAgICAgICAgICAgKyAoa25vd24gYWZ0ZXIgYXBwbHkpLCUwQSAgICAgICAgICAgIF0lMEEgICAgICAgIH0lMEEgICAgICArIHN0YXRlbWVudCB7JTBBICAgICAgICAgICsgYWN0aW9ucyAgID0gWyUwQSAgICAgICAgICAgICAgKyBcImVjMjpEZXNjcmliZUluc3RhbmNlc1wiLCUwQSAgICAgICAgICAgICAgKyBcImVjMjpEZXNjcmliZVRhZ3NcIiwlMEEgICAgICAgICAgICBdJTBBICAgICAgICAgICsgcmVzb3VyY2VzID0gWyUwQSAgICAgICAgICAgICAgKyBcIipcIiwlMEEgICAgICAgICAgICBdJTBBICAgICAgICB9JTBBICAgICAgKyBzdGF0ZW1lbnQgeyUwQSAgICAgICAgICArIGFjdGlvbnMgICA9IFslMEEgICAgICAgICAgICAgICsgXCJlYzI6Q3JlYXRlVGFnc1wiLCUwQSAgICAgICAgICAgIF0lMEEgICAgICAgICAgKyByZXNvdXJjZXMgPSBbJTBBICAgICAgICAgICAgICArIFwiYXJuOmF3czplYzI6Kjo0OTMzNzA4MjY0MjQ6aW5zdGFuY2UvKlwiLCUwQSAgICAgICAgICAgIF0lMEEgICAgICAgIH0lMEEgICAgICArIHN0YXRlbWVudCB7JTBBICAgICAgICAgICsgYWN0aW9ucyAgID0gWyUwQSAgICAgICAgICAgICAgKyBcInJvdXRlNTM6Q2hhbmdlUmVzb3VyY2VSZWNvcmRTZXRzXCIsJTBBICAgICAgICAgICAgICArIFwicm91dGU1MzpMaXN0UmVzb3VyY2VSZWNvcmRTZXRzXCIsJTBBICAgICAgICAgICAgXSUwQSAgICAgICAgICArIHJlc291cmNlcyA9IFslMEEgICAgICAgICAgICAgICsgXCJhcm46YXdzOnJvdXRlNTM6Ojpob3N0ZWR6b25lL1owNzY2MjI1MUxIM1lSRjJFUk0zR1wiLCUwQSAgICAgICAgICAgIF0lMEEgICAgICAgIH0lMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuanVtcGhvc3QubW9kdWxlLnVwZGF0ZV9kbnMuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5sYW1iZGFfbG9nZ2luZyB3aWxsIGJlIHJlYWQgZHVyaW5nIGFwcGx5JTBBICAjIChjb25maWcgcmVmZXJzIHRvIHZhbHVlcyBub3QgeWV0IGtub3duKSUwQSA8PSBkYXRhIFwiYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnRcIiBcImxhbWJkYV9sb2dnaW5nXCIgeyUwQSAgICAgICsgaWQgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGpzb24gPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBJTBBICAgICAgKyBzdGF0ZW1lbnQgeyUwQSAgICAgICAgICArIGFjdGlvbnMgICA9IFslMEEgICAgICAgICAgICAgICsgXCJsb2dzOkNyZWF0ZUxvZ1N0cmVhbVwiLCUwQSAgICAgICAgICAgIF0lMEEgICAgICAgICAgKyBlZmZlY3QgICAgPSBcIkFsbG93XCIlMEEgICAgICAgICAgKyByZXNvdXJjZXMgPSBbJTBBICAgICAgICAgICAgICArIChrbm93biBhZnRlciBhcHBseSksJTBBICAgICAgICAgICAgXSUwQSAgICAgICAgfSUwQSAgICAgICsgc3RhdGVtZW50IHslMEEgICAgICAgICAgKyBhY3Rpb25zICAgPSBbJTBBICAgICAgICAgICAgICArIFwibG9nczpQdXRMb2dFdmVudHNcIiwlMEEgICAgICAgICAgICBdJTBBICAgICAgICAgICsgZWZmZWN0ICAgID0gXCJBbGxvd1wiJTBBICAgICAgICAgICsgcmVzb3VyY2VzID0gWyUwQSAgICAgICAgICAgICAgKyBcImFybjphd3M6bG9nczp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OmxvZy1ncm91cDoqOmxvZy1zdHJlYW06KlwiLCUwQSAgICAgICAgICAgIF0lMEEgICAgICAgIH0lMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuanVtcGhvc3QubW9kdWxlLnVwZGF0ZV9kbnMuYXdzX2Nsb3Vkd2F0Y2hfZXZlbnRfcnVsZS5pbnN0YW5jZV9jaGFuZ2Ugd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2Nsb3Vkd2F0Y2hfZXZlbnRfcnVsZVwiIFwiaW5zdGFuY2VfY2hhbmdlXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBkZXNjcmlwdGlvbiAgICA9IFwiSW5zdGFuY2UgcnVubmluZ1wiJTBBICAgICAgKyBldmVudF9idXNfbmFtZSA9IFwiZGVmYXVsdFwiJTBBICAgICAgKyBldmVudF9wYXR0ZXJuICA9IGpzb25lbmNvZGUoJTBBICAgICAgICAgICAgeyUwQSAgICAgICAgICAgICAgKyBkZXRhaWwgICAgICA9IHslMEEgICAgICAgICAgICAgICAgICArIHN0YXRlID0gWyUwQSAgICAgICAgICAgICAgICAgICAgICArIFwicnVubmluZ1wiLCUwQSAgICAgICAgICAgICAgICAgICAgICArIFwic2h1dHRpbmctZG93blwiLCUwQSAgICAgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgICB9JTBBICAgICAgICAgICAgICArIGRldGFpbC10eXBlID0gWyUwQSAgICAgICAgICAgICAgICAgICsgXCJFQzIgSW5zdGFuY2UgU3RhdGUtY2hhbmdlIE5vdGlmaWNhdGlvblwiLCUwQSAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICArIHNvdXJjZSAgICAgID0gWyUwQSAgICAgICAgICAgICAgICAgICsgXCJhd3MuZWMyXCIsJTBBICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICB9JTBBICAgICAgICApJTBBICAgICAgKyBpZCAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hbWUgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZV9wcmVmaXggICAgPSBcImFzZ19pbnN0YW5jZVwiJTBBICAgICAgKyB0YWdzX2FsbCAgICAgICA9IHslMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCIlMEEgICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIiUwQSAgICAgICAgfSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5qdW1waG9zdC5tb2R1bGUudXBkYXRlX2Rucy5hd3NfY2xvdWR3YXRjaF9ldmVudF9ydWxlLnNjYWxlIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19jbG91ZHdhdGNoX2V2ZW50X3J1bGVcIiBcInNjYWxlXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBkZXNjcmlwdGlvbiAgICA9IFwiQVNHIGxpZmVjeWNsZSBob29rXCIlMEEgICAgICArIGV2ZW50X2J1c19uYW1lID0gXCJkZWZhdWx0XCIlMEEgICAgICArIGV2ZW50X3BhdHRlcm4gID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaWQgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hbWVfcHJlZml4ICAgID0gXCJhc2ctc2NhbGVcIiUwQSAgICAgICsgdGFnc19hbGwgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiJTBBICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCIlMEEgICAgICAgIH0lMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuanVtcGhvc3QubW9kdWxlLnVwZGF0ZV9kbnMuYXdzX2Nsb3Vkd2F0Y2hfZXZlbnRfdGFyZ2V0Lmluc3RhbmNlLXJ1bm5pbmcgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2Nsb3Vkd2F0Y2hfZXZlbnRfdGFyZ2V0XCIgXCJpbnN0YW5jZS1ydW5uaW5nXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBldmVudF9idXNfbmFtZSA9IFwiZGVmYXVsdFwiJTBBICAgICAgKyBpZCAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHJ1bGUgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdGFyZ2V0X2lkICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS51cGRhdGVfZG5zLmF3c19jbG91ZHdhdGNoX2V2ZW50X3RhcmdldC5zY2FsZS1vdXQgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2Nsb3Vkd2F0Y2hfZXZlbnRfdGFyZ2V0XCIgXCJzY2FsZS1vdXRcIiB7JTBBICAgICAgKyBhcm4gICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGV2ZW50X2J1c19uYW1lID0gXCJkZWZhdWx0XCIlMEEgICAgICArIGlkICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcnVsZSAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YXJnZXRfaWQgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuanVtcGhvc3QubW9kdWxlLnVwZGF0ZV9kbnMuYXdzX2Nsb3Vkd2F0Y2hfbG9nX2dyb3VwLnVwZGF0ZV9kbnMgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2Nsb3Vkd2F0Y2hfbG9nX2dyb3VwXCIgXCJ1cGRhdGVfZG5zXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGxvZ19ncm91cF9jbGFzcyAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZSAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lX3ByZWZpeCAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHJldGVudGlvbl9pbl9kYXlzID0gMTQlMEEgICAgICArIHNraXBfZGVzdHJveSAgICAgID0gZmFsc2UlMEEgICAgICArIHRhZ3NfYWxsICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIiUwQSAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiJTBBICAgICAgICB9JTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS51cGRhdGVfZG5zLmF3c19pYW1fcG9saWN5LmxhbWJkYV9sb2dnaW5nIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19pYW1fcG9saWN5XCIgXCJsYW1iZGFfbG9nZ2luZ1wiIHslMEEgICAgICArIGFybiAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZGVzY3JpcHRpb24gPSBcIklBTSBwb2xpY3kgZm9yIGxvZ2dpbmcgZnJvbSBhIGxhbWJkYVwiJTBBICAgICAgKyBpZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hbWUgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZV9wcmVmaXggPSBcImxhbWJkYV9sb2dnaW5nXCIlMEEgICAgICArIHBhdGggICAgICAgID0gXCIvXCIlMEEgICAgICArIHBvbGljeSAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcG9saWN5X2lkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzX2FsbCAgICA9IHslMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCIlMEEgICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIiUwQSAgICAgICAgfSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5qdW1waG9zdC5tb2R1bGUudXBkYXRlX2Rucy5hd3NfaWFtX3BvbGljeS5sYW1iZGFfcGVybWlzc2lvbnMgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2lhbV9wb2xpY3lcIiBcImxhbWJkYV9wZXJtaXNzaW9uc1wiIHslMEEgICAgICArIGFybiAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZGVzY3JpcHRpb24gPSBcIklBTSBwb2xpY3kgZm9yIGEgbGFtYmRhIHBlcm1pc3Npb25zXCIlMEEgICAgICArIGlkICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZSAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lX3ByZWZpeCA9IFwibGFtYmRhX3Blcm1pc3Npb25zXCIlMEEgICAgICArIHBhdGggICAgICAgID0gXCIvXCIlMEEgICAgICArIHBvbGljeSAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcG9saWN5X2lkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzX2FsbCAgICA9IHslMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCIlMEEgICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIiUwQSAgICAgICAgfSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5qdW1waG9zdC5tb2R1bGUudXBkYXRlX2Rucy5hd3NfaWFtX3JvbGUuaWFtX2Zvcl9sYW1iZGEgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlXCIgXCJpYW1fZm9yX2xhbWJkYVwiIHslMEEgICAgICArIGFybiAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGFzc3VtZV9yb2xlX3BvbGljeSAgICA9IGpzb25lbmNvZGUoJTBBICAgICAgICAgICAgeyUwQSAgICAgICAgICAgICAgKyBTdGF0ZW1lbnQgPSBbJTBBICAgICAgICAgICAgICAgICAgKyB7JTBBICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgID0gXCJzdHM6QXNzdW1lUm9sZVwiJTBBICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgID0gXCJBbGxvd1wiJTBBICAgICAgICAgICAgICAgICAgICAgICsgUHJpbmNpcGFsID0geyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBTZXJ2aWNlID0gXCJsYW1iZGEuYW1hem9uYXdzLmNvbVwiJTBBICAgICAgICAgICAgICAgICAgICAgICAgfSUwQSAgICAgICAgICAgICAgICAgICAgfSwlMEEgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgKyBWZXJzaW9uICAgPSBcIjIwMTItMTAtMTdcIiUwQSAgICAgICAgICAgIH0lMEEgICAgICAgICklMEEgICAgICArIGNyZWF0ZV9kYXRlICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGZvcmNlX2RldGFjaF9wb2xpY2llcyA9IGZhbHNlJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBtYW5hZ2VkX3BvbGljeV9hcm5zICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBtYXhfc2Vzc2lvbl9kdXJhdGlvbiAgPSAzNjAwJTBBICAgICAgKyBuYW1lICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lX3ByZWZpeCAgICAgICAgICAgPSBcImlhbV9mb3JfbGFtYmRhXCIlMEEgICAgICArIHBhdGggICAgICAgICAgICAgICAgICA9IFwiL1wiJTBBICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiJTBBICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCIlMEEgICAgICAgIH0lMEEgICAgICArIHVuaXF1ZV9pZCAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuanVtcGhvc3QubW9kdWxlLnVwZGF0ZV9kbnMuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LkFXU0xhbWJkYUJhc2ljRXhlY3V0aW9uUm9sZSB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnRcIiBcIkFXU0xhbWJkYUJhc2ljRXhlY3V0aW9uUm9sZVwiIHslMEEgICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwb2xpY3lfYXJuID0gXCJhcm46YXdzOmlhbTo6YXdzOnBvbGljeS9zZXJ2aWNlLXJvbGUvQVdTTGFtYmRhQmFzaWNFeGVjdXRpb25Sb2xlXCIlMEEgICAgICArIHJvbGUgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS51cGRhdGVfZG5zLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5sYW1iZGFfbG9ncyB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnRcIiBcImxhbWJkYV9sb2dzXCIgeyUwQSAgICAgICsgaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBvbGljeV9hcm4gPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByb2xlICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5qdW1waG9zdC5tb2R1bGUudXBkYXRlX2Rucy5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQubGFtYmRhX3Blcm1pc3Npb25zIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudFwiIFwibGFtYmRhX3Blcm1pc3Npb25zXCIgeyUwQSAgICAgICsgaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBvbGljeV9hcm4gPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByb2xlICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5qdW1waG9zdC5tb2R1bGUudXBkYXRlX2Rucy5hd3NfbGFtYmRhX2Z1bmN0aW9uLnVwZGF0ZV9kbnMgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2xhbWJkYV9mdW5jdGlvblwiIFwidXBkYXRlX2Ruc1wiIHslMEEgICAgICArIGFyY2hpdGVjdHVyZXMgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGFybiAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGZ1bmN0aW9uX25hbWUgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGhhbmRsZXIgICAgICAgICAgICAgICAgICAgICAgICA9IFwibWFpbi5sYW1iZGFfaGFuZGxlclwiJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpbnZva2VfYXJuICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBsYXN0X21vZGlmaWVkICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBtZW1vcnlfc2l6ZSAgICAgICAgICAgICAgICAgICAgPSAxMjglMEEgICAgICArIHBhY2thZ2VfdHlwZSAgICAgICAgICAgICAgICAgICA9IFwiWmlwXCIlMEEgICAgICArIHB1Ymxpc2ggICAgICAgICAgICAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgKyBxdWFsaWZpZWRfYXJuICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBxdWFsaWZpZWRfaW52b2tlX2FybiAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByZXNlcnZlZF9jb25jdXJyZW50X2V4ZWN1dGlvbnMgPSAtMSUwQSAgICAgICsgcm9sZSAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcnVudGltZSAgICAgICAgICAgICAgICAgICAgICAgID0gXCJweXRob24zLjlcIiUwQSAgICAgICsgczNfYnVja2V0ICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgczNfa2V5ICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgc2lnbmluZ19qb2JfYXJuICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgc2lnbmluZ19wcm9maWxlX3ZlcnNpb25fYXJuICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgc2tpcF9kZXN0cm95ICAgICAgICAgICAgICAgICAgID0gZmFsc2UlMEEgICAgICArIHNvdXJjZV9jb2RlX2hhc2ggICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHNvdXJjZV9jb2RlX3NpemUgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCIlMEEgICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIiUwQSAgICAgICAgfSUwQSAgICAgICsgdGltZW91dCAgICAgICAgICAgICAgICAgICAgICAgID0gMzAlMEEgICAgICArIHZlcnNpb24gICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEElMEEgICAgICArIGVudmlyb25tZW50IHslMEEgICAgICAgICAgKyB2YXJpYWJsZXMgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICB9JTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS51cGRhdGVfZG5zLmF3c19sYW1iZGFfZnVuY3Rpb25fZXZlbnRfaW52b2tlX2NvbmZpZy51cGRhdGVfZG5zIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19sYW1iZGFfZnVuY3Rpb25fZXZlbnRfaW52b2tlX2NvbmZpZ1wiIFwidXBkYXRlX2Ruc1wiIHslMEEgICAgICArIGZ1bmN0aW9uX25hbWUgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbWF4aW11bV9yZXRyeV9hdHRlbXB0cyA9IDAlMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuanVtcGhvc3QubW9kdWxlLnVwZGF0ZV9kbnMuYXdzX2xhbWJkYV9wZXJtaXNzaW9uLmFsbG93X2Nsb3Vkd2F0Y2hfYXNnX2xpZmVjeWNsZV9ob29rIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19sYW1iZGFfcGVybWlzc2lvblwiIFwiYWxsb3dfY2xvdWR3YXRjaF9hc2dfbGlmZWN5Y2xlX2hvb2tcIiB7JTBBICAgICAgKyBhY3Rpb24gICAgICAgICAgICAgID0gXCJsYW1iZGE6SW52b2tlRnVuY3Rpb25cIiUwQSAgICAgICsgZnVuY3Rpb25fbmFtZSAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwcmluY2lwYWwgICAgICAgICAgID0gXCJldmVudHMuYW1hem9uYXdzLmNvbVwiJTBBICAgICAgKyBzb3VyY2VfYXJuICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgc3RhdGVtZW50X2lkICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHN0YXRlbWVudF9pZF9wcmVmaXggPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS51cGRhdGVfZG5zLmF3c19sYW1iZGFfcGVybWlzc2lvbi5hbGxvd19jbG91ZHdhdGNoX2luc3RhbmNlX3J1bm5pbmcgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2xhbWJkYV9wZXJtaXNzaW9uXCIgXCJhbGxvd19jbG91ZHdhdGNoX2luc3RhbmNlX3J1bm5pbmdcIiB7JTBBICAgICAgKyBhY3Rpb24gICAgICAgICAgICAgID0gXCJsYW1iZGE6SW52b2tlRnVuY3Rpb25cIiUwQSAgICAgICsgZnVuY3Rpb25fbmFtZSAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwcmluY2lwYWwgICAgICAgICAgID0gXCJldmVudHMuYW1hem9uYXdzLmNvbVwiJTBBICAgICAgKyBzb3VyY2VfYXJuICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgc3RhdGVtZW50X2lkICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHN0YXRlbWVudF9pZF9wcmVmaXggPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS51cGRhdGVfZG5zLmF3c19zM19idWNrZXQubGFtYmRhX3RtcCB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfczNfYnVja2V0XCIgXCJsYW1iZGFfdG1wXCIgeyUwQSAgICAgICsgYWNjZWxlcmF0aW9uX3N0YXR1cyAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYWNsICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYnVja2V0ICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYnVja2V0X2RvbWFpbl9uYW1lICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYnVja2V0X3ByZWZpeCAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlLWFzZy1sYW1iZGEtXCIlMEEgICAgICArIGJ1Y2tldF9yZWdpb25hbF9kb21haW5fbmFtZSA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGZvcmNlX2Rlc3Ryb3kgICAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgKyBob3N0ZWRfem9uZV9pZCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBvYmplY3RfbG9ja19lbmFibGVkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwb2xpY3kgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByZWdpb24gICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByZXF1ZXN0X3BheWVyICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiJTBBICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCIlMEEgICAgICAgIH0lMEEgICAgICArIHdlYnNpdGVfZG9tYWluICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHdlYnNpdGVfZW5kcG9pbnQgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuanVtcGhvc3QubW9kdWxlLnVwZGF0ZV9kbnMuYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrLnB1YmxpY19hY2Nlc3Mgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrXCIgXCJwdWJsaWNfYWNjZXNzXCIgeyUwQSAgICAgICsgYmxvY2tfcHVibGljX2FjbHMgICAgICAgPSB0cnVlJTBBICAgICAgKyBibG9ja19wdWJsaWNfcG9saWN5ICAgICA9IHRydWUlMEEgICAgICArIGJ1Y2tldCAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZ25vcmVfcHVibGljX2FjbHMgICAgICA9IHRydWUlMEEgICAgICArIHJlc3RyaWN0X3B1YmxpY19idWNrZXRzID0gdHJ1ZSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5qdW1waG9zdC5tb2R1bGUudXBkYXRlX2Rucy5hd3NfczNfb2JqZWN0LmxhbWJkYV9wYWNrYWdlIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19zM19vYmplY3RcIiBcImxhbWJkYV9wYWNrYWdlXCIgeyUwQSAgICAgICsgYWNsICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGJ1Y2tldCAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBidWNrZXRfa2V5X2VuYWJsZWQgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgY2hlY2tzdW1fY3JjMzIgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGNoZWNrc3VtX2NyYzMyYyAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBjaGVja3N1bV9zaGExICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgY2hlY2tzdW1fc2hhMjU2ICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGNvbnRlbnRfdHlwZSAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBldGFnICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZm9yY2VfZGVzdHJveSAgICAgICAgICA9IGZhbHNlJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsga2V5ICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGttc19rZXlfaWQgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBzZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgc291cmNlICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHN0b3JhZ2VfY2xhc3MgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIiUwQSAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiJTBBICAgICAgICB9JTBBICAgICAgKyB2ZXJzaW9uX2lkICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5qdW1waG9zdC5tb2R1bGUudXBkYXRlX2Rucy5udWxsX3Jlc291cmNlLmluc3RhbGxfcHl0aG9uX2RlcGVuZGVuY2llcyB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJudWxsX3Jlc291cmNlXCIgXCJpbnN0YWxsX3B5dGhvbl9kZXBlbmRlbmNpZXNcIiB7JTBBICAgICAgKyBpZCAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHRyaWdnZXJzID0geyUwQSAgICAgICAgICArIFwiZGVwZW5kZW5jaWVzX3ZlcnNpb25cIiA9IFwiNzE1YTBmNzMxMGFlNGRhYmY5YjcxMDgwMjMzOWRjZDVcIiUwQSAgICAgICAgICArIFwibWFpbl92ZXJzaW9uXCIgICAgICAgICA9IFwiNWEzN2JhY2IzNjI4MTg0ZTNkNTI3MjZhOTE1NjQxNTVcIiUwQSAgICAgICAgfSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5qdW1waG9zdC5tb2R1bGUudXBkYXRlX2Rucy5yYW5kb21fdXVpZC5sYW1kYV9zcmNfaGFzaCB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJyYW5kb21fdXVpZFwiIFwibGFtZGFfc3JjX2hhc2hcIiB7JTBBICAgICAgKyBpZCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsga2VlcGVycyA9IHslMEEgICAgICAgICAgKyBcIm1haW4ucHlcIiAgICAgICAgICA9IFwiNWEzN2JhY2IzNjI4MTg0ZTNkNTI3MjZhOTE1NjQxNTVcIiUwQSAgICAgICAgICArIFwicmVxdWlyZW1lbnRzLnR4dFwiID0gXCI3MTVhMGY3MzEwYWU0ZGFiZjliNzEwODAyMzM5ZGNkNVwiJTBBICAgICAgICB9JTBBICAgICAgKyByZXN1bHQgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICB9JTBBJTBBUGxhbjogMzcgdG8gYWRkLCAwIHRvIGNoYW5nZSwgMCB0byBkZXN0cm95LiUwQSUwQVx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMCUwQSUwQVNhdmVkIHRoZSBwbGFuIHRvOiB0Zi5wbGFuJTBBJTBBVG8gcGVyZm9ybSBleGFjdGx5IHRoZXNlIGFjdGlvbnMsIHJ1biB0aGUgZm9sbG93aW5nIGNvbW1hbmQgdG8gYXBwbHk6JTBBICAgIHRlcnJhZm9ybSBhcHBseSBcInRmLnBsYW5cIiUwQVxuOjpkZWJ1Zzo6c3RkZXJyOiBcbjo6ZGVidWc6OmV4aXRjb2RlOiAwIiwgInN0ZGVyciI6ICIiLCAiYWRkIjogMzcsICJjaGFuZ2UiOiAwLCAiZGVzdHJveSI6IDB9fQ==```
</p></details>